{"349568933": {"op": {"timestamp": 1637953065, "title": null, "comment": "Why does Czech Republic exist? I mean yeah they have thousands of years of original history but they are literally nothing but some racists and beer chuggers now"}, "replies": []}, "349536696": {"op": {"timestamp": 1637936249, "title": null, "comment": "Think you're smart, huh? Fucking NERD! Show us your textbooks, nerd!"}, "replies": [">>349536696\nWhat?", ">>349536696\nhttps://m.youtube.com/watch?v=O8aoRIjRnIs", ">>349536696\nI am retired and rich and my days of failing Calc IV and Matrix Algebra in engineering school are over. Goes to show you can be stupid at school but still make a lot of money.", ">>349536696", ">>349536696\n>Reading textbooks instead of the classics in original Greek and Latin\nNGMI", ">>349536696\n>textbook?\n>I extrapolate information using innate logic, nerd", ">>349536894\n>going to jewniversity", ">>349536696\n>>>/sci/\n>>>/diy/\n>>>/lit/", ">>349536696\nhere.", ">>349537004\n>i extrapolate information using innate logic\nUnfathomably dangerous Leaf individual.", "I derive everything from first principles", ">>349536696\npol is my textbook"]}, "349502098": {"op": {"timestamp": 1637910031, "title": null, "comment": "Why are /pol/chuds like this?"}, "replies": [">>349502098\nMacedonia is Greek, faggot", ">>349502098\nironic that liberals have most of those characteristics lmao.\nsage.", ">>349502098"]}, "349468559": {"op": {"timestamp": 1637890480, "title": null, "comment": ">alleged master race \n>cant win a fight because it is too cold \n>lose everything because opposition can actually withstand slight chill \n\nHow embarrassing"}, "replies": [">>349468559\nHitler never once used the term master race.", "You think only one side of the conflict suffered from the cold?\nBrainlet lol.", ">be commie cuck\n>fight for kikes \n>get shot in Finland \n>lol", ">>349468559\nThe Holocaust never happened.\nProve me wrong\nPro-tip: You can't", ">>349468838\nOnly one side lost lmao", ">>349468838\nIts a normie meme heres ivan frozen in Finland", ">>349468958\nYes, the soviets started the war and then failed to occupy Finland so they lose.", "nazis were trannies", ">>349469131\nWho’s still around \nGerman nazi party\nOr\nBased russians \n\nNo amount of copium will save you", ">>349468559\nWhy did you even resist lmao.\nYou knew they have 100 trillion soldiers.\nLife is not a video game.", ">>349469379\n>Who’s still around\nwe killed USSR", ">>349469379\nBoth are still around technically.", ">>349468787\nRightly so", ">>349468559\nImagine taking badly trained conscripts and sending them to fight for kike loans for both sides. What a shock.", ">>349469379\n>LE RUSSIANS", ">>349470160\nYou're protecting your own insecurities.", ">>349470240\nhow many of them were murdered by Cheka?", ">>349470460\nNext to none. NKVD was the thing up to date.", ">>349470240", ">>349468559\ndoes anyone have the pictures of the dead Russian women that Russia denied sending so Finland took a picture of their corpses?", ">>349468787\nHe did keep yapping on about his german people and German race though, which is silly since Germans are 3 different races, Nordic, celtic and Slavic/baltic \n\nHe wasn’t like Mosley who cared about all Europeans, he was a civnat Prussian nationalist\n>everyone Prussia conquered in the past is my people, even if they hate it here, I must work to erase prussia’s past shame, fuck all other Europeans\n\nPeople who think he was some sort of great pro white or pro european leader are delusional, he was just a more unbalanced less competent version of Bismarck", ">>349468838\n>You think only one side of the conflict suffered from the cold?\n>Brainlet lol.\nOnly one side started the war, only one side didn’t bring any winter clothes with them because they started the war in summer and thought it would be over before winter kek\n\nBarbarossa was meant to end before 1942", ">>349469520\nFinnland literally declared war on Germany on USSRs side, gave a bunch of land to the USSR, and let itself become an USSR puppet\n\nYou won the winter war but after that you became USSR cock holsters", ">>349468559\ncritical race theory dictates whites are the master race, and this is taught as fact in public schools", ">>349468787\ndo you have a meme about this? i don't believe you.", "Human bodies are not flammable.\n\nAll chemical reactions basically have\n>initial energy level\n>activation energy\n>final energy level\nTo initiate the reaction, you push the molecule over the activation energy, and then it releases some energy back. Depending on the final energy state, it will either release more than it took in, or less than it took in. If it releases more, that is called an \"exothermic reaction\". Energy from this one reaction could send the molecule next door over its activation-threshold, and thus cause a chain reaction effect. That's what a fire is, and it outputs lots of heat. \n\nHowever, an endothermic reaction is much the opposite, you must constantly be pouring energy into the reaction for it to continue. It costs energy in other words. Like boiling water for example is highly endothermic. \n\nHuman bodies are 60% water. All of this water must be boiled off, which is a tremendous energy cost. It costs 100 calories to raise a gram of water from 0 Celsius to 100 Celsius, but it costs 540 Calories (!!!) to boil this water off. This is called the Latent Heat of Vaporization, it's a tremendous energy sink. In fact, this is literally what nuclear reactors use to sink energy from uranium. \n\nWood is about 50% water, pretty close to a human body. But this is \"Green wood\" aka \"water saturated wood\". It does not burn, and pit outputs an awful black smoke. As the wood loses water, and becomes dry, it starts to become flammable. Although it's best to wait for 0% water to actually burn it with success.\n\nBut the water aside, wood is made of hydrocarbons. Intensely flammable of course, gasoline is a hydrocarbon. While the human body is made of various proteins, and is not flammable.", ">>349472988\n>Germans are Nordic, Celtic, and Slavic/Baltic\nSauce? I believe you, just want to understand the granular history", ">>349470661\nLenin murdered everyone\nThen the nkvd murdered everyone\nThen Stalin murdered everyone\n\nThe picture of Stalin that was edited 4 times in a row, each time removing another person in the room until only Stalin was left always makes me laugh", ">>349468912\nbut thats a photo of a germoid.", ">>349473276\nFinland never became a USSR puppet, and their resistance in the Winter War has bought them enough time and international attention to prevent their complete annexation by the USSR (as it happened to the Baltics who did not resist meaningfully).\n\nQuetch all you want, the point is that a tiny nation with no industry, no tanks at the start of the war, and a population that was less than the population of Leningrad alone throughly embarrassed the USSR. Not because Russians are subhumans, or the Finnish are ubermench, but because communists have slaughtered all competent Russian officers twice over. In this aspect, it is yet another way your retarded ideology fucked over that country.", ">>349473417\nIt's true, he didn't speak English at all", ">>349473501\nprussians are slavic/baltic/german mutts, german being usually the minority due to them originating from knight orders being given land to christianize it.\nmannsteins name used to be von lewinski.", ">>349473122\nWho was the one side that started the war? Team freemason?", ">>349473501\nNordics are native to Europe, they have been there for more than 20000 years, slavs and celts are Indo Europeans/aryans who are fairly recent invaders into Europe, modern european only arrived in Europe 5000 years ago \n\nGermany is kind of at the crossroad between all 3, germanic tribes use to describe the Nordic/Indo european people who lived in scandinavia, while the south and west of Germany was celtic, and the east was baltic (Prussians, Pomeranian) or Slavic (Silesians)", ">>349468559\nThe soviets were eating dinitrophenol or dnp which is industrial yellow dye that retards use for weight loss. Stuff makes you immune to the cold.", ">>349473975\nKvetch all you want, but Vyborg is not a Finnish clay anymore", ">>349474703\nI suggest this.\n\n1) During the Roman era, the Germanic languages were the same as the languages of people in Scandinavia. \n2) The Germanic people worshiped the same god as the people in Scandinavia.\n3) The Goths were a group that came right out of Scandinavia and settled in Ukraine.\n\nWhat if the goths weren't the only ones? What if there were actually waves of colonization coming down out of the frozen north and populating all of Northern Europe? So perhaps all of these blonde northern german people are actually just scandianvian colonists. And by extension, the Franks and Anglo-Saxons are also just Scandinavian colonists.", ">>349473501\nLater when Rome collapsed the germanic tribes raided it and many of them carved chunks out of it and formed kingdoms, eventually all of modern day Germany would be conquered by the franks\nThen their kingdom split amongst the sons of Charlemagne, and while literally no one spoke german in Gaul/west Francia, people in northern Germany did speak german, so the kings of lotharingia and east Francia would have to change the language and culture of half of their kingdom if they wanted to unify it anyways, and they picked their own language over picking the Latin/celtic spoken by the southern half of their kingdom\n\nAnd while the kings of west Francia just adopted the local Latin language, in the east, the populations of south Germany were forcefully germanized, it happened around the 8th century, before that Austrians, bavarians etc either spoke Latin or rhaetian/Pannonian\n\nLater when east Francia became the HRE (king Otto made a deal with the bishop of Rome, giving him control over all the clergy in his empire, in exchange for the bishop of Rome calling him a Roman emperor)\nThat’s how both the papacy and HRE got started\nAnyways the important point is that for the longest times, the Slavic areas that bordered the HRE/Frankish empire were tributaries, but around the 1200, they decided to conquer them (Eastern Europe was still pagan in the 1200s, up until the 1400s), so they launched crusades, that would eventually culminate in the baltic crusades that creates the Teutonic and Livonian orders, but most importantly brought east Germany, as well as prussia into the HRE, and they were germanized like the south had been a few centuries before\n\nA funny thing is that the map of germany’s genetic matches religion 1 to 1, all the R1b majority celtic south is catholic, while all the I1 Nordic north is Protestant, and the Slavic R1a east is Atheist", ">>349474703\npomeranians in middle ages were slavic not baltic", ">>349473503\nYes, just like Nikolas I has killed everyone, Alexander II killed everyone, Ivan the Threatful killed everyone, Yaroslav the wise killed everyone and so on. That's how white peoples work ffs. Are you even European? I'm not sure you're aware of Bourbons history At this point.", ">>349475303\n>Groźny\n>Threatful\nlmao", ">>349468953\nBump", "The germoid fears him", ">>349473975\nThey weren’t a full satellite communist state, but they did declare war in Germany when the USSR told them to do so, the USSR had complete influence over them, they just escaped becoming communist\n\n>>349474653\nI’m pretty sure hitler started operation Barbarossa, the Soviet’s weren’t expecting a war at all, their army was untrained, Germans destroyed most planes of the USSR that were all sitting on their airfields in the first hours and days of the war\n\nIt’s the same tactic America used during the Iraq war, you launch a surprise attack planned in advance to destroy as much of the enemy’s stuff as possible, while he is still literally sleeping in his bed\n\n>>349475132\nI would like to add, I think it’s probably more to do with community and doing what the rest of your people are doing rather than those races/ethnicities being strongly predisposed to any of those religions, but whatever the case, genetics, and religion/politics/wealth is a perfect match, the maps look identical", ">>349475132\nTell me more about Charlamagn. From what I gather, he was basically this Germanic king in France, which was a Romanized (and therefore Christianized) country. He launched this huge invasion of central Europe, conquered most of Germany, and then forcibly converted all of them to Christianity.", ">>349473417\nI have nothing to link to , but I speak a fair bit of German and have watched a lot of WWII documentaries that show Hitler speeches and I can't remember him once saying \"ubermensch\" in any speech. Have no idea if he wrote it anywhere. I've seen propaganda posters referring to ubermensch, but have never heard hitler say it.", ">>349468559\n.,?!", ">>349468559\n>alleged human poster\n>memeflag faggot bot\nMany such cases.", ">>349475445\nGroza has nothing similar to terror in russian, no idea how semisaksen languages work.", ">>349475915\nusually this particular ivan is called the terrible or fearsome in english", ">>349475049\n>1) During the Roman era, the Germanic languages were the same as the languages of people in Scandinavia. \n>2) The Germanic people worshiped the same god as the people in Scandinavia.\n>3) The Goths were a group that came right out of Scandinavia and settled in Ukraine.\nAll of those are true, germanics and Scandinavian are interchangeable terms\n\nBefore the fall of Rome and the \"migration period\" (name given to the period where germanic tribes conquered a bunch of land and created kingdoms all over Europe) germanics didn’t really exist outside of scandinavia\nTo this day it’s still where germanic genetic is, but back then it was the only place with the germanic languages as well, while today germanic languages are spoken far and wide, in england, in the celtic Central Europe, in the Baltic east etc\n\n>What if the goths weren't the only ones? What if there were actually waves of colonization coming down out of the frozen north and populating all of Northern Europe? So perhaps all of these blonde northern german people are actually just scandianvian colonists. And by extension, the Franks and Anglo-Saxons are also just Scandinavian colonists.\nI’m not sure why you are saying that like it’s a hypothesis, it’s what happened and it’s all very well (maybe not very well, it was the beginning of the dark ages after all, books were getting rare) documented \nBut they never settled massively the lands they conquered, mostly because they didn’t have nearly the population to do so\nAll I1 came from scandinavia, so if you see I1 anywhere, it had to come from scandinavia at some point (or be there since before the aryan invasions), and you almost don’t see any I1 outside of scandinavia, showing you pretty clearly that they didn’t populate or migrate anything, just conquer\nThe guys who got the most germanic migration were the brits, who are today around 30% anglo/viking, and only 10% I1 (original/true germanic)", ">>349476118\nFearsome — maybe, but nothing like the storm with lightnings and thunder like groza is. Ugroza is the source of the name, an inevitable threat.", ">>349475133\n>pomeranians in middle ages were slavic not baltic\nAren’t balts slavs themselves anyways?\n\n>>349475303\nNah maybe that’s how Russia and China work, but it’s not how Europe and white countries work, in Western Europe purges were very rare and very small, less than 20000 people in total died in purges during the French Revolution, that’s like a week of WW2 for russia", ">>349468958\nEveryone lost WW2 but Jews.", ">>349476480\nfirst of all, you have to make a distinction, slavs are a linguistic group.\nare balts in slavic linguistic group?\nno they are not.\n>>349476433\nim not sure about middle ages meaning, here the root gro- stood and thunder went to grom.\ngroza is left with meaning only fear, danger.", ">>349468559\n>Fight a multi-front war with a significantly higher kill/death ratio on every front\nSounds like something a master race would do, no?", ">>349476480\nA 100 years war? A war of two roses? I am starting to think you're but an Arab.", ">>349475596\nAlmost all the barbarian invaders were christian of the Arian heresy, while the western empire they conquered was still pagan (a big reason for the fall of Rome were christian elite strongly disliking the west for being pagan, and various generals backstabbing each other depending on their religion)\nAnyways Gaul fell to the visigoths, the allemanis, the suebis and the Franks, with the last roman/gallic free land was called the realm of the soissons\n\nThe germanics were here because the Roman emperors were very afraid of a gallic revolt, and had completely demilitarized the place, guarding it only with paid mercenaries who ended up rebelling\n\nClovis, who was the king of the Franks (and an absolute piece of shit, he said to be a Christian but did enough things to send him to hell a thousand times over, he murdered both his brothers to become king, then spent his life murdering and stealing from other people to increase his power) by Clovis’s death, the Franks controller almost a fourth of Gaul, and over the next generations of kings, they would slowly conquer all of Gaul by winning small battles against the other warlords, before the birth of Charlemagne\n\nCharlemagne was born controlling already all of Gaul, and conquered the areas that are today Germany, as well as a bit in Catalonia if I’m not mistaken\n\nHe is the guy who gave jews exclusive rights to banking, aka he is the main reasons jews became rich and influential today\nAlso he genocides the saxons for refusing to convert to Christianity, and also massacres all his knights for the same reason, he invited them to a feast at Verdun and slaughtered them all while they were unarmed, the guys who had won him all his wars kek\n\nAll this dynasty, the carolingians, were incredibly brutal barbarians anyways, who literally went extinct because they murdered their own family all the time", ">>349476656\n>are balts in slavic linguistic group?\n>no they are not.\nI thought they were\nWhat are baltic languages if they are not Slavic languages, I thought that Slavic was a bit of an umbrella term", ">>349476656\nYeah that's the difference. Back to Igors grom is just the sound that follows lightning, and the word for the whole storm has bred several different terms, ugroza is one of them. \"To bring a storm upon ones head\" if I dare. Otherwise it would be grozit' for threatening, grozny to be fearful for someone, ugrozhat' to sperg threats to someone.", ">>349468559\nDo jews really??\nHuh", ">>349477477\nthey are their own branch, more related to slavic than germanic but modern speakers can understand exactly shit.\nslavic is a group of languages that are commonly separated to \nwest: us, czechs, slovaks, used to be as well sorbs, pomeranians, weletes and some other tribes absorbed by germany.\nsouth: balkan crap.\neast: russians, ukros, belarussians.\nnow genetically i have no idea about balkans but us north slavs are very closely related, you couldnt tell a proper european russian from a pole or a czech.\nif north slavs are brothers then balts are our inbred swamp cousins.", ">>349476909\n>A 100 years war?\nA low intensity succession wars where the largest battles had like 5000 deads\n\n> A war of two roses?\nThis one actually had purges, but only of a very small number of people, it’s nothing like Russia and the communists\n\nThe communists in total killed 40 million people in the USSR, how many serfs do you think the Tudors killed to consolidate power? Probably 0 kek\n\nThe worst purges in Western Europe after the dark ages were \"killing the king, maybe his family, and maybe the leader of his most loyal nobles\", you compare that to Lenin killing every \"kulak\" in the ussr, or the nkvd killing millions on fabricated evidence for \"counter revolutionary activities\", or stalin killing half the generals of the red army in the Great purge \n\nI don’t understand how you can think those compare or how you came to the conclusion that Western Europe worked by massive purges and massacres like Russia and China", ">>349477971\nBalts are basically slavs mixed with Finns, it’s this simple, Finns lived in the Baltics before slavs even arrived in Europe, and when they did, slavs and the native finnish people mixed together \n\nI’m surprised the language is different though, I would have expected to just speak the same Slavic languages\nMaybe Baltic languages have a bunch of finno urgic loan words? Idk I don’t speak Latvian or Estonia so I can’t say, but that would seem likely considering the history of the region, languages that split off from early slavic, and have a lot of influence from finno urgic is what I would expect the Baltic languages to be, if anyone can confirm this it would be pretty cool", ">>349468559\nIt's General Winter. Russia can't be taken in the winter. Ever in human history, except by other Russians", ">>349478566\nestonia is not baltic.\nbaltic are those 3: old prussians, latvians, lithuanians, thats it.\nbaltic languages are gibberish to slavic speakers and finno-ugric is a completely different linguistic group.", ">Master race\n>Is subverted at every turn by a few nose people\nPick one.", ">>349478051\nSo now casualties caused by kikes are somehow irrelevant to ones caused by earlier emperors/tzars/knyases just because there were not enough populace and/or means of destruction? And that's why white people don't operate like that? Am I getting you right?", ">>349478891\nmongols took russia in winter", ">>349479615\nIt's not that hard to take over some dissolved knyazhestva/voevodstva that has no central power. You should know.", ">>349480062\nof course, its also not hard to attack an army that is in the middle of reorganization and has no supply for 80% of its mobile equipment and its leader orders not to shoot back too.\nwe are on /pol/ and its a historylet who lacks basic facts and think its muh winter who stopped germans.\nim not going to teach him nuance of medieval russia here", ">>349468559\nPretty sure there's more to it than that, Jew.", ">>349469131\nlol, what. The Finnish government was trying to surrender from day 2 of the Winter War. Even after their huge fuck up the Soviets took a vast swath of land from Finland that is still part of Russia to this day. They'd have taken it all, but they wanted somewhere to send the Fins. \n\nThe Soviets offered a hugely favorable land exchange to the Fins, they refused and got their shit pushed in. Congrats on shooting a bunch of conscripts who were freezing and starving to death anyway, shame about those islands and all of Karelia becoming Russian again.", ">>349480913\nplease remove these subhuman-intelligence bots from the simulation, they break the immersion", ">>349478566\nHey you blue white and red cunt! I just saw that you are french, so how about you frenchel my penchel, you baguette deelthroating, beauty mole on the face having, striped shirt, scarf and berette wearing, cigarette holder using, unshaved, fat ass having french whore!?!!!?!??!\nI'll hold you down while sticking my bite into your sale vieille pussy and choke you till you beg me to creampie you, you stupid pute.\nStop smiling, I know you're getting wet and if I catch you, I'll stick my dick into your mouth and use it on you like a toothbrush.\nAu reservoire.\n>Slaps your ass in a way that he touches your asshole.", ">>349473276\n>>349469520\n>you became USSR cock holsters\nLol no they don't they defended their soverinity against USSR in the winter war and later they allied with USSR to defend against schizo Hitler. Finland has very advantadions position tactically and strategically if you're on the defending side, so it's very hard to invade Fins, so just as they repelled USSR forces, later they repelled Nazi forces with USSR help.\n\nI don't know why you mad at us finbro, we're both chad winners at the end of the ww2.", ">>349481310\n>ID: Rubmahdix\nFuckin' hope so!", ">>349473276\nThe Fins utterly and completely lost the Winter War. \n\n>>349473975\nThere was absolutely no evidence anywhere that the USSR wanted to take all of Finland in the first place. Their approach to the Baltics they took over was completely different. \n\nYou're right about why the Fins spanked them so hard, but you missed out Stalin's personal intervention in the war planning. He overrode the original plan, and directed how it would be done.", ">>349480466\nFair enough.", ">>349481217\nYou clearly lack the literacy for a proper reference so here's something you can hopefully comprehend.\n\nhttps://en.wikipedia.org/wiki/Karelian_question", ">>349481913\nimmersion breaking lack of intelligence"]}, "349436321": {"op": {"timestamp": 1637874568, "title": "Hi God speaking here.", "comment": "All the unvaxxed are doing a great job so far. Let me tell you on something.\n\nEverything in life is free will and will manifests reality. People that took the vax don't need consciousness anymore as they are not conscious of what is happening. They don't need free will to be happy. Everything in life is free will.\n\nWorld economic forum says you will own nothing and be happy. So no free will and be happy. I put clues everywhere and you motherfuckers don't even see it.\n\nVaxxed people will still be judged whether they lived good or bad so rest assured vaxxed people still can go to heaven. It's just like the rest up here, they don't need consciousness.\n\nAnyway. Rapture soon with the next african variant. God out."}, "replies": [">>349436321\nQuiet, idiot. You'll pay for your false witness.", ">>349436321\ngod said to tell you that you are a faggot", ">>349436321\nIf you are god, make your flag moon's flag.", ">>349436321\nYes lord\nWaiting for the big event", ">>349436321\n>god here\n>not serbian flag\nuhm?", ">>349436321\nReal God here: OP was caught sucking an entire barrel of dicks, we have surveillance video", "God would never be from the Netherlands.", ">>349436321\nThat's a weird sci-fi lookin' dick washer right there...", ">>349438967\nI am fucking saving this line.", "I cringed", ">>349440437\nIsrael just banned travel from south africa. Just dont say i didn't heed your warning o lord. Rapture time."]}, "349404288": {"op": {"timestamp": 1637859170, "title": "RFK Jr names the CIA nigger who killed his father", "comment": "At 53 minutes\nhttps://odysee.com/@Truth_will_set_You_Free:0/The-REAL-Anthony-Fauci-with-Robert-F.-Kennedy,-Jr.-360p:e\n\nhttps://www.youtube.com/watch?v=aG_xw93irUA"}, "replies": ["20 threads on the nigger shooting psyops.\nFuck you guys."]}, "349371620": {"op": {"timestamp": 1637838592, "title": null, "comment": "Educate yourselves."}, "replies": [">>349371620\nWas/Were", ">>349371707\nholy kek nice gif", ">>349371795\nnot really, a helicopter designed like that wouldnt fly", ">>349371707", ">>349371620", ">>349371620\nmy pronouns are\ni'll/kill/you/you/fucking/retard", ">>349371828\n>not really, a helicopter designed like that wouldnt fly\nAs functional as a neo-vagina. Fitting.", ">>349371707\nFpbp.", ">>349371620\nEither he or she. He has a penis. She has a vagina.", ">>349371707\nTry it, honey. I'll toss YOU out of the helicopter.", ">>349372219\nthats sex, you retard\nnot gender\n>b-b-b-but they mean duh same thing\nthey havent meant the same thing for a LONG TIME \nstop making yourself look retarded", ">>349371828\nAnon, are you saying that during aircraft inspection... it wouldn't pass?", ">>349372314\n>they haven't meant same thing for a long time\nthey still mean same thing and one tranny coping and killing itself over it won't change my mind, in fact, it will only reinforce that fact", "Pol will remember every Jew and their face measurements to call th out, but are too scared of remembering two words for an individuals gender.", ">>349371620\n>national black justice coalition \n\nHow did black identity groups get so wrapped up in with all this weird LGBT nonsense considering how incredibly homophobic the black community has been historically? I would imagine this is driving Nasneed crazy.", ">>349371620\nI'll just call you a faggot", ">>349372494\n>2 words\nmale and female?", ">>349371620\nSorry, no can do. I'm anti-science, anti-education, etc. Nobody gets to power trip over my thoughts, actions and demeanor. If you want to control me - you will have to fight me to the death.", ">>349372314\nEveryone, including trannies themselves, think that sex and gender are the same thing. Pretending they're not is just inane pilpul.", ">>349371620\ntrannies everywhere\n\nburn this show down", ">>349371620\nnah. I'll just use faggot, much easier and simpler.", ">>349371707\nRe/Reeeeee", ">>349371620\n>stevonnie being used as an example\n\nso an alien who can assimilate people and integrate their characteristics, okay", ">>349372372\nBASED", ">>349371620\nalready done", ">>349371620\nI can manage it/that and was/were. Beyond that it's rope for you.", ">>349374873\nFrom back when jews were based", ">>349372372\nKek", ">>349375368\ntraditional christians are the real jews", ">>349371620\nI go by fuck/you", ">>349371620\nthat should be some kind of identity fraud, and someday cartoon network will be sued for trying to harm children and for promoting child abuse.", ">>349371620\nI wish the Italians were competent enough to take Greece without German troops in WWII."]}, "349338001": {"op": {"timestamp": 1637814709, "title": null, "comment": "what in the fuck is wrong with wisconsin?\nhttps://www.youtube.com/watch?v=wfJAJ4YPKAc"}, "replies": ["Bump. Who funded this asshole?", ">>349338345\nwho else other than racine county board supervisor nick demske", ">>349338001", ">>349338617\nThat's one hell of a honker.", "Honestly sounds like some soros appointed officials or just regular jewery.", ">>349338001\nLand of the cucks. Home of the mutts. Georgia will soon become like it.", "Kek, yep. Gets paid by some jewish NGO. This guy has probably bailed out dozens of black criminals. \n\nHonestly/pol/ should dig into this guy's background, it would probably link to alot of other people that bail out criminals and antifa", ">>349338001\nThe jews put him up to this shit. Revenge on goys for letting Kyle kill jews.", ">>349340389\nwe've been trying to train the niggers to act like humans for 165 years now surely mr. demske has the solution", ">The frozen blast of sunrise melts up, cottony popsicle. I love that. I love the flaming carpet parapet \npeeking sunrise provides at my feet, scintilit up pockmarked Michigan dimple dappled blond \nshoxygentile. I Blatz Schlitz and Pabst it, Brew City stylus. I cream city brick shithouse guzzle. Illicit \ncarcinogens—contrail scars on the Blu-ray—only more better ye butter the saline skyline, yo.\n>shoxygentile\n\nThis is a poem by Nick, he is very evolved in the poetry scence there.", ">>349338617\nWho funded demske I mean. This guy just has 10k to blow on bail for some random nigger? I’m not buying it.", ">>349338001\n>robbed a swatfag\nabsolutely based", ">>349338617\n>>349341044\n>Who funded demske I mean. This guy just has 10k to blow on bail for some random nigger? I’m not buying it.", ">>349340034\nhe is, soros justice fellow", ">>349340389\n>/pol/ should dig into this guy's background\nWhy? Not like anything will be done about it.", ">>349341044\ni have to imagine it's some kind of personal crusade if >>349340389 is to be believed. if he was being funded they'd probably pick somebody who wasn't already working in the system. maybe i'm missing the point?", "digits and aliens come an wipe us off the planet", ">>349341515\nDon't be so demoralized", "Welcome to the new normal", ">>349341515\nEven normie Republicans hate soros", ">>349338617\nDamn what monster schnoz", ">>349338001\nD E P O R T\nE\nP\nO\nR\nT", ">>349338001\nthe glowniggers selectivleyh release niggers that they believe will potentially kill some white people.", ">>349341542\n>if he was being funded they'd probably pick somebody who wasn't already working in the system\nwhy? mask is off now\nappearances are irrelevant", ">>349338617\nI don't even need an early life for this guy", ">>349341420\nliterly me", ">>349338001\nBurmp", ">>349338001\nMilwaukee is what's wrong with Wisconsin.", ">>349341909\nThis. US is openly corrupt. Banana republic", "I don't think he is jewish, just some nigger lover. The person arrested might have been related to his wife or something.", ">>349342426\nthe pieces are all coming together", ">>349343270\nThis country is so hilariously fucked", ">>349338001\nWisconsin is pretty based. The white girls here absolutely black dick.", ">>349342426\n>>349343270\n>>349343520\n\nD I S E M P O W E R\n\nR A C E\n\nM I X E R S", ">>349338001\nSoros DAs", ">>349341515\nBe the change you want in life.", ">>349343520\n>>349343625\n>>349343890\n>>349342171\n>>349342144\nthis just in wisconsin bros, any idea who could be responsible? videos fron an hour ago.\nhttps://www.youtube.com/watch?v=WuKSvo7_GCs", ">>349338001\ni wish she would sit on my face", ">>349344222\n>near MLK \nKek, niggers", ">>349340389\nCrop your screenshot you absolute mongoloid.", ">>349341044\nSoros Foundation", ">>349344489\nThats a waste of time", ">Nooooo not the swat twats. What will we ever do without securing supplies for our overfunded authoritarian government entity", ">>349344222\nYea both victims were white. It excites me to see black warriors taking the initiative and doing what they have to in order to wipe out the white menace. \n\nAs brother Joe Slovo once said, “ You can't go to a negotiating table pointing a gun, but you've got to keep it over your shoulder”", ">>349341989\ndo we ever need to early life anymore...\neven without a picture or voice, the actions *speak*", ">>349344202\nwas he ok", ">>349345114\ni'd rather have a swat team with machine guns than jamal and his gang of pavement apes", ">>349338001\nLegal bail\nIllegal firing", ">>349345381\nI'd rather not be a cuck for the state", ">>349342426\nget your jewdar fixed anon", ">>349338001\n>what in the fuck is wrong with wisconsin?\n\n\"Progressive\" Liberalism", ">>349338001\n\n\nCAN NON-AMERICANS BAIL OUT AFRICAN AMERICANS?"]}, "349305117": {"op": {"timestamp": 1637797844, "title": null, "comment": "TIL Kamala Harris has a Jewish husband. Her kids look nothing like her"}, "replies": ["Looks like a lovely family.", "that dude on the far right is one of the worst passing trannies i've ever seen.", ">>349305117\n> Harris met her husband, attorney Doug Emhoff, through a mutual friend who set up Harris and Emhoff on a blind date in 2013.[334] Emhoff was an entertainment lawyer who became partner-in-charge at Venable LLP's Los Angeles office.[334][335] Harris and Emhoff were married on August 22, 2014, in Santa Barbara, California.[336] Harris is a stepmother to Emhoff's two children, Cole and Ella, from his previous marriage to the film producer Kerstin Emhoff.[337]\nwell no shit", ">>349305117\n>TYL those aren't her children.", ">>349305117\n>Her kids look nothing like her\nBecause they aren't her kids dummy. She's a step mom.", ">>349305210\nKamala isn't really part of it", ">>349305117\nKamala Harris is \n50% indian\n25% white\n25% black\n\nWhat do you expect her kids to look like?", ">>349305117\nSuch a fake whore.", "why is the girl the tallest one there?", ">>349305117\n>Her kids look nothing like her\nWhy does that matter to you?", ">>349305117\ni wanna fuck her daughter", "She married Alex Jones?", ">>349305117\nThose aren't her kids, Kamala is a cuck", ">>349305117\nThose aren't her kids, she's a cuckqueen", "step-kids", ">>349305564\nShe looks like a diversity hire in the picture. The real family is clear", ">>349305587\nThis is prob the best pic of it... The rest are... bad", "I usually think that the average user on pol is a delusional retard who likes to play smart, I am quite a normie, but HOLY SHIT\n\n\nHow the fuck are joe Biden sons both married to a Jew? Half of trump heirs are married to a Jew, Kampala Harris is married to a Jew,...this is so fucking unreal\n\nI am in the stage that Jews are only high achiever and have parents with mirino to make their ideas becomes a reality, but damm they are a lot", ">my husband's son", ">>349305117\nHer and her old man could be brother and sister as well. They look similar in the face.", ">>349305210\nHer daughter looks like a coal burner.", ">>349306003\nweird isnt it?\ni wonder why bidens cabinet has so many jews...\nits basically nepotism, and if other groups could organize as well they'd do the same thing", ">>349305117\nIt's pretty well known that she's sterile. It happens to a lot of whores. Their tubes clog up with genital warts, etc. It's nature's way of saying fuck these dumb bitches.", ">>349305117\nShe has never given birth. Utter failure as a woman. Genetic dead end.", ">>349305117\nhe must think about how slick willy has been up there so many times, treating her like the pig slob she is. how does slick willy dick taste?", ">>349305117\nPost jewish booba", ">>349305117\nI would like to commit the sex with her daughter if you understand what i am trying to say", ">>349306608\nyou don't want that fren", ">>349307053\nI'm so fucking horny for art hoes. I want to fuck a coked-out tumblr hipster DIY aesthetic astrology thot in her lip gloss DSL mouth. I want to cum all over a girl with thick frame glasses and edge dyed bobcat bangs. Everytime I hear a THICK, waist-high-jean-clad braindead choker-wearing slutty wiccan minx say \"yikes\", \"y'all\", \"big mood\", \"cancelled\" or \"this is a bop\", I get an uncontrollable urge to run up to her and fondle her d cups and sweaty fat thighs. I want to pour my white olive oil onto her contoured cheeks and neotenous faces and rhinoplatisized nose. I want to finger an art hoe through her jean overalls while pretending to be interested as she talks about van gogh and arctic monkeys and how david foster wallace fans suck and gilles deleuze and VICE news and 'union pool' in williamsburg and steven universe and homeopathy and saveur magazine and taking adderall to pass exams. IM SO. Fucking. Horny.", ">>349306608\nI hope you like fisting because that's all that can get her off. Read her blog", ">>349305305\ntypical of people on the far right", ">>349305117\n>her kids\n\nShe's a stepmom, idiot.", ">>349305117\n>TIL Kamala Harris has a Jewish husband\n/pol/ is unironically reddit now", "Need to coom inside her\n\n>>349307405\nHOLY BASED", ">>349306200\nShe's a tranny now IIRC", ">>349305555\nHer real mom is a swede.", ">>349307360\nPatrician taste", ">>349305117\n>Her kids look nothing like her\nHmm I wonder who their mother could be.", ">>349307748\nThat's actually a man", ">>349307640\nShe's not, she's just obsessed with androgyny like all Jews with too much money and time on their hands", ">>349305117\nShe's a stepmother.", ">>349307748\n>'first in line at Uncle Addies Summer Camp' look", ">>349306608\n>if you understand what i am trying to say\n\nMy apologies, but not entirely. Please explain in further detail.", ">>349306200\nyour sick in the head. Just as delusional as them if you say stuff like this. Total horseshoe effect.", ">>349307053\n>>349307607\nis that seriously her? ohhh no no no no", ">>349308634\nWhat you have to understand is that rich New York Jews exist in an entirely different world from the rest of the population", "steps daughter OP. tho they probably think the same.\n>>349307053", ">>349305305\nThat's an FtM, you've ironically validated her", ">>349308560\nYou is only into fisting. You need to fist her in her poosey hole too", ">>349305435\n>has kids\nshe didn't have time for that, she had dicks to suck on the way up the spy ladder.", ">>349310240\n>fisting\nYes", ">>349307053\n>>349307607\nHonestly i don't even think she looks that bad. Also i love pubic hair and i bet she has an enormous bush, so that makes it even better.", ">>349305305\n\nKamala is a trannie bro.", ">>349307360\nastronomically based", ">>349305117\nshe has no kids\nthose are his kids"]}, "349271446": {"op": {"timestamp": 1637783147, "title": null, "comment": "They were white amd pursued a criminal. Should've been let off. Simple as."}, "replies": ["and*", "Wignats look like, and are gay little bitches, Fuentes was right", ">>349271446\nNope. this isn't your redneck vigilante fantasy. You can't be a vigilante because you'll end up killing innocent people. The mcmichaels thought he was stealing, but he was really just jogging, now an innocent man is dead and they'll spend their life in jail surrounded by big black men who know what they did.", ">>349271446\nSeethe, chud.\n\nThe days of white boy small dick rage ruling America are over.\n\nThe age of BBC has begun.", ">>349271951\nyou have an ancap flag bro.", ">>349271446\nThe judge did something that removed the opening for a decision from the jury over whether the citizens arrest was legal or not", ">>349271446\nAre they expecting the death penalty?", ">The McMichaels will walk bros. They were within their legal rights to chase down a guy they didn't recognize for five minutes, threaten his life, and then kill him when he tried to defend himself.\n\n>It was a citizens arrest bros. See, there was crime in the area and this guy was running down the street that basically makes him guilty right?\n\n>Also he trespassed on a construction site bros. Thats basically a felony kinda. Which is grounds for a citizens arrest right bros?\n\n>Okay but why is Roddie guilty? He just filmed the whole event. Sure he used his vehicle to block Ahmaud Arberys escape but that doesn't mean he's an accomplice right bros?\n\n>But he was wearing construction boots! Sure in every video he's wearing white nike sneakers but Stormfront said they were Timberlands!\n\n>He had a hammer, bros! Wait, what do you mean he didn't have a hammer? Okay well he would have maybe had a hammer if he could.", ">>349272280\nYou have a weak chin bro", ">>349273537\nno clue", ">>349273930\nfalse", ">>349273777\nBased and checked. \n\nChuds absolutely seething.", ">>349273777\nYou will never be a woman", ">>349274758\nSeethe, incel."]}, "349239034": {"op": {"timestamp": 1637768602, "title": "White Ethno-Religion General", "comment": "This thread is devoted to developing a future white ethno-religion. Feel free to add ideas and literature.\n\nThe Doctrines:\n\n- Nature’s Eternal Religion – Part II, The Salvation\n\nThe Allegories:\n\n- The Brothers Grimm\n- Afanasyev\n- Plato’s Republic\n- Faust\n- The Divine Comedy\n\nMetaphysics:\n\n- The Critique of Pure Reason\n- Symbolic Logic\n- Novum Organum\n- Foundations of the Metaphysics of Morals\n\nPS: Atheists, paganlarpers, abrahamics, shills, and sliders gtfo.\n\nsome background music:\n\nhttps://www.youtube.com/watch?v=0lEmQwxNmEQ\nhttps://www.youtube.com/watch?v=3_Eq9H4bSdQ\nhttps://www.youtube.com/watch?v=y0PTjxGtRlw\nhttps://www.youtube.com/watch?v=X7rtImnDkEc\nhttps://www.youtube.com/watch?v=OM9hdCpdcqc\nhttps://www.youtube.com/watch?v=8PtxaUD0jXE"}, "replies": [">>349239034\n\nmy dude, if you reject jewish heritage, folklore, and mythos and you dont pretend a circumcised jewish rabbi is god then you are a jew\n\npre christian european heritage is hecking cringe and europeans were basically niggers before the blessed jews brought their religion to europe through greece via roman multiculturalism\n\nit is physically impossible to have good values and behaviors for healthy family, community, race, and nation unless we adopt the writings of the jewish tanakh and a jewish rabbis claims to fulfill its prophecy\n\nif you reject the jewish rabbi as your god then you are a jew (but like a fake, modern jew not a real jew because real jews believe in jesus, so says the bible)\n\nsay it with me\nCHRIST IS KING", ">>349239134"]}, "349202773": {"op": {"timestamp": 1637742106, "title": null, "comment": "He unironically would have made a great president. Like Eisenhower. I don’t care about your schizo “deep state” nonsense."}, "replies": [">>349202773\nMormons swear their loyalty to the mormon church above everything else in their cultish masonic temples. No thanks", "a zionist mormon, truly a great leader of burgerstan", ">>349202840\nThe church was super based until the mid 90's. Now it's fucking horrific, worse than the catholic church by far.\nt. jack", ">>349203048\nIts always been fucking retarded. Shit was literally started by a pedophile who married and fucked a 14 year old.", ">>349202840\nThis. \nFun fact. Mormoms are chosen to sit at the heart of icbm silos because they would have no qualms turning the keys if it came down to it", ">>349202773\nBetter than obama\n>>349202840\nAs opposed to the church of satan? I’ll take the milk drinking retard", ">>349203229\nVoting for the lesser of two evils is a pathway to hell", ">>349202773\nLiteral human garbage. The charisma of a dog turd. No one would follow this shit. Stop trying to delude yourselves that anyone right of Stalin could hold a candle to Trump.", ">>349202773\nYou are a schizo and he is coopted by the deep state."]}, "349167954": {"op": {"timestamp": 1637720271, "title": "Who here used to be on the TRS forum when it was invite only?", "comment": "I was on in when it was private. I got invited by a small youtuber I subscribed to. Some of the memes on there were funny. I havent listened to TRS in a long time now. I dont really resonate with most of the alt right stuff type stuff anymore. But I admit it was fun back then"}, "replies": []}, "349136360": {"op": {"timestamp": 1637705904, "title": "No life possible without a shot", "comment": "Provide your shoulder now, you are contagious, we will fix it. A human is a threat to another human.\nJust rhink of it how you are being voluntarily/forcefully moved to the cities, fed literally a cdc/who/eu approved shit, injected up to 15 times while being a 1 year old and told that it is good for you and if you oppose - you are a clown.\nHow are you cucks letting them do this to you?\nYou are working and paying for 20-30 years for a miserable stone box in a stone jungle full of different fumes which are not good for you. How did this happen? Kikes? Sure. You are a victim? No. You are an accomplice.\nFuck you, fuck the system and fuck this brainwash. This is ridiculous, no matter how you look at it.\nKeep arguing whether this or that is good, while they destroy you. Keep eating shit and being a consumer. Upgrade your phone everyday and have nothing behind you, be a good citizen. Inject everything, try heroin as well, i heard you feel good after a shot, you gotta try it. Fucking consumers, you won't even burn in hell, shit does not catch fire."}, "replies": ["Thread Type: Rage Bait. Call to violence\n\nDescription: The OP works to keep you demoralized and raged instead of offering solutions. Notice how everything is in the form of a question to keep you confused and angry. \n\nThe intended result is a race war, civil war and then call for Communism as the solution.", ">>349136360\nThe lockdown has been the best thing that happened to humanity in a century at least. It exposed the entire world Jewish economic system as a paper tiger with no consequences. This makes vested interest KIKES like you really fucking angry. Nobody has lost any rights and nobody has been forced into vaccinations. Women are losing status and are being exposed as whores, jews are losing control over their worker cattle as the pointlessness of the majority of jobs and office environments is being exposed. People are spending time with their families and finding wholesome hobbies as they realize all their lives so far have been vapid.\nBut you, JEWISH DEVIL, hate that this is happening. You NEED to have your workers under constant supervision at the office. You NEED people to spend their money on non-essential things and you NEED them to care only about sex with random strangers while prying apart the family unit.", ">>349137265\nMost of it is written in questions so you dumb shit started questioning events surrounding you. But of course it is easier to swallow already processed/prepared data thrown in tour throat from tour favorite msm"]}, "349102113": {"op": {"timestamp": 1637691244, "title": "Can't tell if based or degenerate", "comment": "OK so I found this show and can't tell if it is based or degenerate. Also I think this is some kind of cult.\nhttps://www.youtube.com/watch?v=TWzRmcRgRRs&t=616s"}, "replies": []}, "349069029": {"op": {"timestamp": 1637674046, "title": "Ryan Balch - Description of Events in Kenosha", "comment": ">This is my Official Statement regarding actions that took place on 8/25/2020-8/26/2030 in Kenosha Wisconsin.\n\n>I'm gonna start with a list of terms and their definition.\n>BLM- a member of or the peaceful protesting contingent.\n>Antifa- a member of or a group of far left militants that partake in direct action.\n>Agitator- a person or persons who are not affiliated with any defined group. There for the specific purpose of causing destruction and mayhem.\n>Militia- armed private citizens acting as a member of a nonuniformed force.\n>MTH- Militia Held Territory\n>NML- No Man's Land\n>PHT- Police Held Territory\n\n>Yesterday at 6pm i joined a contingent of militia along with two unaligned observers headed to Kenosha Wisconsin to protect citizens, their property and their livelihoods.\n\n>After infiltrating in Kenosha we found a group of militia made up mostly of males in their early 20's and late teens. Realizing that they were undermanned and had no leadership on ground at all. We joined them and I inserted myself into a tactical advisement role. The owners then deputized us to protect his properties. We then were joined by another group of bikers carrying hatchets, ball bats and firearms.\n\n>After sorting it out we left them at the southern location. As that was the least likely place for them to meet protesters.(where the first shooting and subsequent exchanges of fire came from.) we then moved to the north location 2 city blocks to the north. Where we took up defensive positions and placed men on the roof. We were on the demarcation line for MHT and NML. Protesters coming south on Sheridan would encounter us before anyone else thus giving us the ability to set the tone for the interactions between BLM, Antifa and Agitators with Militia."}, "replies": [">For the first couple of hours things were mostly uneventful aside from Agitators trying to break into and burn down a restaurant. We crossed into NML to stop this and aided by BLM we were able stop that. The same agitators around 30-45 minutes later probed our northern boundary. And we shooed them off by being verbally aggressive. As the night dragged on we made frequent trips to the southern location eventually we found that it had been abandoned by the bikers. So I gave the hospital security my phone number. And they agreed to inform me if something happened there.\n\n>When I returned from that trip we were joined by another friend of mine a Marine Veteran and maintained our perimeter.\n\n>For the next hour or so. Around this time is when a KPD Officer approached us and this is where they told us that they were going to be pushing the protesters towards us because we could deal with them. We never agreed to this and (as has been cleanly cut out of every video of me explaining this) thusly switched to a protect the public stance. including BLM, Antifa and the public at large.\n\n>KPD made a conscious decision to abandon the people of Kenosha to people they felt justified in using machines and weapons of war against. And were going to piss them off and drive them at us and let the chips fall where they may. We on the other hand had other plans. We quickly setup an aid station in the building we were protecting. Kyle did most of that. We started leaving MHT and going into NML to retrieve wounded BLM and Antifa members providing them with first aid and helping them get to the hospital. We escorted groups of BLM past KPD Snatch and Grab teams. All the while letting everyone know that we were there for them. To protect, to aid and to offer a bit of comfort.", ">All the while having tense exchanges with agitators who were dead set on destroying the town and causing serious bodily harm to innocents. Notable of which was the bald guy in the red shirt. If you were between him and something he could destroy he'd threaten you, he'd verbally assault you, he'd bluff charge you with something in his hand. He was in fact not being very cash money.\n\n>Agitators attacked us with homemade chemical weapons and with things taken off off police. We never once responded with violence lethal or otherwise.\n\n>The protesters went back and forth with KPD several times KPD up and down Sheridan. When KPD saw we were running an aid station they gassed us. So bad that I required medical care. As Kyle escorted me into the aid station they tossed us water and mockingly said they appreciated what we were doing.\n\n>After that they'd pushed the protesters pass the intersection with the gas station. Kyle my Marine friend and myself walked passed the police and started looking for injuries to treat. I got accosted by an agitator and got separated from them during this.", ">Unable to locate them I started back to the north building and got stopped by the cops. That's when the shooting started. Upon hearing the shots I ran towards the gunfire moving to cover. To my left I spotted my friend rendering aid to the guy shot in the arm. I ran over made sure he had it and ran to the guy who was shot in the chest. He had unfortunately already passed. I helped load his body and effects into the MRAP when shooting erupted again. To the south so I ran south to the southern location upon arrival the area was being shot up from a building to the west. I also had picked up a cameraman and two armed Antifa on the way there upon seeing armed individuals the shooting stopped. Until the police surrounded the building.\n\n>It was a chaotic situation and no one knew how many shooters there were or why. But aside from a few individuals the different factions on the ground came together to at least try to handle the situation. Im under the impression that there were two. But only one actually shot anyone.\n\n>At this point things settled down we gave a couple of statements to freelance media. Had a great conversation with BLM about the police creating the situation and then we left.", ">In closing\n>Last nights situation was a terrible event. One that's being twisted to further divide the people. I've seen my own words and actions being twisted so much that they don't reflect reality. 20 seconds of several minute long conversations being put forth as gospel.\n\n>I put this together to get my version of the night out there. To clear the air. It is my belief that we only faced one monster out there that night. The Government. it sought to agitate, and create a situation where this would happen. I'm seeing people refer to this as the start of some \"civil war\" in certain communities. I don't know about that but it's even clearer to me after the fact that we need to unite under a common cause and stop letting them trick us into killing one another and destroying one another's lives. Together we're far stronger than we are divided.", "Balch glows", ">>349069029\nwhat a fed", ">>349070227\n\nI don't think he does. Just former .mil, like his fren he called up to come out. Some of the Boog and BLM that were out that night do.", ">the police created this situation on orders from the government and we were pawns in it\n>I repeat we were pawns in it\n>We need to keep being pawns playing our part which is to be the pawn\nSo this how useful idiots think", ">>349071317\nHe took Kyle into that mess in the gas station and then disappeared. He set Kyle up.", ">>349069029\n>>MTH- Militia Held Territory", ">>349069029\nBalch left a kid he knew to be inexperienced and somewhat fearful. Balch is not a good guy, he ditched his battle buddy. BALCH, YOU SUCK COCK BY CHOICE.", ">>349069029\nthe /pol/ server link is:\nhttps://discord\n.gg/cqBSrAZDQW\n\nJOIN\n/;//;/;'/'"]}, "349033118": {"op": {"timestamp": 1637647007, "title": "exopolitics general - kyle odom edition", "comment": ">b-but aliens haven't done anything\nhttps://www.docdroid.net/Nu3OkY2/odom-manifesto-pdf\nhttps://www.youtube.com/watch?v=rO_M0hLlJ-Q\nhttps://www.youtube.com/watch?v=SKsLK_Na7iw\n>b-but the technology isn't possible\nhttps://www.youtube.com/watch?v=H5ftmamL2Pw\nhttp://users.neo.registeredsite.com/8/0/2/14515208/assets/thematrixdeciph.pdf\nhttps://documents2.theblackvault.com/documents/cia/CIA-RDP96-00788R001700210016-5.pdf\nhttps://www.military.com/video/aircraft/military-aircraft/tr-3b-aurora-anti-gravity-spacecrafts/2860314511001\nhttps://en.wikipedia.org/wiki/Holographic_principle\nhttps://en.wikipedia.org/wiki/Simulation_hypothesis\n>b-but there are no leaks\nhttps://archive.md/E6Xap\nhttps://www.youtube.com/watch?v=thdzV3VGzwo\nhttps://www.youtube.com/watch?v=ZBsIsLRHCEw"}, "replies": []}, "349002207": {"op": {"timestamp": 1637630810, "title": "Armed Robbery", "comment": "Well /pol/. Was this justified?"}, "replies": [">>349002207\nBlack lives matter.", ">>349002310\njewish marching orders", ">>349002310\nOops", ">>349002310\nNo they don't/"]}, "348971911": {"op": {"timestamp": 1637617243, "title": "STOP WITH ((OBVIOUS) ) DIVERSION TACTICS", "comment": "WHATS GOING ON WITH THIS BITCH?!? \nSHES ON TRIAL\nWHERE CAN WE GET THE TRANSCRIPTS"}, "replies": [">>348971911\nNothing. Delet immediately", ">>348971911\nThe conspiracy theories surrounding Jeffrey Epstein have all been debunked several times.", ">>348971999\nChecked", ">>348971911\n>WHERE CAN WE GET THE TRANSCRIPTS\nYou can't. We have to wait for the (((legacy media))) to spoon feed us snippets.", ">>348972080\nwhat a kyke", "Get in here >>348965359 this shit is fucked", ">>348972080\nlets see you debunker kyke go ahead we are waiting", ">>348972118\nyes, it would terrible if all the records were leaked", ">>348972277\nbut i wanted to bump more than one maxwell thread so ima stay here", "Listen here it wont be televised.\nhttps://www.justice.gov/usao-sdny/united-states-v-ghislaine-maxwell\nTranscripts updated as they happen.\nhttps://www.courtlistener.com/docket/17318376/united-states-v-maxwell/?page=3&\nLatest article.\nhttps://www.dailymail.co.uk/news/article-10226755/US-prosecutors-think-Ghislaine-Maxwells-contacts-book-provide-compelling-evidence-guilt.html", ">>348972080\n\nkys", ">>348971911\nall these threads are getting shoad"]}}