{"350126167": {"op": {"timestamp": 1638289909, "title": null, "comment": "Why are whites so bad at maintaining their colonies and civilizations?"}, "replies": []}, "350092148": {"op": {"timestamp": 1638266972, "title": null, "comment": "The anti-gay people on /pol/ are repressing their own deviant sexualities; desperately clinging to the false belief that somebody \"made them gay\".\n\n>Some studies have shown that people who are homophobic are more likely to have repressed homosexual desires. In 1996, a controlled study of 327 heterosexual men (half said they were homophobic by experience, with self-reported orientation) at the University of Georgia found that men who were found to be homophobic (as measured by the Index of Homophobia) were considerably more likely to experience more erectile responses when exposed to homoerotic images than non-homophobic men. Bernard et al. 2012 arrived at similar results when researchers found that students who came from \"the most rigid anti-gay homes\" were most likely to reveal repressed homosexual attraction. The researchers said that this explained why some religious leaders who denounce homosexuality are later revealed to have secret homosexual relations. They noted that \"these people are at war with themselves and are turning this internal conflict outward.\" A 2016 eye-tracking study showed that heterosexual men with high negative impulse reactions toward homosexuals gazed for longer periods at homosexual imagery than other heterosexual men.\n\nNobody is to blame for your homosexuality. You were born that way. Saging or reporting won't make this any less true."}, "replies": [">>350092148\nkys faggot", ">>350092242\nThis brit shoves things up his ass then feels extreme shame", "fuck off queer", ">>350092148\ndont care still wont become homosexual", ">>350092148\nKys faggot", "I'm bisexual but prefer women\nI don't mind looking at gay porn or naked men but anal sex grosses me out. Not the cock though", ">>350092148\n>OP is a faggot\nWe already knew that", "Easily refuted Freudian bullshit from the faggot OP. Sad!", ">>350092148\nOh no guys, we all better start sucking cock, and chugging man ass", "I'm a self hating bi wizard virgin what of it? If I wunna fuck my mom and a femboy then do be it don't judge me but don't spread your bullshit in me like a guilt trip NIGGER", ">>350093784\nSelf hate is fine just don't inflict it on others", ">>350093890\nI try not to but end up yelling at vaxtards Irl sorry I can't help it", ">>350092591\n>ID: BOy\n\nLMAO boy lover", ">>350092148\n(((some studies)))\nkys faggot\nNobody is afraid of faggots. We are disgusted by your foul disease spreading genetic dead end lifestyle.", "fags reproduce by touching kids", ">>350094064\nYou are probably an anti-vaxxer so I don't buy that you're just against disease\n\nAnd no, you're not afraid of gays you're just ashamed of being one", ">>350094109\nIs that why you're gay? Did someone touch you?", ">>350092148", ">>350094206\nYou will never be heterosexual", ">>350092148\nSorry desert rat, it's just I'm simply not gay", ">>350094280\nhis name is \"OP\"\npresenting to the Emergency room with Hypersemenemia\n\nSemen, meaning Cum\n\nEmia, meaning presence in blood\n\nHigh presence of semen in the blood", ">>350092148\nI'm not homophobic i just think homos are an affront to Christ.\n\nThe real problem is the homos who cut their peepees off and trigger the collapse of civilization. But i guess the root problem is still homos because they're just mutilated homos. But when you really think about it the Jews did it. The Jews are the original affront to Christ so they're the biggest problem.", ">>350092148\nA fag tried to molest me as a child. Maybe I too would be a fag if he was successful, alas he was not. \nThere is a massive overlap between fags and pedos.", ">>350094197\nI was fiddled by my mom and I'm super straight", ">>350095075", ">>350092148\n>The anti-drug people on /pol/ are repressing their own drug addiction;\n>The anti-porn people on /pol/ are repressing their own porn addiction;\n>The anti-gambling people on /pol/ are repressing their own gambling addiction;\n>The anti-vice people on /pol/ are repressing their own vices;\nNo shit batman. The only difference between a virtuous person and a person riddled with vices is that one of them is capable of repressing their urges. Fix your fucking life you depraved fuck.", ">>350095329\nNo I'm smart"]}, "350059714": {"op": {"timestamp": 1638243599, "title": "#notallelves", "comment": "dont make elves synonymous with jews pls"}, "replies": [">>350059714\nThey already are though.\n>secluded\n>scheming\n>ethnically homogeneous\n>technologically advanced\n>have an oversized feature on their head", ">>350059714\nelvish claws typed this post"]}, "350028448": {"op": {"timestamp": 1638226739, "title": "Hey /pol/, wanna hear a joke?", "comment": "What do you call it when a white person shoots a black person?\n\nCultural appropriation."}, "replies": [">>350028448\nHaha he said black PERSON\nAHAHAHA", ">>350028811\nNigger would be too vulgar here. I wanted it to look like a normal joke that you would hear at a stand-up.", ">>350028448\n>person"]}, "349997436": {"op": {"timestamp": 1638211591, "title": "Omicrom predictive programming", "comment": "https://gematriaeffect.news/omikron-the-nomad-soul-released-november-5-1999-the-new-omicron-covid-variant/\n\nhttps://youtu.be/hiOfNHRo9-s\n\n\nwhen you fags going to learn the code?\nYou really look like fucking retards regurgitating the news thinking you are in opposition to the cult"}, "replies": [">>349997436\nwhere else do you go other than gem.news? its the only one ive found thats really informative", ">>349997998\ngematriaeffect.news\nold blog freetofindtruth.blogspot.com\ngematrinator.com has a blog too\nfreetofindtruth.com social media\nhttps://www.subscribestar.com/zacharykhubbard free books\nwhatonearthishappening.com/ark mad info\nhttps://www.resonancescience.org/ important work", ">>349998749\nthanks boss. have you heard of santos b?", ">>349998749\n>>>349999999"]}, "349966992": {"op": {"timestamp": 1638193983, "title": "Chinese century cancelled", "comment": "Chang eternally BTFOed, Romania one of the poorest countries of Europe has regional GDP higher than China, beside that they're also colonizing the west of Europe especially Italy and Spain meanwhile China can't even control Hong Kong. How will Chang recover from this knowing that Romanian century is more realistic than his precious Chinese century fantasy?"}, "replies": [">>349966992\nWinnie the Pooh fears the Carpathian bear", "Once we brutally deal with the tr*nnysilvanian issue and their slave mentality wanting to submit to westoids or other foreigners, we will be unstoppable", ">>349966992\nRomania will grow bigger.", ">>349968938\nStop d/c gypsy\nt. vlach", "bump", ">>349966992\n\nYou're literally retarded.", "Romanians are also nordic", ">>349966992\nUnironically i felt safer in romania than i feel here when i go out at night", ">>349966992\nMAKE ROMANIA GREAT AGAIN", ">>349966992\nI think it's higher than Russia too.", ">>349972409\nSeethe with your chink hands", "the thing with China is that you ain't dealing with a land here. you deal with an entire continent.\nyou deal with 2x europe in terms of people.\nall controlled by a single entity.\nregional don't mean shit when they can funnel all their combined energy on something.", ">>349966992\nRomania is literally Europe's rubbish dump and Romanians for the most part are bluepilled pro USA, pro globohomo low IQ monkey niggers.", ">>349977167\nWhy do you think their (((economy))) is doing so well? Now let's compare the Romanian economy which effectively produces NOTHING to Turkey's economy which is getting anally raped right now lol. One is for globohomo and one is against.", ">>349966992\n>beside that they're also colonizing the west of Europe especially Italy and Spain\nTime to cull the slaves :)", ">>349977563\nwhich is weird, because still we haven't implemented any globohomo measures, or barely any", ">>349978227\nnigger....half of the women in your country work in the cam industry", ">>349978310\ngypsies don't count", ">>349978227\n\n>Spain no answer\n\nI can assure you it's pre-primary or sooner", ">>349968938\nMy very first boss was Romanian.\nHe always talked about gypsies like they were nogs.", ">>349968938"]}, "349929371": {"op": {"timestamp": 1638162828, "title": "Omicronitis", "comment": "https://www.alphaomicronpi.org/"}, "replies": [null]}, "349894716": {"op": {"timestamp": 1638143135, "title": "Now that ADULTS are finally in charge again", "comment": "Can we be more proactive getting antivaxx morons added to the terror list??"}, "replies": ["chink slide thread", ">>349894716", "sage\n>>349894716\nCan we be more proactive getting zionist jew kike morons added to the terror list??"]}, "349863975": {"op": {"timestamp": 1638128409, "title": "Nazbol Slayer Brandon Martinez", "comment": "Martinez went from being pretty based to being an absolute Nazbol Slayer.\n\nMark Collett: DESTROYED \nEric Striker: DESTROYED \nNowhiteguilt: DESTROYED \nKeith Woods: DESTROYED \nRichard Spencer: DESTROYED \nNick Fuentes: DESTROYED"}, "replies": ["he fucked desTINY up the ass", ">>349863975\nI wonder how big martinez cock is? i know its thicc but how long?", ">>349864084\nDestiny is a literal cuck who watches his gf kiss other men in public", ">>349864176\nOf course the swedetwink asks this lmao", ">>349863975\nWho?", ">>349863975\nWho??", ">>349863975\nWho???", ">>349863975\nWho????", ">>349864897\nYOU!!!", ">>349863975\nI think Eric Striker does great work, but every now and then his Nazbol/Third Worldist past reemerges and this is apparent to anyone who listens to Strike & Mike. Still I think he’s done a lot to reform his past views and it cannot be doubted that he is motivated by love of our people.\n\nI don’t think him and Bmart are enemies which is why I’d like to see (and I think many others too) a dialogue between the two.", ">>349864410\nBrandon Martinez the most based Canadian alive. Absolutely humiliated destiny is a debate about a week ago.\n\nhttps://youtu.be/yUnKv4BT3kE", ">>349864930\n...who?", "Post a link faggot", ">>349864938\n>destiny\nWho?", ">>349864973\nYoohoo?", ">>349865052\n>who is desTINY\n\nIs it summer already?", ">>349864261\nWell answer him", ">>349864261\nHail Brandon hail twinks", ">>349865356\nHonestly. There are a billion niche nobodies out there.", ">>349865212\nhello", ">>349865238\nNo, it's snow times my friend. And don't pretend these are important people that anyone should know.", ">>349863975", ">>349865646\nOh god he looks greasy.\n>who tho?", ">>349865646\nhe looks at least half mexican", ">>349865571\n>when the mdma kicks in", ">>349865356\n>>349865437\nMessage him on telegram. Who knows maybe he'll answer you", ">>349866224\nNope hes half czech half Spanish posted his dna test", ">>349866224\nPortuguese. Do what you want with that", ">>349866459\n>>349866489\nso i wasn't far off.\npic related is southern german phenotype.", ">>349863975\nWhat is his political position?", ">>349864937\n>it cannot be doubted that he is motivated by love of our people\nIt can be doubted.", ">>349866799\nyoutube shekels", ">>349866799\n>What is his political position?\n>>349864938\n>Canadian\nDoggystyle.", "Martinez is an incel with no clear ideology, he just attacks “nazbols” basically any third positionist other than himself. And since when the fuck is spic fuentes a nazbol, he’s conservative pro establishment grifter.", ">>349866799\nNatsoc", ">>349863975\nWhy do you shill this dude? He literally does nothing but waste his time on Omegle and beg for donations on his \"news\" website all day.", ">>349863975\n\nNowhiteguilt in particular did more good with his lexicon work than all of the rest combined.", ">>349864178", ">>349863975\n>MARTINEZ\nOf course /pol/‘s idol is a spic. 99% of /pol/ is spics and german turkroaches.", ">>349867634\nWhen will amerimutts learn to differentiate between spics and spaniards?", ">>349864938\nI'm about 30 minutes in a this Brandon fella has just been reading off quotes the entire time.", ">>349863975\nhe said that serbs are jews, kek", ">>349867871\nNice.", ">>349867891\nDO YOU DENY IT", ">>349865595\nBut you do know who he is.", ">>349864178\nhad to search this one, did not disappoint \nhttps://www.youtube.com/watch?v=iiTq3GuAZjA", ">>349863975\nSo what does this guy support?", ">>349867891\nwhere's the lie?", ">>349867871\nHe is a typical 'white nationalist'. His views do not extend beyond save white people, segregation and muh birthrates. How will you adress these issues if you do not even understand the root cause of it? Martinez has no plan or direction bu is ready to collect his gibs and attack people like Zoltonaus who are at least trying to make sence of the historical current. \n>inb4 Jews\nToo simplistic. Explain rather their philosophy that is synthesized out of various ancient traditions like gnosticism, hermeticism etc, but has a distinct element that abuses and subverts these teachings.", ">>349863975\nI only know the last 2 names and I know they're faggots so I guess this guy is a good guy.", ">>349868095\nNo I don't, we Serbs control all the media and banks, also Jasenovac was totally a made up lie that only goys would believe in... Jews are just a decoy for the actual Serbian elite that controls everything.", ">>349863975\nWhat is nazbol?\n\nI saw this man's debate with some Pak Muslims he spoke with. Their insecurities were easily exploited.", ">>349864176\nJFC, Ahmed.", ">>349865212\nWhat say, fren?", ">>349869311\n>Jasenovac was totally a made up lie that only goys would believe in...\nYou said it not me", ">>349865646\nHe looks arab", ">>349869086\nson of a bitch, foiled again\n>>349867891\nlast I've watched him talking to some Serb kid he said we were white and had to stop bickering with our neighbor countries", ">>349867291\nYeah I dont know why he gets such a hard time from people. He's the only person I've seen giving white people a solid psychological defense against antiwhiteism", ">>349867291\n>Nowhiteguilt\nhe's a cuck", ">>349865646\nbeware the mestizo menace", ">>349871120\n\nWhat are you doing here my fellow Serb?", ">>349872006\nThe dude puts his face on the internet. More than any of us would ever do.", ">>349863975\nIs D&C a requirement to be a right wing eceleb these days?", ">>349869988\n>no forensic evidence \nyou do know that under Tito the pits where Croats tossed Serbian children were filled with concrete, do you?", ">>349864176\nkys homo", ">>349872434\n\nWhy are you arguing with Muricans brother?", "QUIT beeeing a NIGGER", ">>349863975\nThis guy thinks white people don't exist. He's a tremendous faggot.", ">>349869311\nmiss that lil' nigga like you wouldn't believe.", ">>349863975\nWho?", ">>349863975\nHe fucked Destiny RAW style.\n\nEventually Destiny's buck got broken and he just agreed with him", ">>349864938\n>Canadian\nI'm sorry but he is a medchad", ">>349863975\nWhen did he interact with Nick Fuentes?", ">>349867871\nNothing else needed", ">>349872377\n>THINK ABOUT THE POOR BLACK CHILDREN!!!\n\nKys fafgot", ">>349863975\nwhat is this instant sage faggotry here?", ">>349864176\nThe meme is real.", ">>349863975\nMartinez is one based mofo.", ">>349869453\nDuginist didn't stick so they are going back to Nazbol", ">>349867750\nNever. It’s a lost cause.", ">>349863975\nYou guys are such fucking faggots with this jewtube nonsense. If anyone is considered an influencer, I want nothing to do with them.", ">>349877989\nLow IQ nigger take. \n>gets influenced by zog\n>\"I HATE WHITE POSITIVE INFLUENCERS\"", ">>349875002\nslav/med mutt, he's half Czech", ">>349866737\n>so i wasn't far off\nYou are right, aryanon. South of Spain is 50% moor DNA and Martinez looks like andalusian ppl", ">>349863975\nSounds like another infighting retarded."]}, "349830342": {"op": {"timestamp": 1638109365, "title": null, "comment": ">CNN writes article about a tranny kid\n>father is military and never at home\n>kid starts to think he's a girl\nthey really can't add 1 and 1 can they?"}, "replies": [">>349830342\nno, they can't. they don't realize that the average suburban mom will see this headline, click it thinking \"THIS COULD HAPPEN TO ME\", and then realize it's some tranny and just feel further disgusted/betrayed by jewish media"]}, "349791579": {"op": {"timestamp": 1638080468, "title": "Indians (pajeets poos) want and are invading Germany", "comment": "Proof\n> Go on YouTube and search\n Germany work\nFilter by update date: today\nResults\n> Pajeets reaching loopsholes on how to get student visas or how to get fake degrees \n\nScum of the earth indeed they are"}, "replies": [">>349791579\nGood morning, sir", ">>349791579\nhuh\ndo they speak german\nand if not can i do the same", "They just want money, like all the other shitskins.\nBut soon enough our economy will get buttfucked and all the flavours of nigger will huddle back home since they absolutely hate the people responsible for the wealth their are leeching off of.", ">>349791579\nAround poos, never go take a loo.", ">>349791764\nNo, they don't.", ">>349791839\nNo they won't, they'll just fucking steal your shit and kill you.\nThey see it as conquest of your land. They're never leaving.", "Pajeets are an absolute fucking plague. I hate them so goddamn much it's unreal", ">>349791764\nIt's pretty simple\n>Do you speak german?\n>Do you have a degree?\n>Do you have skills that are in demand?\nIf you fail any of those you can come for a while and work a shit job, but if you fulfil all three you too can come here and enjoy the most exorbitant energy prices of the developed world and an onslaught of taxes to fund the other shitskins that came here because even Somalia didn't want them.", ">>349791579\ni wanted to learn german for the money, and ALL the youtube language learning videos are stacked with jeet comments", ">>349791688\nGood morning, sir", ">>349792073\nThey are cowards that fled their own homeland to chase money.\nIf we do another weimar or our aging population breaks the welfare system and economy, do you really think any bangladeshi scum will stay to stand in line at german soup kitchens if they have a family at home that can afford more?\nThey are spineless cucks, the lot of them, they just enjoy wealth like the little greedy monkeys that they are.", ">>349792322\nGood morning, sir", "White people can do this in Asia. Working illegally is easy as pie.", ">>349792818\nasia is a shithole", ">>349792878\nSo is north America, your point?", ">>349792607\n>do you really think any bangladeshi scum will stay to stand in line at german soup kitchens if they have a family at home that can afford more?\nNo, they're going to start robbing and killing the white population well before that point.", ">>349791764\nI know right, I'm about to pull some white migrant shit", ">>349792996\nNot my problem, I am well equipped to slaughter a dozen Dravidian goblins right here and now.\nIf they want to cull their libshit neighbours in the city, then let them have at it.\nThey'll have shat themselves to death from drinking sewer water before they ever get to me.", ">>349791688\n>>349791764\n>>349791839\n>>349791844\n>>349791956\n>>349792073\n>>349792322\n>>349792348\n>>349792449\n>>349792585\n>>349792607\n>>349792615\n>>349792818\n>>349792878\n>>349792976\n>>349792996\n>>349793074\n>>349793278\nGood morning sirs", ">>349792976\nClueless pajeet fucker. Corrupt billionaires from asia flee their vountries to North American & Europe", "Germany will hand out millions of citizenships now that Scholz is in power.", ">>349791579\n?", "pajeets have a TFR of 1.0 in the west\n\nIn Singapore they have lower TFRs than the chinks and in the USA and UK they have among the lowest TFR of any group\n\nthey are not harmful because even if a billion of them came in a long enoguh timeline they will just go extinct due to inceldom\n\nMENA and BBC on the other hand..", "Tell them to leave.", ">>349793685\n... filter by date: \"heute\"", ">>349793704\nThats because the great majority are male and white women are disgusted by them. On the other hand, family chain migration is a real threat and it will happend if they start getting citizenship. THEN you will see pajeets procreating like rats \nAt least Germany doesn't have automatic citizenship by birth like america", ">>349793859\nsheeeiiitt", ">>349793557\nI'm not a filthy shitskin you monkey. Shitskin pajeets turned my nation into a shithole. And don't you dare try to tell me the US isn't a dump. Stay in your lane Pascal", ">>349794513\nThe US is sick but still a better country than many countries in Europe. The Rittenhouse case is a good example of that. In europe, the kid would be locked in for life. And you can't really talk about the \"US\" as one homogeneous country. California is what you are probably reflecting as the whole country. I love texas since I started watching Alex Jones 8 years ago (for the memes)", ">>349791579\nThey do the same thing here. The loophole to get in by paying for a seat at a community college. Then you can get a student visa + work permit + apply to become a citizen", ">>349791844\n>If I had his baby, it would look Turkish.", ">>349794917\n>one bone thrown to the people\nDid you miss the election, covid, race riots, drug addiction, Chauvin, poverty, the federal reserve, kikes, demographic replacement etc? Just because something isn't the worst doesn't make it good, diet spain", ">>349791579\nIndians are direct descendants of the Aryan race", ">>349791844\naround a poo\nyou are save on the loo", ">>349791579\nOP is a pajeet trying to take out his competition. C'mon bro he's just trying to move up from phone scammer. We have to lift each other up. Do the needful buddy.", ">>349795388\nHow are those exclusive to America? \nEven europe had retards rioting due to the nigger killed in America.", ">>349795947\n>Europe has it too\n>that means America isn't a shithole\n>implying Europe isn't past its prime too\n>implying there's anywhere left to run\nGo ahead, watch our continent on the news. It's fucked here and you can thank the fucking third world immigrants.", ">>349791579\nThey have entire websites dedicated to this. We also have Indians coming here on fake student visas and whatever else. They are the 3rd largest immigrant group to Latvia last year after Russians and Ukrainians.\n\nI work in tech and we won't hire them because their credentials are 100% fake every time.", ">>349792348\nAh ja, sehr interessant, Türke", ">>349791579\nBreaking Newa\nShitskins coming to Germany", ">>349796172\nIts amazing how I mean one thing and your interpretation was the exact opposite. My point was that Europe is actually worse than america and you somehow twisted your interpretation of my comment. \nTrump would have never neen elected in Germany, France or the UK and that tells you all you need to know", ">>349796529\nLook I'm just here to hate pajeets not deal with your whataboutism bullshit ok pajeets ruined canada and the only person who could say the US is a good country has never lived in first world conditions. Is Portugal that shit these days? Damn buddy.\n>not as bad=/=good"]}, "349759448": {"op": {"timestamp": 1638061302, "title": null, "comment": "Genesis 12:3 - And I will bless them that bless thee, and curse him that curseth thee: and in thee shall all families of the earth be blessed.\n>Whoever curses Jews is cursed\n\nDeut 23:3-4 - An Ammonite or Moabite shall not enter into the congregation of the LORD; even to their tenth generation shall they not enter into the congregation of the LORD for ever:\nBecause they met you not with bread and with water in the way, when ye came forth out of Egypt; and because they hired against thee Balaam the son of Beor of Pethor of Mesopotamia, to curse thee.\n>The blessing applies spiritually to all physical Jews, anyone of the seed of Jacob. How do I know? Because anyone who cursed or afflicted the children of Israel was cursed, like the Moabites\n\nEx. 17:16 - For he said, Because the LORD hath sworn that the LORD will have war with Amalek from generation to generation.\n>Another example of Gen 12:3 applying to all physical Jews is when the Amalek afflicted the Jews they were cursed"}, "replies": [">>349759448\nZech. 2:8 - For thus saith the LORD of hosts; After the glory hath he sent me unto the nations which spoiled you: for he that toucheth you toucheth the apple of his eye.\n>Whoever afflicts Israel pokes God in the eye\n\nMatt. 5:18 - For verily I say unto you, Till heaven and earth pass, one jot or one tittle shall in no wise pass from the law, till all be fulfilled.\n>The Old Covenant still applies to Jews today\n\nBut if thou shalt indeed obey his voice, and do all that I speak; then I will be an enemy unto thine enemies, and an adversary unto thine adversaries.\n>In the Old Covenant God declares the enemies of the Jews to be HIS enemies:\n\nJer. 30:3 - For, lo, the days come, saith the LORD, that I will bring again the captivity of my people Israel and Judah, saith the LORD: and I will cause them to return to the land that I gave to their fathers, and they shall possess it.\n>Modern Jews ARE JEWS. NOT EDOMITES ETC. WHITES ARE NOT JEWS:\n\nLuke 6:28 - Bless them that curse you, and pray for them which despitefully use you.\n>To Christians that hate Jews\n\nDearly beloved, avenge not yourselves, but rather give place unto wrath: for it is written, Vengeance is mine; I will repay, saith the Lord.\n\nHow to get saved:\nhttps://www.youtube.com/watch?v=qJT7RbMGGJw", "The Arabians really do love their monotheism.", "Israelites =/= Talmudic Khazars\nfpbp\n/thread", ">>349759448\n>>349759487\nIn light of Gal.3:29 = “And if ye be Christ's, then are ye Abraham's seed, and heirs according to the promise.” – it is through Abraham's lineage from Isaac to Jacob (Israel), where the Jewish people arose, and in the aforementioned verse, it is made known that if you are of Christ and accept Him as Savior & King, then you are among God’s chosen people, the seed of Abraham, and thus are heirs according to the original promise made to Abraham. In these ways, “Christians” ARE in fact members of modern-day “Israel” – that is to say they are the avowed and recognized people of God, for they are those who accept the King of Israel, Who is Christ. The law-abiding, faith-obedient Christian represents the ultimate manifestation of what a “Jew” in the spiritual, archetypal sense actually is. Accordingly, it is a complete misnomer to call those, whom to this day, claim to be adherents to Judaism, “Jews,\" in that they openly deny that Jesus is Lord. The modern, self-proclaimed adherents of “Judaism” cannot even truthfully be called adherents to Judaism as such, considering that the entire Old Testament scriptures unambiguously point to and identify Christ as Messiah – in their denial they have esteemed the traditions of the rabbis above the Word of God, and so are not Jews, but rather Talmudists, followers of the philosophical and legal traditions of their intellectual class, “Making the word of God of none effect through your tradition, which ye have delivered: and many such like things do ye.” [Mar.7:13].", ">>349759553\nIn Rom.11:17-24 we read about a great tree representing the Church with Christ as its root, while His followers are likened unto branches of this tree. We learn that in their rejection of Christ some branches of this tree were pruned away (the Jewish nation that rejected Christ), while other branches were grafted into this tree (gentile peoples that accepted Christ). We're further told that while some branches were cut off of this tree, they could be grafted back in (Jews can still convert and accept Christ)... \n\n\"17 And if some of the branches be broken off, and thou, being a wild olive tree, wert graffed in among them, and with them partakest of the root and fatness of the olive tree; 18 Boast not against the branches. But if thou boast, thou bearest not the root, but the root thee. 19 Thou wilt say then, The branches were broken off, that I might be graffed in. 20 Well; because of unbelief they were broken off, and thou standest by faith. Be not highminded, but fear: 21 For if God spared not the natural branches, take heed lest he also spare not thee. 22 Behold therefore the goodness and severity of God: on them which fell, severity; but toward thee, goodness, if thou continue in his goodness: otherwise thou also shalt be cut off. 23 And they also, if they abide not still in unbelief, shall be graffed in: for God is able to graff them in again. 24 For if thou wert cut out of the olive tree which is wild by nature, and wert graffed contrary to nature into a good olive tree: how much more shall these, which be the natural branches, be graffed into their own olive tree?”", ">>349759626\nMan therefore is not saved by some genetic association with a special chosen bloodline \"For there is no respect of persons with God.\" [Rom.2:11] – rather, they are saved by an association with Christ. In Christ we recognize that we're all members of the same family, because \"There is neither Jew nor Greek, there is neither bond nor free, there is neither male nor female: for ye are all one in Christ Jesus.\" [Rom.3:28].", ">>349759553\n>>349759626\n>>349759680\n\nIsrael = Christians \nIf you plant yourself on the Rock of Christ, you are adopted into His Kingdom, and become a Jew in spirit and a member of Israel \n\nJews by blood that deny Jesus forfeit their association with Israel and thus cease to become Jews.", ">>349759544\nAnd I will be found of you, saith the LORD: and I will turn away your captivity, and I will gather you from all the nations, and from all the places whither I have driven you, saith the LORD; and I will bring you again into the place whence I caused you to be carried away captive.\n\nAnd because I tell you the truth, ye believe me not.\n\nThat's not true", ">>349759898\n>>349759553\n>>349759626\n>>349759680\nSpiritually we are Jews, but physically we are not; the physical Jews are still blessed.", ">>349760130\nWas King Saul blessed & Saved when he moved against God and was communing with demons with the Witch of Endor? \n\nWill the Jews who conspired against and rejected Christ be blessed? \n\nJews are not saved by their blood, you can only be saved by an association with Jesus. \n\nJews can and have apostatized and will face judgement. \nJews cannot be saved outside of the salvation in Jesus Christ. \n\nIf you reject Jesus Who is the King of Israel, then you are no long a part of Israel.\n\nYou are effective preaching that you can have salvation outside of Jesus anon.", ">>349760398\nThe promises God made to the children of Israel apply regardless if they're saved or not. When he sees them he remembers David, that does not apply to us. They will be blessed for their sake, and cursed for whatever they do but the spiritual blessing still applies", ">>349759553\n>>349759448\n>posted 1 minute apart\nWhich discord server?", ">>349760678\nWe're all blessed everyday by merit of being allowed to live another day so that we can conform ever closer to the way of Christ. \n\nObviously none of this is to say that individual, ethnically Jewish people are somehow prohibited from becoming saved as Christians, it is merely to say that as an ethno-religious nation, the literal “Jewish heritage\" is no longer coherent as people of God – without Christ, Judaism lacks all spiritual depth and is rendered unintelligible and utterly meaningless. The entire point of God even assembling together a people (Jews) was to reveal Himself and His character to man – it was through their lineage whereby the Christ would come and reconciliation between man & God was to be established. Regarding the historical experiences of the Jews throughout the Biblical record we read, \"Now all these things happened unto them for ensamples: and they are written for our admonition, upon whom the ends of the world are come.\" [1Cor.10:11] – in a microcosmic sense, all of the experiences of ancient, literal-Israel were to prefigure and model the experience of the end times archetypal, universal-Israel (Christian church). \n\nGod allowing blood Jews to live is itself a blessing, allowing them another day to learn of Christ and convert. You cannot have salvation outside of Jesus, every Jew who dies a Talmudist that doesn't accept the blood of Christ will perish. \n\nIf you are not a Christian then you have no claim to the promises of Israel. \nGod doesn't have two different systems of salvation, there is only Christ and Him crucified.", ">>349760952\nI'm copy pasting from a word document full of my notes and random things I write", ">>349760678\nWe, as gentiles, are children of Israel, along with the remnant found in the first-century, WHO ACCEPTED CHRIST.\nA kikel rejecting Christ today IS NOT A JEW! You've clearly never read through the epistle of the new testament. There is NO jew/gentile in Christ, the new covenant replaced the old. Its obsolete, we dont live by the law (sin) any longer."]}, "349728816": {"op": {"timestamp": 1638045687, "title": "North Korea doesn't deserve to exist", "comment": "These retards are admired because they're supposedly disconnected from the Globalist structures like the UN and WHO. They're supposedly protected from Globohomo and diversity propaganda. If so then why are they falling for the COVID scaremongering and closing their borders (which is starving the population) and destroying their economy? Why are they taking the vaccines?\n\nThe one supposed benefit of North Korea according to pol is that they're so isolated they're immune from the ills of the modern global society yet they're voluntarily imposing lockdowns and taking vaccines. If even NORTH KOREA can't resist the global peer pressure then they really have no reason to exist. What is the point of the population being isolated and starved of material comforts if they're going to do that? Just to keep the regime in power? \n\nNorth Korea has a very finite shelf life. The whole country is a house of cards that is unsustainable and only made possible by aid from China. Eventually the North Korean government will crumble. Degenerate globohomo culture will flood in to fill the void and white PUAs are going to stream in to get their \"North Korean pussy\" merit badge. How are 5 foot North Korean men with no prospects going to compete in the global dating marketplace? \n\nThere's only so long you're going to isolate yourself from the globohomo diversity cult. Just like COVID what you want is natural immunity, not lockdowns and isolation. For all the talk about how screwed the West is at least there's a percentage of the populations that are redpilled and resisting. These are like human antibodies. In North Korea they have no immunity from the SJW virus."}, "replies": [">>349728816\ndamn nigga i aint gonna read all that shit", ">>349728816\n>These retards are admired because they're supposedly disconnected from the Globalist structures like the UN and WHO.\nyeah basically.\n>why are they falling for the COVID scaremongering and closing their borders\ndon't let a good opportunity pass you by. their borders are essentially closed already, this just is a good excuse to avoid criticism.\n>they're voluntarily imposing lockdowns and taking vaccines.\nsauce?\n>North Korea has a very finite shelf life. The whole country is a house of cards that is unsustainable and only made possible by aid from China.\nwithout some changes I'd say this is a valid criticism. Much of their farming is till done without much automation or machination. They would be much better off if they could somehow get a hold of more industrial faming equipment.\n> Degenerate globohomo culture will flood in to fill the void and white PUAs are going to stream in to get their \"North Korean pussy\" merit badge. How are 5 foot North Korean men with no prospects going to compete in the global dating marketplace?\nI don't think this will happen. Its been shown that they'd rather starve then let globohomo in.\n>There's only so long you're going to isolate yourself from the globohomo diversity cult.\nwith diligence they could probably hold it off for a long time. \n> In North Korea they have no immunity from the SJW virus.\nI'd disagree, they have a heathy aversion to anything foreign. They automatically assume that outsiders are there to fuck them over. If anything they have the best chance of resisting globohomo.", ">>349728816\nYou want to get rid of this? I wouldn't mind a NK elf waifu.", "shut the fuck up. north korea best korea", ">>349728816\nNorth Korea is based. Just seeing the Supreme Leader makes me want to clap. https://www.youtube.com/watch?v=Uuv2ooPTuNk", "What a disgusting fantasy. The DPRK so far has had 0 reported cases of Covid. \"Oh, reported. Sure.\" Except you believe the numbers being reported by every other government without being able to verify them, either. You want to get in to fuck their women, and then denounce them for being closed off from \"material comforts.\" What have these \"material comforts\" brought you? Mental illness, crime, plastic crap, \"social media, lying news, degenerate porn. Gee, why wouldn't the DPRK sign up for all the wonderful advantages of the Western economies? Your immunity only masks the diseases that destroying you from within."]}, "349695708": {"op": {"timestamp": 1638029314, "title": null, "comment": "A Judge Stands up to a Hospital: \"Step Aside\" and Give a Dying Man Ivermectin \n\nFully recovered after the drug. One wonders, are hospitals killing people? There's no good reason for their policies re this drug.\nhttps://rescue.substack.com/p/a-judge-stands-up-to-a-hospital-step"}, "replies": [">>349695708\n>One wonders, are hospitals killing people?\nHaven't had to wonder about that for a while now.", "Who They Are - The Names And Faces - Dr. David Martin Red Pill\nhttps://www.bitchute.com/video/AWkXqwxe4TBc/", ">>349696004\nHow can you have both positive and negative controls? Does that mean the tests are either positive or negative before they are used?", ">>349695708\nThe whole medical industry seems to want to jump to the front of line on the day of the rope", "I noticed many elites/upper class people silently get ivermectin treatment for their families&themselves, while publicly ridiculing it&recommending vaccination.\nBecause they feel they are more important&valuable than people of lower classes they may desire to prevent the virus to\nbecome resistant to ivermectin (more likely to happen if everybody gets it), so they remain much better protected than the masses, similar to the situation with last line antibiotics.", ">>349695708\nA Schizo Stands up to reality: \"sted aside\" and post schizo bullshit on 4chan\n\nStill a retard. One wonders, are the \"two more weeks (until vaxxed people die)\" not real?", ">>349697975\nThank you for elaborating on your strawman. It would be very helpful if more of you did this.", ">>349695708\n>are hospitals killing people\n\nWell, technically they are just letting people die since not treating a person is not the same as actively killing them.\nTechnically.\nBut the answer is yes.", ">>349697975\nare real for the ones who are dead.", ">>349695708\n>substack\n\nYou get the truth you pay for faggot.", ">>349695708\n\"\"\"doctors\"\"\" are narcissistic sociopath demons that are obsessed with the idea of having power over the life & death of humans and being respected and feared", ">>349695708\nThere is a good reason, they are killing people. The elites spritualy harvest death and human suffering for power and a satanic rush. This is a big deal for them. \n\nhttps://youtu.be/6oyG2uK8CdI", ">>349695708\nfunny thing the hospital has appealed this ruling \nmaximum kikery", ">>349696341\nAlways a positive control and negative control for every viral test.", ">>349695708\nThey get paid to kill already ill people and pretend it was the boogeyman", ">>349695708\nHospitals have deals with insurance and pharma companies to only offer the most expensive treatment. Hospital admins deserve death via scaphism", "Hello napervile", ">>349698601\nquite a few of them, yes", "Florida man here. I have been taking this just to see if I shit out some worms. It was locally available at the local feed store. I got my pureblood mother on it as well. I haven’t had health insurance for 15+ years. Grow your own food and make a bunch of different ferments at home. I buy local raw milk that has to be labeled for pet consumption only by law. Eat whole cuts of real meat and use quality salt like Celtic grey. We will win. Growing your own food and avoid the health care system as much as possible is the greatest form of political protest. Mill out and train with an 80% lower AR. Take care of yourselves anons. You can tell we are ahead by the grotesque obese mutants the modern mutt civilization is breeding. Health is wealth. Go do some pull ups and push ups and get some sun.", ">>349695708\n>what is shit that never happened but we made it up anyway\nMore well-poisoning. This time they're assembling a future ivermectin strawman they can easily tear down later. IVM is to be given in the early stages or as prevention, late stage it does NOTHING.", ">>349698985\nCrazy the thing you can do , while under blackmail or death threath on family member", ">>349696004\nThis is my first time seeing these, thanks broanon saved and added.", ">>349695708\n>One wonders, are hospitals killing people?\nWonders? They've been doing it brazenly by refusing to prescribe the cures for cancer since the 80s.", ">>349700156\n>taking this just to see if I shit out some worms\nWell? The suspense is killing me fren.", ">>349700442\nDoes NOTHING for a fake virus?\nI imagine so.", ">>349701517\nwhat are the cures for cancer weirdo?", ">>349701629\nI hope you're getting paid for this you gigantic faggot.", ">>349701731\nThey do it for free.", ">>349697909\nthis story took place in naperville, illinois, which is an upper middle class/wealthy town. Most of the wealthy believe the propaganda too. including merkel. see https://eugyppius.substack.com/p/ignorant-and-afraid", ">>349701634\nHydroxychloroquine, Ivermectin, and especially Febendazole.", ">>349695708\nHospitals have to many protections from being sued", ">>349702198\nOh, and Levimasole.\nThat was one of the first ones studied.", ">>349701634\nRick Simpson Oil also known as RSO and Phoenix Tears", ">>349698560\nWell it's a good thing they directly link to the court files in the article to verify the information yourself, isn't it?", ">>349702394\nSorry, meant Levamisole. \nLookup \"[drug] cancer\" for each of those. \nBest kept secret of medical industry.\nHundreds of billions of dollars at stake.", ">>349702198\ni went and fact checked anon, and found a johns hopkins article stating that febendazole, normally used to treat parasites like giardia, has been proven to inhibit tumor growth", ">>349700442\nhttps://patch.com/illinois/naperville/covid-patient-given-ivermectin-edward-improving-report", ">>349701531\nI haven’t noticed any but I haven’t been doing any deep analysis either. I also wanted to get familiar with the FLCCC protocols and show others that may need it that the treatment was safe for me. Zero horse paste side effects as expected. \n\nhttps://covid19criticalcare.com/wp-content/uploads/2020/11/FLCCC-Alliance-I-MASKplus-Protocol-ENGLISH.pdf", ">>349702932\nHas been used by cancer patients for a while.\nLook at Amazon reviews. \n>this dewormer saved my life\nJoe Tippens popularized it.\nThere's a brand of Febendazole called Panacur. \nPanacea was the goddess of universal remedy.", ">>349703502\ndoes it mean cancer is caused by parasites/viruses? Or something else", ">>349702751\nCase is from naperville il. Here's a local story on the guy \n\nhttps://www.dailyherald.com/news/20211119/naperville-hospital-covid-19-patient-in-ivermectin-lawsuit-doing-better\n\nhttps://patch.com/illinois/naperville/covid-patient-given-ivermectin-edward-improving-report", ">>349695708\nYes, third highest cause of death in the US.", ">>349703471\nKeep doing God's work fren", "Here is another case from a while back. \n\nhttps://trialsitenews.com/a-doctor-reflects-on-the-fight-for-nurije-fypes-life-and-all-who-helped/", ">>349695708\n\nNo clinical study to prove Ivermectin works.\n\n>because they refuse to clinically study it\n\nNo real world evidence that Ivermectin works...\n\n>Ahem", ">>349700156\nBe sure to take doses based on swine weight. Closer to us than horses.", ">>349695708\n>>349695708\n> are hospitals killing people?\nya", ">>349695708\n>One wonders, are hospitals killing people?\nCongratulations. You almost figured out the obvious. No remdesivir for you. Only good health.", ">>349695708\nif the hospital tricks you into putting your family member on a ventilator, that family member is not coming back", ">>349695708\n>are hospitals killing people?\nyah", ">>349695708\n>A patient is seriously ill with the coof and in the ICU\n>No vax, so \"certain death\" according to MSM and NPCs\n>Wants Ivermectin\n>\"Oh no, we cannot give you that, it's horse dewormer and it could be hazardous\"\nThe logical leaps these people make never seizes to amaze me", ">>349696495\nThis makes my covid the long covid", ">>349703806\nCancer can be caused by a ton of different things. In this case, it's likely that the specific interactions of these drugs with cellular molecules that make them effective against their primary targets (parasites, etc.) also end up interacting with some of the specifics of cancerous tissue.\n\nKeep in mind, cancer isn't some single thing we can define. \"Having cancer\" is like saying \"my car can't start.\" There can be a lot of different reasons for why that car isn't starting up. Battery dead? Alternator missing? No gas? etc. Likewise for cancers. Even cancer occurring within the same tissue type is likely caused by wildly different reasons for different people. \"Cancer\" is a blanket term for a tissue that shows all of the following symptoms\n>cell is dividing without giving off the proper cell signals to its neighbors\n>cell is dividing despite the outside cell signals telling it to stop\n>failure to commit programmed cell death\nA cell expressing 2 of the 3 symptoms is at risk, often called pre-cancer, as it's only one more wrong expression before it becomes truly cancerous, but it isn't yet cancer. As for how a cell ends up showing these symptoms, it can be from mistakes in the normal DNA replication during cell division (mutation), it can be influenced by cellular environment changes which change its gene expression without changing its genome (epigenetics), it can be from traumatic injury to the cell destroying part of its natural functions, and it can be a combination of all of these.\n\nJust like how there's a lot of ways cancer starts, there's myriad ways that these cancers interact with treatments. The general goal of anti-cancer treatments is to find a common root to all cancers, like killing all rapidly dividing cells, or maybe targeting all cells that fail to communicate with their neighbors, or force communications inward, etc.\n\n>tl;dr it's hard to say why the drugs work without studies testing the interactions of drug and cancerous cells", ">shills go silent when an even easier link is spoonfed. \nBut in all seriousness shills if covid is as deadly as you think then by denying people life saving medicine you’re coconspirators to mass murderers. \nHowever even if meme flu is a cold or non existent you’re a party to murderers anyways for campaigning to get crucial medicine for other illnesses dismissed and even outlawed. \nHow does it feel to be a murderer for wageslave pay, or even worse jannie pay?", ">>349703806\nAntiparasitic drugs can act on metabolism or on the mechanism parasites use to adhere to their host. Both of these modes of action are also relevant to tumorous and cancerous tissue, as well as viruses. The reductionionist view we have of how medicines work is flawed. Many medicines have multiple modes of action because they work in different ways on different tissues", ">>349695708\none should wonder if the vax makes you permanently impotent", ">>349695708\n>are hospitals killing people?\nja. keep away from hospitals, schools and other quasi state run institutions.", ">>349702932\n>>349703502\n>>349703806\nYou won't believe it, but I'm convinced that Levashov was right. Cancer is found down the chain of causation of ethereal parasites. They are similar to your familiar parasites, except for the plane they exist on is that of your ethereal body. Rather than explain this, I might refer you to the yogic explanations of the layers of the human organism, and suggest that this is not merely a hypothetical, but a reality undetected by the five common sense organs.\nAs with all things related to disease, foreign organisms are found where there is decaying material to process, which themselves have a cause either in a lack of sufficient nutrition, an environmental toxin, or an environmental trauma. Consider that such trauma could be even emotional, and to repair the damage fully requires such an emotional healing, which some do not wish to take on.", ">>349700156\nWhat’s your Bear name? \n\nT. East Texas", ">>349695708\n>One wonders, are hospitals killing people?\n>he doesn't know iatrogenic deaths", "The horse paste version already has weight dosages marked out on the plunger. These are for the 2mg/kg that is recommended for the preventative dose administered twice a week per FLCCC. The dosage for covid positive patients goes up to 4mg/kg daily. That is for the pills and paste. Double check the info on the FLCCC site as well. Don’t stress about getting the exact dose as you can always go safely above the 2mg/kg dose. This isn’t exact science. The ivermectin blocks the attachment points for infection. \n\nhttps://youtu.be/ufy2AweXRkc\n\nDon’t forget to ferment your own foods. I was making natto with garbanzo beans instead of onions before covid was around which is where they get some of the k2 supplements from. Cabbage and salt is all you need for sauerkraut.", ">>349695708\n>not going to america's frontline doctors\n\nstay dead, vaxtards", "Also make sure to get the paste that only has ivermectin as the active ingredient. There are others with added medicine.", ">>349695708\n>not swishing with 1 tbspoon betadine in 4oz in water for 30 seconds\n\nkys vaxtards", "Just hypothesis but the high k2/natto consumption may have played a role in the recent covid news from Japan.", ">>349705763\nWhatever happen to patients right to try?", ">>349703502\nit takes like 14mg to deparasite an adult human, maybe a bit more if you're big. the stuff that is sold to animals the size of horses is enough to kill you if you ate all of it. be really careful with your doseage, or order human doses online after getting a prescription instead.", ">>349707999\nSome chud is gonna make a fortune stacking bodies in about a year.\nCompany name: sheep scooping services - a vaxxtard resting place", ">>349706834\nWonder? I hope so. Serves them right.", ">>349703471", ">>349695708\n>One wonders, are hospitals killing people?\nYes, they are. There's no room to wonder. Between clotshots in veins and medically unneccessary and inappropriate ventilation we're looking at millions in the last two years.", ">>349707632\nanti-parasitic use for Ivermectin is 1 dose of approximately 14mg. daily use should be confirmed with a doctor.", ">>349696341\nSuch innocence aw", ">>349708872\nThese people are hacks and their research has been pulled. Man you guys are gullible as fuck.", ">>349707632\n>making natto with garbanzo beans instead of onions\n\nNeat. I wonder if the natto bacillus bacteria can feed off many types of bean, and that the Japanese settled on fermenting onions only for historical reasons.", ">>349708929\n>daily use should be confirmed with a doctor.\nbe cautious with daily dosage....", ">>349709074\nFucking bots man", ">>349707632\n>2mg/kg\nI doubt that", ">>349695708\ndude they is lots of treatments that cure covid-19 high dose vitamin c via IV cures it. ozone therapy will stop you from dying from low blood oxygen and will kill the virus. they know this. and some hospitals have used it but if they say anything they get fired.", ">>349709074\nivmmeta.com", ">>349695708\n>One wonders, are hospitals killing people?\n- no sunlight\n- not allowed to sleep for more than three hours at a time\n- nutritionally deficient food\n\nYeah, I would say so.", ">>349695708\nI'm pretty sure that Ivermectin and HydroxyC are only effective at EARLY stages of respiratory infection. Which is how Fauci fudged the \"studies\". Everybody already knew those drugs were top tier. Ivermectin saved literally hundreds of millions of people over time and won a Nobel Prize. \nThere was no way an \"emergency authorization\" could be had to push this experimental garbage if there was already existing drugs that deal with it very well.\n\nSo Fauci's tests involved people who were already in late stages of respiratory infection. \nThat's how this whole thing was able to go this far.", "in fact this right here would stop any viral pandemic", ">>349695708\n>man is on the brink of death\n>\"we refuse to give Ivermectin it could have side effects\"\n\nthose people should be shot", ">>349709286\nYou are correct!\n0.2mg/kg \n\nThe weights are on the plunger. If someone blindly gobbles up whole tube for an entire horse they probably deserve the outcome.", ">>349709286\nI think it's 2mg/10kg over a certain weight, but it's been a bit. Needless to say, it doesn't take much, at all, to fuck up your body, permanently, with shit like this. I won't stop you, I'm not a doctor and I believe you have the right to treat yourself, since it's you. But no possible way should you be dosing 2mg/kg, ever, as far as I can tell.", ">>349695708\nI'll take things that never happened for $200", ">>349695708\nYou kind of have to wonder what the purpose of a \"L'Hopital\" really is?", ">>349710132\nYou have $200?", "A Hospital is where you lose all your money. People go to hospitals so that they can die while having their bank accounts drained.\n\nSame goes for Universities. Both institutions are occult institutions where souls are sacrificed and man is tortured.", ">>349709137\nYou can use a bunch of different beans. Same with tempeh.", ">>349695708\nAll you ever needed to see was how many died from being taken off of ventilators. https://pubmed.ncbi.nlm.nih.gov/9172858/\nBeing put on a ventilator is already a bad sign, and you need a good amount of longterm care and planning to get off of one and not have a fuckton of issues. And yet hospitals were just putting patients on and off of them like it was going out of style with no thought whatsoever. And sure enough everyone who was on them died almost immediately after since their resparatory system was fucked, and it just so happened that hospitals were getting money for saying how many Covid patients they had who died. Guess the nurses were too busy acting like retards on Tiktok than actually checking patients or doing a little bit of homework on their job.", ">>349710005\n>If someone blindly gobbles up whole tube for an entire horse they probably deserve the outcome.\nI know it is hard, but try to be compassionate, especially people that try to avoid the vaxx\n\n>>349710022\n>2mg/10kg\nyes, that is the dosage I also know\nand yes, be very cautious, I encourage that too", ">>349710140\nOnly Americans make that mistake with the medical symbol", ">>349710022\nCorrect. I misspoke. 0.2mg/kg. It is on the tube and listed on the FLCCC website.", ">>349710848\nIt's intentional. American hospitals were not built to treat illnesses", ">>349709673\n>tfw multiple cases here of people being forced into respirators\n>some were captured after escaping the hospital\nif you are healthy enough to jump a fucking window, run away and try to hide at a store you don't need a respirator\nfor those who want source, you can try machine translating this\n>https://g1.globo.com/sp/sao-jose-do-rio-preto-aracatuba/noticia/2021/03/26/paciente-com-covid-19-fugiu-de-hospital-pela-janela-apos-descobrir-que-seria-intubado-diz-policia.ghtml", ">>349697909\n“Screw your freedom” what a fucking spineless scum bucket Arnold turned out to be.", ">>349710799\n\n0.2mg/kg is the correct dosage.", "American hospitals are set up in such a way to take as much money from you as possible, and you don't get better. It's where idiots go to lose all their money. A casino, but worse.", ">>349695708\n>are hospitals killing people?\nYes", ">>349710598\nYou are guaranteed to leave universities even more ignorant than before you walked in; especially in the US. You can seriously get a better education from a library.", "What surprises me is that people are still getting covid. I never quarantined and got covid several times with no serious symptoms. No ones getting sick or dying in less populated areas.", ">>349711133\n>0.2mg/kg is the correct dosage.\nI know, thank you \nbut 2mg/10kg is also correct(10x0.2mg/kg=2mg/kg)", ">>349711454\ndamn it, it equals to 2mg per 10kg", ">>349695708\n>One wonders, are hospitals killing people?\nObviously yes. Malpractice is known to kill millions. COVID just gave hospitals an excuse to be shit. DONT GO TO THE HOSPITAL UNLESS YOU ARE LITERALLY ACTUALLY DYING.", ">>349711145\nPublic hospitals here are not much better \nThey try to steal as much of your tax money as possible\nThey get gibs for every covid death\nAlso it's almost impossible for a government employee to be fired so they are all lazy as fuck", ">>349695708\nI wonder how many assholes these scumbags have killed with their bullshit.", ">>349695708\n>are hospitals killing people?\nEven before the covid injection panic and obscenely gross mistreatment of flu patients, hospitals killed anywhere from 250 to 450k people every year in the US due to \"medical errors\", it's the third leading cause of death.\n\nThere's a reason smart people hesitate to go to the hospital unless it's absolutely necessary.", "1", ">>349695708\nIvermectin has many documented mechanisms of action, and one of is to act as a protease inhibitor.\nThe new patented pill that Pfizer is pushing is solely a protease inhibitor.\nReuters attempted to DEBOOONNK this and confirmed it, and the only thing the Pfizer rep could stammer out was \"B-b-buh no one should take horse medicine!\" Literally.\nhttps://www.reuters.com/article/factcheck-coronavirus-pfizer/fact-check-pfizers-trial-covid-19-drug-is-not-the-same-as-ivermectin-idUSL1N2R11T5", "2", ">>349695708\nCool. There's also a lawsuit trying to stop organizations (well I think it's one hospital, or one system) from stopping Drs from prescribing ivermectin. \n\nThat said, I'm surprised that it worked so late in the course of treatment.", ">>349696341\nI imagine it's: \n> a group with the disease that gets no treatment\n> a group without the disease that gets the treatment", "I took Ivermectin and have a horse penis now. What do I do?", ">>349710159\n$160k in my ameritreade account. Friday hurt though", "Roscoe tried to miss em\nBut he didn't quite", ">>349713313\n>protease inhibitor\nWatch FDA tell Amazon to ban all supplements that do this", ">>349715421\nI know the Vinita, OK travel plaza when I see it. Have a safe journey", ">>349716590\ndoctors aren't allowed to prescribe it in canada or show any sign of vaccine hesitancy or they lose their license", ">>349714735\nGive people free mushroom tattoos", ">>349695708\ndaily remind ivermectin fight worms not infections retards\n\n\nalso theres 3 vaccines 1 being saline 2 being the vax and 3 being ((((the vaxx)))", "do you chuds really eat horse dewormers?", ">>349695708\nAnd then everyone clapped", ">>349695708\nHospitals definitely killed a lot of people with ventilators. How many knew that's what they were doing is an open question. At first, they were probably just following protocol for a respiratory illness. But after a while, there wasn't much excuse for continuing to use a treatment that backfired, except that there was a funding bonus for it.", ">>349717432\nI only eat horse re-wormer", ">>349717746\n>But after a while, there wasn't much excuse for continuing to use a treatment that backfired, except that there was a funding bonus for it.\n\nI think a lot of the doctors doing this figured out they were committing premeditated murder a little too late, they already took the money and now they're in too deep, because they'd get the death penalty, and they deserve it. honestly god help them when a sheriff or a governor figures it out, sooner or later someone with actionable police power is going to.", ">>349715421\nI recognize your dashboard from the original Need for Speed.", ">the virus is fake! \n>it only kills old and weak people!\n>let me eat this horse paste rather than getting a vaccine because im so deathly afraid of this hoax virus!", ">>349696341\nMan. This is low even for a burger", ">>349717432\nYou do know that there's a human version and it was used before covid, right?", ">>349695708\n>There's no good reason for their policies re this drug.\n\nThey can't allow alternative treatments to exist while simultaneously maintaining Big Pharma's immunity from liability. \n\nOnly the jab can exist. No alternatives.", ">>349718762\nIt's not even horse paste people have taken it for years. The left hears buzzwords andjust cant help but parrot them in place of actual thought process. Or god forbid actual self reflection", "How does a fake virus get cured?\nIts all in your head", ">>349698601\nVery much this. They desire control and power over you and God's creation.", ">>349718421\nthe kikes turned doctors into paid assassins via kickbacks and tax credits. these fucking doctors know they are murderers. it would be interesting to see if kike doctors killed more white patients than anyone else, i am betting yes. \n\nthere is no covid, its never been isolated and these fuckers know it. doctors will hang in nuremberg 2.0 en masse.", ">>349718762\nHans, why does this trigger you so much? what is wrong with you?", ">>349719071\nI mean, broad spectrum antiparasitics might help to treat certain aspects of covid, but don't forget; we're dealing with a Chinese bioweapon. It might simply be treating the symptoms without necessarily destroying the virus.", ">>349700156\nI have covid now and have been taking this. Haven't noticed any improvement at all, and also haven't shit out any worms. Very disappointing/10. I just ordered some Quinine will try that next.\nOf course covid isn't that bad, it's about a 6/10 compared with other colds i've had", ">>349699722\nThese edicts are handed down to hospitals by the CDC which in turn have these edicts handed down to them from Big Pharma. Most hospitals receive government funding.", ">>349719249\n>It's not even horse paste people have taken it for years\nmy experience is that logic does not work with people like this", ">>349719249\nIm eating horse paste so I can get that brony dick", ">>349695708\n>One wonders, are hospitals killing people?", ">>349719571\n> Receive government finding\n> Still have to pay for health care\nSo it's like socialism but you pay for it?", ">>349719249\n>people have taken it for years.\nfor what?", ">>349719516\nThe virus in your mind?\nThe only virus out is a us manufactured gof virus", ">>349701634\nhemp oil, psilocybin", ">>349719627\nit's amazing how many people think ivermectin is \"horse paste\" and they don't realize that ivermectin is a medical ingredient that happens to be in a specific medicine for horses, it's not animal-only", ">>349719065\n>there's a human version\nnot really, ivermectin is ivermectin\nbut ivermectin is used for horses and humans (also cattle, cats,dogs,etc)\n\nsame goes for antibiotica...it is the same ingredient", ">>349719934\n>it's amazing how many people think\nI don't believe they think, sometimes I wonder if they even have souls or are just empty vessels", ">>349719796\nExcept we watched as this spread from a lab in wuhan, possibly through contaminated samples being improperly disposed of. I was in the first few threads and I've been keeping tabs - this is the Chink's fault and I expect my government and America to retaliate when it's contained. Or are you a pussy?", ">>349717746\n>just following protocol for a respiratory illness. But after a while, there wasn't much excuse for continuing to use a treatment that backfired\n>a treatment that backfired\n\nI haven't heard about this yet. What's the story?", ">>349720076\nYou're right, I forgot about the NPC thing where they have no inner monologue and can't visualize objects in their head. Even with my eyes open I can visualize things in my head as I am typing like construction vehicles, trucks, helicopters, trees, whatever. It must be rough to be a NPC.", ">>349719934\nAlso only reason people took the veterinary one is because of government restrictions", ">>349708872\nYou need a new screenshot. The protocol has been updated since that pic.", ">>349719071\nThis guy has got the gist of it. For a drug to get Emergency use authorization in usa, or EUA, there have to be no alternative, previously approved drug that could treat the disease. If they allow ivermectin to be used to treat covid, it is an admission that there is no justification for the EUA for genetic therapies being given to everyone. Thing is we are getting to the point were they are just disregarding the law openly anyways, so anyone who thinks this will be a major victory is probably wrong. This will be covered up by the tyrants and ignored by their normie puppets.", ">>349701634\nPhosphorylethanolamine", ">>349720142\nYou watched what you were told to\nGo look up crimson contagion and where the world military game was in 2019", ">>349710005\nIvermectin has a huge therapeutic zone of action. No research paper to date has managed to stuff enough Ivermectin into people to kill them.", ">>349720267\n>It must be rough to be a NPC\nabsolutely...driven completely by emotions... but this explains why they can be fear mongered into taking an unresearched drug...\ntheir biggest flaw is that they trust the people in power and the media.... the truth would most likely destroy them/drive them to spontaneous sudoku", ">>349702932\n>i went and fact checked anon, and found a johns hopkins article stating that febendazole, normally used to treat parasites like giardia, has been proven to inhibit tumor growth\n\nare you implying that antiparasite medicine can stop cancer growth? \n\nwhat kind of antiparasite medicine can we give to humanity to stop the cancer destroying all civilization?", ">>349720473\nRight so like I said, god help them when literally anyone with actionable police power gets it through their thick head how easily they could just start physically grabbing people, a lot of the governors and sheriffs are corrupt sure but also a lot of them are simply stupid and haven't worked out what's going on yet", ">>349720862\nLea", ">>349720756\nHow did so many of these NPC's even come around? I don't remember the average person being like that in the 90s and 00s. Chemicals in the tap water? There's so many of these NPC's, it's almost like the past 20 years were slowly transforming the majority of the populace.", ">>349720945\n>Lea\ntell me more", "dying man recovers after Mcdonalds last meal\nProof that fries cure all diseases", ">>349720456\nthx", ">>349721610", ">>349721187\nNah\nYou wouldnt ask if you knew", ">>349721777\nWitnessed", ">>349721777", ">>349696004\nguys.. unfortunately this does not mean what you think it means.", ">>349702198\n>>349702787\nGof bless you, based Burgerbro, I'll study these, thank you.\n\n>>349708487\nWhat are the recent news from Nippon?\nAll I know is they've successfully used Ivermectin vs the meme flu. Also, why isn't this world class news already? Big pharma needs to be obliterated altogether.", ">>349721279\nGuy survives covid after getting the vaccine. Proof vaccines prevent death", ">>349721610\n>>349721777\n>>349721998\n>Stolen by /cvg/ sent to archive", ">>349721913\nscrewed up the order and missed 999 by 1, but anyway", ">>349722222\nKEK, QUADS!!!\nCaptcha fragger", ">>349695708\n>are hospitals killing people?\nbingo. it took stupid niggers almost two years to get with the idea", ">>349722167\nTotally worth it", ">>349700156\nI thought about this terrible, disastrous disease and I will not take their vaccine so I did my research and stumbled upon Ivermectin. It’s a parasite removal drug by prescription only and seems to tame COVID-19. More research and I found this drug at Tractor Supply with Ivermectin in paste form for treating horses and other farm animals. I can literally buy this without trying to find a doctor’s prescription. It’s safety record is off the chain so I went to TS and bought a tube of Horse Paste™ and I’ve been using it for the last few weeks with no problems to report. The only thing that I found different is that I now eat a bag of oats for lunch and an occasional apple.", ">>349696004\nOf course they will brand them \"negative\" and \"positive\" with a color kek. I'm against this vaccine and it really hurts me to be compared with conspiracy theorists you guys are so naive", ">>349722127\nSo without the mRNA experimental treatments, covid kills what percentage of people?", ">>349722258\nFinancially incentivized. Normies don't realize how dangerous it is to be intubated. You have to be sedated to shove that huge tube down your throat and then you are at the mercy of the nurses not fucking something up and going \"oops, another covid death\".", ">>349722260\nthx fren", ">>349723091\n1.6%", ">>349721777\n>dutasteride/finasteride\nHormone inhibitors for trannies, prostate cancer patients or bald men that want to have hair transplant.FUCKING WHY?", ">>349723294\nHoly fuck we're all gonna die", ">>349700442\n>IVM is to be given in the early stages or as prevention, late stage it does NOTHING.\nThis - I had the coof a month ago. Started IVM and vitamins as soon as my sense of taste went though, and everything worked out fine. Take it early or don't bother matches everything i remember reading", ">>349723713\nNah, only the obese and imo\n\nOh yeah, you southerns", ">>349724017\nHow many moar weeks desu?\nGive it to me straight. I can handle it", ">>349724200\nNone, I get vaxxed Monday so the world dies", ">>349723363\n>FUCKING WHY\nfound following\nhttps://pubmed.ncbi.nlm.nih.gov/34089595/\n\nCoronavirus disease 2019 (COVID-19) is characterized by a gender disparity in severity, with men exhibiting higher hospitalization and mortality rates than women. Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), the virus responsible for COVID-19, infects cells following recognition and attachment of the viral spike glycoprotein to the angiotensin-converting enzyme 2 transmembrane protein, followed by spike protein cleavage and activation by cell surface transmembrane protease serine 2 (TMPRSS2). In prostate cancer cells, androgen acting on the androgen receptor increases TMPRSS2 expression, which has led to the hypothesis that androgen-dependent expression of TMPRSS2 in the lung may increase men's susceptibility to severe COVID-19 and that, accordingly, suppressing androgen production or action may mitigate COVID-19 severity by reducing SARS-CoV-2 amplification. Several ongoing clinical trials are testing the ability of androgen deprivation therapies or anti-androgens to mitigate COVID-19. This perspective discusses clinical and molecular advances on the rapidly evolving field of androgen receptor (AR) action on cell surface transmembrane protease serine 2 (TMPRSS2) expression and severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection, and the potential effect of anti-androgens on coronavirus disease 2019 (COVID-19) severity in male patients. It discusses limitations of current studies and offers insight for future directions.", ">>349724283\nS", "I am 3 for 3 on horsepaste knocking back a viral illness overnight. Three for fucking three. Anecdotal statistical significance lmao", ">>349724626\n>I am 3 for 3 on horsepaste\nkek, heard of panta?", ">>349695708\nvery based glad to hear dude is okay\nfuck hospitals", ">>349695708\nI ordered 200 Ivermectin pills off the dark web", ">>349707632\nYou're gonna kill people. The human dose of ivermectin is between 6mg and 12mg", ">>349700442\nbullshit\ni have long covid\ni didn't actually start improving until after taking ivermectin\nmy lymph nodes were swelling randomly and my lungs felt like they had fluid in them\none treatment with horse paste and both were gone\ni have no idea how or why it worls, nor do i care, but it clearly flushed out whatever surviving infection there was", ">>349725164\nyes, it was a mistake and he corrected himself >>349710005\n...unfortunately no edit possible in this case", ">>349695708\n>One wonders, are hospitals killing people?\n\nNearly every American hospital, clinic, care facility, etc takes money from the government, so they have to abide by (((federal))) standards to receive those shekels.\n\nRight now the federal standard is to put a patient on vent and blow out their fucking lungs so that they die and free up a bed for the next patient and collect $40,000 burgerbucks from Washington.", ">>349700442\nWell if you take it after COVID, you get rid of the worms, so it works either way. No harm using it, really.", ">>349695708\nThe judge's final decision is a satisfying read, so I'm dropping it here\n>https://images.law.com/contrib/content/uploads/documents/399/69948/11-5-21-Ng-v-Edward-Elmhurst-et-al.-Judges-Ruling-transcript.pdf", ">>349724589\nFuck you, im going to chuck a rock at you for that", ">>349719661\nthis, Big Brony Cocks check in", ">>349695708\nHe'll get bills for a million dollars plus now. Probably not covered by insurance. Maybe would have been better off with horse paste.", ">>349698526\nVentilators are used to actively kill people at hospitals. Hospitals get paid by the US government for every covid death.", ">>349727969\nHe can probably sue the hospital.", ">>349695966\nYes", ">>349710005\n>>349720674\nyea I did research on this and found the toxicity was around 20 tubes. I took half a tube just to see what it'd do and I did not feel different. People legit need to hang", ">>349695708\nIf covid policies kill someone I care about, a lot of people are going to fucking die.", ">>349695708\nThis wouldn't have needed to happen if people marched in to the hospitals grabbed the tiktok nurses and doctors and beat them.", ">>349698560\nOr you can just look it up Sneed. https://www.fox32chicago.com/news/illinois-familys-attorney-says-ivermectin-working-for-grandfather-with-covid-19\n Thanks for posting the substance story op. This is important.", ">>349695708\ntalk to any funeral director and overwhelmingly they know that the hospitals are responsible for countless deaths due to misdiagnosis and incompetency, they are a business first and foremost because all of those doctors want their yacht and ferraris like they saw growing up watching doctors on talmudvision", ">>349695708\n>One wonders, are hospitals killing people?\nWhat do you think happens with old people in nursing homes? Test positive? Sorry, nothing we can do about that. Here's an overdose ofopiates and benzo.", ">>349704723\n\nPfizers excuse was.... ivm *might* be unsafe and pfizermectin is safe.\n\nThey didnt say it doesnt work btw.\n\nI hate the antichrist.", ">>349719249\nJoe Rogan should have sued Cnn for every fucking penny they had after they committed libel against him.", ">>349710848\n>>349711037\n>mistake\nYeah. The medical symbol for new babylon is a serpent that's been crucified, and I find that suspicious.", ">>349729069\nBurgers?", ">>349729069\nHe's a multimillionaire. Who need the headache of dealing with CNN and their demon attorneys?", ">>349725259\n>have long covid\nWe use to call that being a hypochondriac", ">>349695708\nYes, they are killing people by smearing alternative treatments. People should be very angry and sue.", ">>349728557\nSure thing tough guy.", ">>349710140\nTo be a great magician you have to be a great thief", ">>349724772\nI just heard of Mr. Panda today. Actually you told me. So yes, I've heard of Mr. Panda Bear.", ">>349695708\nSo are we back to claiming ivermectin helps against covid again? Or have you been in a coma for the past two months?", ">>349697909\nIt wouldn't be the first time.\n\nhttps://archive.md/YN57O", null, ">>349729054\n>They didnt say it doesnt work btw.\nRight, they just waged a multi-million dollar propaganda campaign against it with an army of shills instead of making official claims themselves that could be taken to court.", ">>349695708\ndid he mispronounce \"caldwell\" again?", ">>349722767\nSsshhhhh…\nSsshhhhhh….\n\nWhose a good hors-… I mean anon.", ">>349695966\nThis", ">>349696341\nYou can and Yes. A control sample is like a test for the test. A way to check the test's accuracy.", "Hey anons, how do you to apply the ivermectin paste? Anally, rubbing on skin, or eating?", ">>349730285\nall of the above", ">>349729300\nPrinciple.\nLook what Hogan did to Gawker.", "The real disease is that you still believe in germ theory.", ">>349707632\n>2mg/kg that is recommended for the preventative dose administered twice a week per FLCCC.\n\nits fucking 0.2mg/kg you idiot", ">>349698526\nHow does giving you an extreme overdose of remdesivir, leading to acute renal failure, then placing you in a medically induced coma and having a machine take over breathing for you until your lungs explode constitute \"doing nothing\" to you?", "Shit! The cheapest ivermectin tablets cost 15€ for one tablet. And I can find only one ivermectin paste, and it's from pfizer-fuckers themselves. What the heck, Germany?", ">>349729725\nAh yes the first Fakedemic.\nWhen the WHO lowered the alarm for a Pandemic™.", ">>349730285\nYou go and find a doctor that comes up with a treatment plan for you. While they all have been cancelled from media and public discourse, it shouldn't be too hard to find a reasonable doc. I switzerland it shouldn't be too hard to find one from the ALETHEIA collective. Don't know about you kraut fags though. In the worst case, ask some aletheia dude about some kraut docs. They probably all know each other anyways.", ">>349729717\nImagine claiming to be on the side of science and then denying it when it doesn't vibe with your tyrannical bootlicking ways.", ">>349708651\nStop trying to hurt Pfizer's stock price you terrorist", ">>349719532\nWhy are you all so fucking retarded?\nivermeticin is an anti parasitic. It's a GOD send anti parasitic, that has cured and damn near wiped out diseases like malaria. \nWhat you don't understand, is where this information comes from. \nivermeticin was suggested by Michael Yeadon, the ex chief of science for Pfizer. The ONLY reason he suggests it is because of T cells. What he explains is that the Tcells build up in the liver, and go to the lungs when the liver is full. \nIt is by no fucking means a cure for Covid. It is a treatment that does what you're body is supposed to be doing, which is creating T cells to commit sudoku in the liver. But the T cells are confused due to incorrect tagging from the anti bodies. So ivermeticin kills them.\nAll ivermeticin does is help kill off T cells (by coincidence) and if they're not building up, then there's 0 point to taking it. It's to combat the lung part of the illness and should only be used in early treatment. If they're on a ventilator then it's most likely too late. \nNow on the other hand, HQC, as noted by Fauci himself back in 2011 DOES help cure Covid by protecting the hemoglobin of red blood cells, which is what the virus is using to copy itself. But this too is an early treatment, and NOT a daily use medicine for long periods of time like 3-6 months. \nBut this all depends on your own immune system. You probably don't need anything besides the normal bed rest and constant fluids, unless you're 70+. \nI'm no doctor, nor do I work in any field of medicine. This is just the where the info came from, and how it was stated. But people keep on assuming shit, like \"Oh der ivermeticin is a cure, because some say it helps with something I have no fucking clue about\"\nDo some research and stop just taking every hint of advice that's not from the doctors. \nAlso ivermeticin is it's own thing. You shouldn't try to go out and take an animal dosage of something. Take a horse dosage of anything else and I'm sure you'll be sick.", "Hospitals are the new death camps", ">>349730960\nThey have been doing this for a while.\n\nhttps://archive.md/yIYG4", ">>349730989\nIt is hard though. Our house doctor makes a fortune vaccinating fools. Already asked him for an exemption due to health problems. He declined. And we can't change doctors, because they already have too many regular patients, and treat only others only in an emergency. We only have like 1 doctor per 10k people, and all of them are corrupt faggots.", ">>349719774\nHoly shit you clearly haven't read a single fucking word of this thread", ">>349731699\nhttps://archive.md/rBipp", ">>349695966\nFPBP", ">>349731754\nIf you think you're in need of an invermectin treatment because you think the cooff might fucking kill you, sending an email or two to ask about information/connections shouldn't hurt too much. I'm fairly sure that redpilled docs are more than happy to help anyone, regardless of bureaucratics/regulations.", ">>349731500\nFor those wondering. This is the video where Michael Yeadon explains his opinions of what's going on, and how the different treatments work. \n\nhttps://rumble.com/vg4inv-michael-yeadon-full-interview-planet-lockdown.html", ">>349719774\nIt's on the WHO Essential Medicines list 3 times and half of Africa is on it because it's an extremely good anti-parasitic that's so unfathomably safe that the west will give the local chief nigger a years supply for an entire village and just let him dole it out.", ">>349697909\nFrom your basement?", ">>349695708\nHave you ever been to a (((hospital))) because of leftist determined attacking with false witness against you?\nHave you ever lost your job because of false witness against you?\nDid they try to take something from you with lying? Your rights?\nThese people are all kinetic combat terrorists.\nThey are going to DooM themselves, and say it was you. To reap rape you.\n\nYou can try to not use violence, but you will not see until your time is out of the sweet spot.", ">>349717432\nlmao i bet you drink water like a fucking animal too, sickening", ">>349697909\nWhere did you see this? Seems like you just made it up.", ">>349695708\nWell, someone has to kill them!", ">>349719048\n>he doesn't know everything!\n>what an absolute low!\nFuck off, faggot.", "you poor thing, health care is about neither.", ">>349704818\nI'm a breeding animal. Thx fren", ">>349731616\nMost people die at home tho", ">>349734256\n>Breeding \nX\nEveryone here is a kiss less virgin", ">>349696341\nWelcome to hell, newfag.", ">>349731500\nyou have a nigger brain\nkys", ">>349707632\n>using a bullet as a pointer\nbased", "whatever you do don't look up hospital infection rates in a search engine", ">>349736310\nAntisemitism?", ">>349695966\ncovid is a smokescreen for this.\nthere is a pathogen and it's not a virus.\nmRNA and DEPT were not being used to treat\nviral infection like ever.\nhttps://www.synthego.com/blog/crispr-fungi-shapiro\n\nhttps://en.m.wikipedia.org/wiki/DEPT_(medicine)\n\nthey've been running a clandestine aktion-t4\nstyle program under the radar.\nhealthy patients don't make money\nand every community has undesirables.\nthe war on the white middle class is waged\nout of hospitals and doctor's offices.\nthe startling shift in demographics in\ncertain areas is a good indicator.\n\nthey are in our base killing \nour doodz [sic]\n\ncandida once established in deep tissues\ndoes everything cancer is said to do.\npic related.\n\nthey've been doing other things too.\nyour local hospital may house a black site\nfor unethical human research.\nlike mecha for real.\nflesh machines.\nfate worse than death.", ">>349737041\nsauce on pic\nhttps://drfungus.org/knowledge-base/candida-albicans/097mike/", ">>349695708\n>https://rescue.substack.com/p/a-judge-stands-up-to-a-hospital-step\n\ngreat post, thank you\nshows that the only reality now is defined by court documents and related proceedings", ">>349731500\n>Why are you all so fucking retarded?\nYes\nand i don't know what the rest of your post means either", ">>349695966\nMOAR!\nhttp://patient-safety.com/crime_in_medicine.htm\n\nthe rabbit hole goes very deep.\narrest faucci for treason and lay that\nlying sack of shit in a guillotine.\n\nenjoy Omi-con kids.", ">>349710799\nwow\nyou would have to take 20 tubes of paste up the ass to vomit \nand apparently get chimp out eyes\nbut not even that would kill you\nalso ivermectin turns your sperm basedness up", ">>349731966\nAh yes tamiflu... way back then I worked for one of the biggest companies in Austria and the head of HSEQ told me a little story, when all this shit was happening tamiflu was nowhere to be found, but because its one of the most influential companies in Austria they had backchannel connections and still got it 40k packages for the essential workers (since the company is considered critical infrastructure). After 2 years the pandamic never came and they had to throw away all the tamiflu packages which they bought at a price premium...", ">>349695966\nthey really like aerosols.", ">>349737041\ngraphene oxide is the end game\nthey put it in food, meds, water, clothes, everywhere\nit can produce energy w the right geometry\nand it will trigger the real internet of things WW\neverything trackable\nand as you can see in the research, controllable\neven humans", ">>349695708\n>are hospitals killing people?\nIn this ep of the alex salmond show the Prof tells them all the retarded shit they did at the start. Takes a while. Stuff like\n>treat them dry\nhttps://youtube.com/qwNifyaEXk0", ">>349738218\n>increases quality of sperm\n>the jews hate this\n\nnow it all makes sense", ">>349695966\ncovid turned them all into heroes!!!\n\nheroes work here.\n\npure propaganda.\n\npure smokescreen.", ">>349737997\ntake quercentin w zinc\nthats one of the things ivm does\nit lets zinc inside cells to fuck covid\nalso take lots of vit c/d, magnesium, water\naspirin and natto serra for clots prevention and repair\nmelatonin to sleep", "Damn covid messes up Asians no wonder they're scared of that stuff", ">>349739274\ncovid is a smokescreen.\nread back 6 or 7 posts.\nyou have been royally rused.", ">>349738897\n>are hospitals killing people?\n\nYES.\nin many different and stunningly creative ways.", ">>349738836\nMake your gif bits longer so you dont need to look at it a bunch if times yo read faggot.", ">>349738836\ngraphine oxide is a honey pot \nto get u stuck on stupid.", ">>349734541\ndoesn't matter where they die as long as they get catastrophically ill and that sweet medical billing\nrevenue rolls in like gravy.\ncovid as a comorbidity is worth $30k\nto any hospital that reports it.\nhealthy patients do not pay expenses.\nthey do not help shareholders.\nsick patients make money.\nbottom line.\nthere is a A list and a B list in the practice\nof medicine.\nCAVEAT EMPTOR!!!", "Somebody archive this shit that's getting dropped I'm driving and phinefagging", ">>349739700\nI had my appendix removed when i was 8 because I was pretending to have a stomach ache. The surgeon lied to my face afterwards telling me how close it was to bursting when I really wasnt ill in the slightest", ">>349741586\nunnecessary surgery is bad.\nintentionally misdiagnosed prolifertive disease\nis what is going on.\ncovid is 100% decoy and smokescreen.\nthey are grooming a common cold virus\nto be the most deadly motherfucker\nsince the black death kicked europe in the balls.", ">>349702198\nFor FenBen, you can also go the Care Oncology Route. They prescribe Mebendazole (human version), along with Metformin, Statin, and Doxycycline.\n\nIn the US it will cost $2000ish for a year. Unsure about the UK. Much cheaper than chemo, and about 3x as effective", ">>349695708\nYes, they along with the government are murdering people.", ">>349741586\n\"A variety of fungal pulmonary infections can produce radiologic findings that mimic lung cancers. Distinguishing these infectious lesions from lung cancer remains challenging for radiologists and clinicians.\"\n-Pubmed\n\n>challenging\n\nmmm.... needle biopsy is so challenging.\nmicroscopy and culture is a still evolving science.\nthey play dumb an publish this kind of disinfo.\n\nTHEY ARE BETRAYING US THEIR PROFESSION\nAND POTENTIALLY THE HUMAN RACE WITH\nmRNA TECH.\nSAME TECH THAT HELPED CREATE THE MOSQUITO EXTINCTION.\nmRNA WAS THE DELIVERY VEHICLE FOR THE\nCRISPER EDIT!!!!!", ">>349695708\n>are hospitals killing people?\nyes; respirators in this case", ">>349698526\nWithholding effective medical treatment is murder.", ">>349695708\n>>349695966\n>>349696004\n>>349696341\nNiggers", ">>349695966\nYeah, the Remdeathivir protocol is designed to kill people", ">>349695966\nWhat I don't understand is how despite of 2 years of constant media coverage there is no clear suggested plan of action for a person who thinks they got the flu other than \"do nothing, if you get very sick, go to hospital when it's too late and have your lungs blown out\".", ">>349742954\nTHE GOVERNMENT DOES WHAT THEY SAY!!\nPAY.ATTENTION!\nTHE GOVERNMENT WAS NEVER INTENDED\nTO BE OUR ENEMY!!!\nWITH ANTHRAX AND MANY OTHER FACTORS\nTHE GOVERNMENT HAS BEEN INTIMIDATED!\nTHEY ARE IN THE SAME POT OF SHIT-\nA WORSE POT OF SHIT THAN US\nBECAUSE THEY ARE HIGH VISIBILITY!\nDISSENT AND TRUTH TELLING\nCAN BE LETHAL!!!!!!\nWE\nARE\nSO\nFUCKED!!!!\nU\nC\nK\nE\nD\n!\n!\n!\n!\n!", ">>349695708\nBased judge standing up for justice.", ">>349742954\n\"Last year, President John Magufuli declared the virus a “satanic myth” propagated by imperialist powers. While his neighbors sealed borders and locked down, his country of 58 million stayed open. His government barred doctors from registering coronavirus as the cause of death and labeled those who wore masks unpatriotic.\nSeeking to keep the economy open and rally nationalist sentiment ahead of elections, he blocked foreign journalists from entering the country, rejected vaccines and refused to provide data to the World Health Organization. News organizations reporting on Covid-19 were shut down for “scaremongering,” and reporters threatened with jail.\nBy this spring, the president was dead, along with six other senior politicians and several of the country’s generals. The official cause of Mr. Magufuli’s death was heart failure. The details remain secret. Diplomats, analysts and opposition leaders say he had Covid-19.\"\n—WSJ", "it's bad.\nso fucking bad.\nkill your tv.", ">>349703806\nYes! Cancer is caused by viruses.", ">>349703806\n>Or something else\nsomething else. one characteristic of cancer cells is their metabolism goes screwy, their mitochondria deteriorate so they can't burn glucose the normal way anymore and wind up having to ferment the glucose to make energy. fermentation is a very primitive early-evolution process shared with other very primitive life forms like parasites. more evolved cells never lost that ability, we just evolved more efficient ways of burning glucose that extracted a lot more of the available energy out of it. in some ways cancer cells have reverted back to bacteria-levels of evolution which is also why they just reproduce nonstop as long as there is energy to do it. anyway, a medicine that targets the metabolic processes of worms and other parasites is also likely to interfere with the metabolism of cancer cells, while not affecting normal cells which are using the more evolved glucose cycle.", ">>349743965\nTroy_mcclure.jpg", ">>349704818\nswine need bigger doses because they eat roots and dirt, not because they're \"closer to humans\". the standard dosing schedule for humans is 200mcg/kg, same as horses, because humans don't eat huge amounts of dirt, not even indians and bangladeshi.", ">>349703471\ndo u feel less gay?", ">>349695708\n>One wonders, are hospitals killing people?\n\nMaybe not killing people intentionally but more like showing no concern over patients' lives. If you have value to the hospital or the organizations supporting the hospital, they would want to keep you there for as long as possible. \n\nIf they're using a new drug on you, they wouldn't want to kick you to the hospice. They would document the effects and hence the daily blood draws. If the patient has an ordinary terminal condition, they would the patient transfer out ASAP, even if the patient only has 1 day left to live.", ">>349708003\n>others with added medicine.\nif it's praziquantel, that is also in several human ivermectin medications, and at the same ivermectin:praziquantel ratio as the horse paste.", ">>349710848\nthey give allways hints and signs.\ni dont know why but they cant do it without.", ">>349710005\n>If someone blindly gobbles up whole tube for an entire horse they probably deserve the outcome.\nit's unlikely to harm them. there have been studies for things like cancer using 10x-20x the usual dose of ivermectin without any problems. most of the ivermectin side effects are are related to the parasites dying, but really once you've taken enough to kill your parasites you've mostly maxxed out the side-effects. I think the md50 for ivermectin for a normal (non-obese) adule is something like 20 tubes of horse paste."]}, "349660763": {"op": {"timestamp": 1638004410, "title": "ISIS throws gay men off buildings", "comment": "https://youtu.be/gr7d1sTDNts\n\nThis is what liberals support"}, "replies": [">>349660763\nBased.", "SAAAND NIGGERS", ">NOOOOOOO NOT MY GAYERINOS NOOOOOO", ">>349660763\nI like liberals now.", ">>349660763\n>GOOD!\n\nHOMOS NEED TO GTFO AS DO TRANNYS", ">>349660763\n\nTrudeau is right, we need to mass import these people.", ">>349660763\nhekkin basterino talibros", "I feel spiritually close to people who throw gays off roofs.\nPerhaps we are not so different.", ">>349660763\n>WOAH CIA TRAINED LARPERS KILL LE GAYS SO BASED!!!", ">>349660763\nfaggots can fly", ">>349660763\n>This is what liberals support\nwtf I love liberals now", ">>349661653\nTalibros =/= isreali secret intelligence services", "it used to be Islam Is Right About Women\nwe need to step it up\nIslam Is Right About LGBT", "gay chat:\n\ndiscord gg/AK4waZkC", "It's funny because there's quite a few studies now showing that homophobic men are actually homosexuals in denial, especially the aggressive ones, whereas people that don't care if someone's gay are typically telling the truth when they say they're not homosexual\n>Both groups exhibited increases in penile circumference to the heterosexual and female homosexual videos. Only the homophobic men showed an increase in penile erection to male homosexual stimuli\nhttps://pubmed.ncbi.nlm.nih.gov/8772014/", ">>349662032\nLooks like you'll be getting a fair few newcomers based on the comments here", ">>349660763\nNoice.", ">>349660763\nHourly reminder\nIf you find yourself supporting low IQ sandnigger tactics\nOr AGREEING with their beliefs \nIt just means you're low IQ too\nThat is unironically ALL IT CAN MEAN\nSo accept that you have a nigger brain, or sandnigger brain, and aren't in the double digit club", ">>349660763\nAt the peak of isis did they had supporter here on /pol/ like the taliban now?", ">>349662126\nGoyim bullshitery \nDeath to faggots", ">>349662126\nNobody would care if they wouldn‘t push it in school university social media tv etc", ">>349662775\nYou are now verified to be the gayest person here", ">>349662126\n>hurr durr u hate gay? u gay!\nI don't give a flying fuck what fags do in their bedroom, I hate gays because of their fragile narcissistic sociopath tendencies and their desperate need to degenerate and reshape society because of some perceived oppression that doesn't exist because they're being treated by nature rightly for mistakenly thinking that sexuality is a personality and identity.\nTheir only social belief is \"I NEED TO EAT CUM AND HAVE CUM IN MY ASS\" so they think this somehow qualifies them for having any sort of valid opinions for how society should be run. Fags have never spent a single second thinking about anything but their own immediate gratification.", ">>349661737\n>larpers\nDoubt they were larping when they raped bashar al-kalb’s cowards until they begged for Russia and Iran to intervene", ">>349661680\nI'm right there with you, Jap bro. Rather be Muslim than a Christcuck.", ">>349662981\n>>349663534\nPeople here aren't talking about that though. Before my comment there wasn't any comments about that, everything was just standard homophobia. If you see some gay people pushing an agenda it doesn't mean they're all doing it too, surely you must understand that. There's lots of straight SJWs pushing that stuff too that you're ignoring. Dave Rubin is a good example of someone who's gay and doesn't like that stuff. And yeah those studies are true, most homophobic men are gay men in denial", ">>349664231\nI don't give a fuck what people are talking about. Gays are abominable and should be thrown from roofs. Trannies should be burned or hanged, and any one that tries to push their shit in government should be given the boats.", ">>349663534\n>I hate gays because of their fragile narcissistic sociopath tendencies and their desperate need to degenerate and reshape society because of some perceived oppression that doesn't exist because they're being treated by nature rightly for mistakenly thinking that sexuality is a personality and identity.\nBased. Fags are crazy and manipulative like women but have the testosterone to carry them out further. \n>>349664231\n>Most humans that have ever lived were gay, bro\n>>349660763\n>DA DEMS ARE DA REAL HOMOPHOBES", ">>349664231\nSo are there more gay people in the middle east than in europe? The most important factor if somebody is homophobic or not is obviously culture and upbringing", ">>349664325\nArticle with four more studies showing that you're homosexual\nhttps://www.livescience.com/19563-homophobia-hidden-homosexuals.html\n>>349664428\n>Most humans that have ever lived were gay, bro\nI said nothing of the sort\n>>349664621\nSharia law says to kill homosexuals. Christianity says just don't do it, not to kill anyone, or hate anyone", "Thanks for making a thread that I can post this", ">>349665490\nBased Muslims", ">>349665490\nP based if you ask me, faggot death watch is funny.", "Liberals in the America / Israeli governments and security services created and fund ISIS. Which kills gays. Take it up with them.", ">>349660763\n\nI read somewhere that Muslim men want white boys to become Muslimah's and wear burka's and the Muslim men will take the white boy Muslimah's to be their 2nd or 3rd wives for pleasure. IF this is true then won't those Muslim's be thrown off a roof by ISIS (and the white boy Muslimah's)?", ">>349663534\n>>349664325\nbased samurai", ">>349660763\nwhen are you going to learn you should do the same?", ">>349660763\njust came from a party where i met a gay dude and became friends, we danced a lot. You know you should met people, they are still people, some good, some derranged, some nice. See people, not groups", "Faggotary needs capital punishment.\n\n> Gay men are 60x more likely to have HIV than straight men.\nhttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC3462414/\n> 10 to 15 percent of older homosexuals have more than 1000 sex partners.\nhttp://www.jstor.org/stable/3813477\n> 1.65% of the US population, account for 83% of the country’s syphilis cases. https://www.cdc.gov/msmhealth/STD.htm\n> Forty-six percent of the homosexual men in contrast to 7% of the heterosexual men reported homosexual molestation.\nhttps://pubmed.ncbi.nlm.nih.gov/11501300/\n> 67.5% of 200 homosexual men but only 16% of 100 heterosexual men were found to be infected with intestinal parasites.\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC1704818/\n> The proportional prevalence of offenders against male children in this group of 457 offenders against children was 36%.\nhttps://pubmed.ncbi.nlm.nih.gov/6512871/\n> Gays are more likely than straight people to have mental illness.\nhttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC2072932", ">>349661886\n>isreali secret intelligence services\n>CNN \nMere propaganda. The \"news\" contains no real evidence that gays have been treated properly.", ">>349660763\nBase", ">>349667410", ">>349662224\nhas that mofo survied?", ">>349660763\n>scientific experiments", ">>349662126\nYou see in TV ???? Wow!!!", ">>349662126", ">>349668067\nthats a media and politics problem, if everyone was apolitical thhe world would be nice", ">>349660763\nTbh they only throw gays off buildings that are caught in the act of sodomy. Being gay is not a sin on itself in Islam as long as you dont engage in sodomy", ">>349660763\nShowing gay men this is stupid, because gay men feel safe in western nations. This isn't real to them.\n\nOnly when the strong men that protect them are gone and replaced with basedboys will they go full blown white supremes.", ">>349660763\n>This is what liberals support\nliberals don't have thoughts of their own.", ">>349660763\nthey did nothing wrong\nhttps://youtu.be/76b7tzVRTpk", ">>349662126\nthis, The majority of pol tards need expensive psychotherapy treatments to cure their unconscious sexual repression. Nigger haters secretly love BBC porn, Homophobic and transphobic posters are closeted, They blame the Jew for creating their uncontrollable sexual urges and think if they repeatedly deny their urges they will go away. Unironically the majority of low IQ pol tards that hate Islam have so much philosophically in common with Islam but due to their racist prejudice they won’t take the time of day to read the Quran, if they did I'm sure they would agree with nearly every single passage.", ">>349669853\nI support sharia law.", ">>349660763\n\n>not muh gayerinos\n\nFirst day here, moshe?", "send the tranny army after them", ">>349663959\nLmao we ass raped you until the last. We kicked you out both Iraq and Syria. Seethe and dilate you fucking mossad.", ">>349660763\nNigga, why you be out here postin bullshit ass videos from 2015, get the fuck outta here bitch ass anon ass nigga.", ">>349671167", ">>349670329\nSame fren", ">>349662126\n>((((((((((((((((((((((there's quite a few studies now showing that homophobic men are actually homosexuals in denial))))))))))))))))))) \njudaism the post", ">faggot chucking\nWe need to make this an Olympic Sport", ">>349660763\nWhen did you realize Islam is the only force of good in the world?", ">>349660763\nThat's so based I coomed.", ">>349671141\n>we\nyou didn't even leave your comfy berms unless you knew you had US air support with US SF whipping you away from your chai break.", "Oh, forgot to mention the incoming Bulgarian spam who's full of shit", ">>349660763\nthey voted for this. didnt happen under trump", ">>349661653\nI miss /qa/ sometimes", ">>349660763\ni havnt seen an oc gay throwing video for at least 5 years", ">>349672336\nYea those several air strikes and the SF did shit they just helped killing their own men (isis) Delusional mutt. You'll be invading the ME as based assad starts bombing Isreal. Soon.", ">>349662325\n>Hourly reminder\nsuch a dutiful female impersonator, the intestinal worms are lucky to have you", ">>349664939\n> Leviticus 20:13 If a man also lie with mankind, as he lieth with a woman, both of them have committed an abomination: they shall surely be put to death; their blood shall be upon them.\nYou must be talking about those gay pastor churches supporting the gays. Cause I don't remember the churches always giving a reach around for homos.", ">>349664325\nArete, Samuraibro.\n>>349663516\nMethinks thou doth protest too much, faggot. Vidrel is why I hate faggots.\nhttps://www.youtube.com/watch?v=gP6qiqCIeMY", ">>349660763\n>Noooooooooooo you can't just save your country from faggot globohomo!1!1!1\nKek", "gay chat:\n\ndiscord gg/AK4waZkC", ">>349663516\nI fucking love women. They are made with such beauty and bodies, personalities. They have a hole that is made perfectly to statify the white man. What kind of a faggot that rejects the creations of Allah?", ">>349662126\nOkay Freud, nobody actually believes that. I did the whole be tolerant of gays thing and it just degenerates into fag pride before everything else and trying to push their beliefs on kids - it isn't needed. Oh, I need to dress like a freak and tell propaganda stories to teach kids it's okay to be themselves. Fuck off.\n\nThey don't bother me if they're closeted and not being obnoxious.", ">>349668465\nYour a retard. If your a closet you better seek help either way you'll be off the roof you faggot.", ">>349674580\nActing on the sin is haram. Being a closeted gay and fighting the urge to the same feelings and hiding your true self from anyone doesn't seem like it's haram. It seems like a test from God. If you pass it, you're a real winner.", ">>349673004\nKek, wish you guys could takeover this entire piece of shit country.", ">>349674923\nActually correct, kinda.", ">>349674992\nWill do frenot", null, ">>349660763\nThey make dope ass tunes tho", null, ">>349660763\nDo they have a patrion?", ">>349662325\nYou should be first in the get thrown off a building line, you disgusting tranny freak.\nNeck yourself, faggot", ">>349662325", ">>349660763\nI'd like to see those fucking ragheads try that to me (a gay man)", ">>349678743\nEat shit faggot.", ">>349660763\nISIS are fags themselves, this seems like a closet case", ">>349660763\nISIS should kill all these amerimutts and jews", ">>349681060\nThat would be friendly fire", ">>349662126\n>>349669853\nBullshit. You sodomites are just projecting your fantasy over sonething you cant have.", ">>349678743\n>muh muscles \nAre nothing, your a sissy who wants a dick in his mouth. You might commit suicide as I call you a fag rn"]}, "349627333": {"op": {"timestamp": 1637982097, "title": "(((viruses))) don't exist. Humidity is the culprit.", "comment": "Big brain anons only.\n\nSo let's get this straight\n>viruses literally look like microscopic robots inferring intelligent design\n>viruses are never isolated\n>there has been no study linking presence of viral fragment to actual infection\n> (((asymptomatic infections))) is a prime example of bullshit pseudoscientific rationalization to cope with that reality\n> virus activity is linked with seasonal cycles\n> winter time causes dry cold air \n> lower humidity air reaches equilibrium with its surrounding by drawing moisture from anything and everything including people, trees, buildings etc. \n>dry low humidity in areas that should be moist causes inflammation \n>inflammation severe enough can and will kill \n\nInflammatory response to dry environment is the syndrome which everyone is dealing with unless you are actually sick with a known bacterial infection overgrowth. \n\nViruses are a LARP. take the vaccine if u want I don't care, most treatments for viruses aim at reduction of inflammation anyway. Better to prevent the inflammation. \n\n>Buy humidifiers for winter \n>fill your house with house plants \n> boil water \n>take showers with door open \n> unironically wearing a mask traps moisture and recycles moist air \n\nTons of studies agree and I haven't seen this angle posted. Stay moist (pause you fucking faggots) and u won't get sick. \n\nYou heard it here first. /pol/ is always right. If u don't believe me look up \"virus dry humidity\" or some other shit on Google and screencap ur result. U will see hundreds of studies like pic rel that discuss how dry air increases viral transmission. That's bullshit. Being sick from a (((virus))) literally means u are suffering from dry person syndrome."}, "replies": [null, "Another one", null, "Get the fuck in here. Fucking fauci isn't gonna admit this", null, null, "Consider why all viral treatments are centered around fluid?\n\n>neti pot - fluid infused into nasal passages\n> soup\n> tea\n>Electrolyte drinks\n> breathing steam", "I'm out, this board is fucked.", ">>349627333\n Bump", ">>349627333\ncheckd\nwe need a war on dry air.", ">>349627333\nInteresting.", ">>349629115\n>lungs need moisture heat and oxygen\n>what happens to living wet tissue when this is disrupted\n>some people call this decomposition \nIdk some shit", ">>349632955\nWait\n>covid symptoms is low O2"]}, "349595113": {"op": {"timestamp": 1637965917, "title": null, "comment": ">tfw you have to be worried about you and your family getting randomly killed by psychotic satan worshipping niggers or rogue CIA assets when out in public.\n\nNice fucking world we live in."}, "replies": ["Just be like me;\n\nI don't care any more. The problem was always bigger than me and I wasn't born to solve it.", ">>349595113\nwe're allowing it, aren't we?", ">>349595468\nwe were born together to solve it together anon", "I don’t, perhaps you should escape your hellhole?", ">>349595468\nbased and don't give a fuck pilled.", ">>349595759\nman\nthat faggot was never funny", "Glowniggers tongue my anus.", ">>349596287\nand they do it so well", ">>349595113\nUsed to care a lot, but this morning me and my wife just laughed in bed at our stocks crashing and the Nu/Omicron/\"for real this time guys\" virus being announced. We normally would have been angry, sad, anxious, afraid - but now we just laugh at the absurdity of it all.\n\nAnyway I'm finna hit the gym then play some more Inscryption while my big tiddy wife makes me dinner. Life is good. I don't care anymore, and I won't care if this new virus wipes out half of America. Maybe we'll finally be able to buy a house."]}, "349561040": {"op": {"timestamp": 1637949414, "title": null, "comment": ">the car\nIs it mankind's greatest enemy?\n>enabled globalization\n>men no longer needed to escort women\n>costs thousands in maintenance\n>forces you into the wage slave system just to exist\n>pollutes the earth\n>dries up the oil reserves\n>requires expensive roads paid by your taxes\n>no more walkable cities\n>causes traffic jams\n>allows whitie to continue running\n>makes life more stressful\n>kids can't play outside because retards in dodge chargers can run them over\n>no more adventures because everything is a few days away\n\nWhen did you realize cars were the greatest enemy to mankind /pol/?"}, "replies": [">>349561040\n>the BBC \n>Is it white man’s greatest enemy?\n>>enabled cuçkolding globally\n>>white men no longer needed to impregnate women\n>>costs thousands in BBC hip thrusts \n>>forces you into the chastity cage system just to cum \n>>pollutes white wombs\n>dries up the white cocks \nwhat the fuck anon…", "Look at all those busy little bees\nBuzz buzz", "Cars allow for white flight so it's kind of based", "my car is more patriotic than me, at 10,000 rpm it wants to be free", ">>349561040\nwebm reminds me off\n>https://www.youtube.com/watch?v=e9dZQelULDk&list=LL&index=3", "yes, cars are The Great Filter that will doom us all", "at 88 mph you're going to see some serious shit", "Yes, all the points you make are valid. The closest you can get to the rural life and the first step is buying a farm in north dakota, kansas, anywhere in the midwest and becoming as self sufficient as you can.", ">>349561040\n>enabled globalization\nWrong. Trade has always been the driving force, even before industrial technology. \n>men no longer need to escort women\nStop being a betacuck.\n>costs thousands in maintenance \nJewish scams, that's the point.\n>forces you into the wage slave system just to exist \nMore Jewish scams. \n>pollutes the earth\nCO2 is the main 'pollutant'. It's the gas of life. Plants wouldn't exist without it. They grow bigger, healthier and stronger with more of it. As of 2018 the amount of CO2 in the atmosphere is 0.041%. \n>dries up the oil reserves\nWrong. There's still plenty of oil. Biden's just a Chink puppet turning all of domestic production and pipelines off to make your shit more expensive and create artificial scarcity. \n>requires expensive roads paid by your taxes\nThey're actually quite cheap and rarely maintained because the system is self destructive and doesn't give a fuck about any one person. There are far more expensive projects the government's dumping money into.\n>no more walkable cities\nMore Jewish bullshit.\n>causes traffic jams\nEven more Jewish bullshit.\n>allows whitie to continue running\nWhites made the world.\n>makes life more stressful\nThings would be worse without it.\n>kids can't play outside because retards in dodge chargers can run them over\nJewish bullshit due to shitty town designs.\n>no more adventures because everything is a few days away\nThat's up to you if you want to hike or bike. No excuses.", ">>349562445\nwrong on every single rebuttal. what a moron", ">>349562445\nOh great, a contrarian FAGGOT post\n\n>Trade has always been the driving force, even before industrial technology.\nLMAO. And what could globohomo do if some faggot 600 miles away overthrew your bullshit? Going to lead an army by horse drawn carriage? Or maybe railway? Oh wait, they sabotaged the railways GG\n>Stop being a betacuck.\nRetarded statement\n>CO2 is the main 'pollutant'. It's the gas of life. Plants wouldn't exist without it. They grow bigger, healthier and stronger with more of it. As of 2018 the amount of CO2 in the atmosphere is 0.041%.\nBrainlet take\n>There's still plenty of oil.\nExtremely brainlet take. Shale oil is fucked\n>They're actually quite cheap\nLMAO\n>That's up to you if you want to hike or bike. No excuses.\n\nYou're contrarian posting but you're not even good get out of my thread", ">>349561398\nso do horses.\nAnd feet.gr00n", ">>349562814\n>>349562845\nAmerican education in action. There's nothing left to say. Please take your vaccine and booster shots as soon as you're able to.", ">>349561040\nCars are the ultimate expression of individualism. They give the common man the ability to travel great distances without the need for relying on public services or worse, animal power. Otherwise, the planet is fine and global warming is a hoax. The ultimate in \"2 more weeks\" copium.", ">>349563244\nOh nvmd. I thought you were Russian, now instead I see that you are the Slovenian cringeposter\n\nHows that keto diet going for ya?", ">>349563311\n>without the need for relying on public services\nHe says while refueling his car with gasoline, getting an oil change, and using government-maintained roads", "I have amaxophobia so I'm inclined to agree, literal death machines, covid got nothing on the metal coffins.", ">>349563458\n\"He says while refueling his car with gasoline, getting an oil change, and using government-maintained roads\"\n\nThat's a trillion times better than sitting next to niggers on a bus that doesn't go where you tell it to when you tell it to, is it not? Have you ever seen public transportation? Filth, needles, and niggers. Without exterminating all non-whites, public transpiration can never be viable. \n\nEver ridden a horse? It's what I would call a \"dreadful\" experience. We rode horses because we didn't have cars. You Gotta feed them, house em', they have to rest and be maintained, just like cars. \n\nWhat else, bikes? Bikes are good for short distances, city living. But I don't live like that. I'd rather die to be honest. I live 29 miles from my shop. I COULD probably make it on a nice day, but summers here hit the high 90s. \n\nThat's simply not viable. Are cars perfect? Hell no, but they're the best thing we have. When electric VTOLs start hitting the market in 10 years or so, maybe that will finally replace them but I doubt it. \n\nI do my own oil changes and maintenance BTW, I don't trust some toothless wonder to touch my truck. When I do it, it costs much less (thousands of dollars) and I know it's done right. Hell, I watch over their shoulders as they inspect the damn thing. I'm really paranoid and protective about my stuff. \n\nAs for roads.. First, what maintenance? Our roods are crumbing garbage. Might as well be dirt roads. Second, the same roads your bus would take, right? Not an argument.", ">>349566480\n>That's a trillion times better than sitting next to niggers on a bus that doesn't go where you tell it to when you tell it to, is it not?\nHow did niggers get into your white cities? Horse or car\n>Ever ridden a horse? It's what I would call a \"dreadful\" experience. We rode horses because we didn't have cars. You Gotta feed them, house em', they have to rest and be maintained, just like cars.\nThe child balks at responsibility.\n>What else, bikes? Bikes are good for short distances, city living. But I don't live like that. I'd rather die to be honest. I live 29 miles from my shop. I COULD probably make it on a nice day, but summers here hit the high 90s.\nOh so you're fat\n>my truck.\nconfirmed."]}, "349530139": {"op": {"timestamp": 1637931812, "title": null, "comment": "Leave Carlsen to me!\n[spoiler:lit]who are you rooting for[/spoiler:lit]"}, "replies": []}}