{"15221044": {"op": {"timestamp": 1420058720, "title": "Phone", "comment": ">Britbong here\nWhat does it mean when you call someone, and it does a half ring then goes straight to voice mail."}, "replies": ["They may have had their phone off or they rejected the call fast.", ">>15221047\nOr they have your number automatically blocked"]}, "15220495": {"op": {"timestamp": 1420046472, "title": "broke a chair in my hotel", "comment": "Hey so I'm a hotel and they have a $250 damage hold on my visa. Last night we managed to break one of the chairs... Pic semi related. These chairs aren't good made in Malaysia etc.\n\nQuestion is am I fucked for the whole $250? I'm not upset with paying up to $100, but I feel like they are going to be pricks because we already got a firm noise warning from the manager at 4pm... I'd consider wood glue but it has snapped in multiple spots.\n\nTl;Dr got drunk, broke a chair in a hotel they have a damage hold on my visa however the hold is 250$"}, "replies": [">>15220495\n>Hey so I'm a hotel\n\nYou're a hotel? Awesome. What's it like being a hotel?", "Let the 250$ be a lesson not to do stupid shit.", "Good chance they'll take the $250.\n\n>have to replace chair.\n>prior noise complaint.\n>not in good graces.\n\nConsider it a loss. But still get a receipt so you can see what you're billed for while making that stay.", ">>15220495\n\ni'm a chair and you'd better fucking pay for me", ">>15220495\nYou break it, you pay for it. What do you expect, a free ride?", ">>15220528\nI'm a dick and you better pay for fucking me.", ">>15220495\n>a firm noise warning from the manager at 4pm\nDa fuk were you doing tip get a noise warming in the middle of the day? Generally you only get that at night.", ">>15220633\nI can only imagine OP and his friends were flinging chairs and other furniture around the room.", ">>15220495\nAre you in cancun by chance? Someone threw two plastic chairs out the balcony a few nights ago."]}, "15219994": {"op": {"timestamp": 1420034005, "title": null, "comment": "Have any of you been to Times Square for New Years? Tips/advice for the night? I've only ever been to NYC once and I want to see the ball drop in person for once in my life. I'd be taking a train in from Connecticut."}, "replies": [">>15219994\nGet there early. Once the crowd gets big, they stop letting people anywhere near Times Square.\n\nDress warm. You're going to be standing around doing essentially nothing for a long time.\n\nBe careful with your wallet/purse. It's pickpocket heaven.\n\nGo to a toilet earlier. There are limited options, and if you leave to find one you won't get back.\n(and go easy on the coffee or other drinks)\n\nDecide on a meeting point away from the square - like, say, 6th Ave and 44th St - for if you and friends are separated.", ">>15219994\nYou won't find room now; people are gathering together already\n\nGood luck nigga", "Any other good options in nyc if you can be bothered with the absurd time square crowd?"]}, "15219546": {"op": {"timestamp": 1420020078, "title": null, "comment": "need help bad /adv/, was planning on sleeping through new years, but ive been woken up and im fucking mad\n\nwhats the best alcohol to just knock me out? i dont drink so i dont know this shit, money is not an issue"}, "replies": ["buim,p", "Vodka or tequila", "just sip on some beers", "Quit being an alcohol abusing degenerate and get over it.", ">>15219546\nWhiskey I think", ">>15219546\nFucking loser."]}, "15219115": {"op": {"timestamp": 1420009837, "title": null, "comment": "When you tell a girl you've been friends with for a long time you like her and she says she needs to think about what you said for awhile, is that good or bad? Does that mean she's considering me or thinking about how to let me down easily? She has a very kind personality btw"}, "replies": [">>15219115\nJust wait and find out.", "if its meant to be its meant to be bro share your love and be romantic in your feelings", "Nope she is not into you.. A kind girl always fall in love with a bad guy. Please shake off your feelings before it is too late.", "give her time. if she's gonna reject you she's at least thinking about the nicest way to do so. if she's gonna reciprocate, she's gonna need the time. all relationships are a big commitment, and she's probably doing logistics if that's the case.\n\ngood luck op.", ">>15219143\nI don't know if I necessarily agree with that. Sure they may at some point in their lives, but most women wise up and get with a nice guy after realizing bad guys can't provide for shit"]}, "15218683": {"op": {"timestamp": 1420001507, "title": null, "comment": "I'm handsome and charming. How do I get mad pussy?"}, "replies": ["You are a regular guy, 6/10", "Pic not related, right?", ">>15218689\nMore like 4/10. If average is 5 that is, not average being 7 like on /soc/", ">>15218691\nOf course not", "Get rid of the fringe, it's never worked for 16 year-olds and it doesn't work for you. Get a decent haircut I say."]}, "15218105": {"op": {"timestamp": 1419992484, "title": null, "comment": "So /adv/, I'm pretty sure I've been scammed by trying to sublet an apartment. It extremely odd.\n\n>it's some 25 year old marketer living with her fiance and 20 year old best friend roommate\n>they live there\n>they lost their fobs??? but they have the keys to their door\n>we signed the lease\n>we couldnt get a pic of her ID but we got her roommates, and she's on the lease\n>i gave the, holy fuck, $2225 payment - first months rent, deposit, parking, etc\n>got the receipt for it\n\nI signed the lease a week and a half ago and she hasn't replied to my texts since. It's odd because I have her instagram and snapchat. The last time I saw her, she was fighting with her fiance. It doesn't add up. \n\nWhat should I do?\nHow long should I wait until I contact the police?"}, "replies": [">>15218105\n>>i gave the, holy fuck, $2225 payment - first months rent, deposit, parking, etc\n\nWhat?", ">>15218105\ni don't quite get what you are trying to say\nso you .. rent an apartment, signed the contract, paid the deposit + first rent, got a receipt and now you can't contact them and they didn't give you they keys ?\nthere should be the name + address of the landlord on the contract, just go there and demand your keys.\nwhen does the lease start ? \nget a lawyer and ask him what to do. \ndoes that person actually own the apartment ? since you've got the contract, just get someone to open the door for you and change the locks. (but get a lawyer first !)", ">>15218128\nThe actual owner wasn't on the lease. That was a red flag.\nWhat kind of lawyer should I get?"]}, "15217574": {"op": {"timestamp": 1419983794, "title": null, "comment": "This might be a long story but hear me out please...\n>be female, 19\n>have 3 close friends J, D and C, often meet up as a group\n>C drifted away over the year, she got a boyfriend and new friends at school\n>she canceled almost every group thing, most of them literally last minute\n>it really sucks but we don't wanna throw her out of the group because we understand ect.\n>She's never really interested in us, talking about herself a lot now\n\n>Last year C hosted a new years party\n>we had to bring all the beverages ourselves, we couldn't talk out loud because of her mother, C kicked us out at 1am in the pouring rain because she was tired\n>it wasn't a succes\n>She's hosting new years party again this year\n>I can't come because this will be my last new years with my family as a whole (sad story)\n>J and D tell me that C has no sleeping accomodation options this year either, and they both have nowhere to go\n>I offered them my bed and couch, my family's okay with it\n>J and D will be going to C's party for a really short time now, and will be practically celebrating new years with me and my family\n>J told me that's because \"I've been a loyal friend, who was actually there for them this year, unlike C\"\n>I don't mind them coming over at all, but I feel bad for C's party since I feel like I ruined it\n>C just messaged me to ask if she can come over on new year's morning because she wants to spend more time with us and she misses us\n>Haven't replied yet, haven't told the others\n\nWhat do /adv/"}, "replies": [">>15217574\n\n? Just let C come the next day? Not a huge deal at all..", ">>15217574\nSounds like C is trying to make you guys happy by throwing parties. I don't know why not having sleeping accommodations is a bad thing, or why her wanting to spend time on New Years is bad. \n\nIt sounds to be like the friend you felt you were losing wants to spend more time with you. Good for you, and good for her if you don't hold some stupid girl grudge or something because she couldn't have a sleepover once.", ">>15217574\nAre your friends homeless OP? Why are sleeping accommodations such a big deal. Just go home. Sleep in your own beds.", ">>15217612\n>>15217605\n\nFor those of you who are too young or too straight edge, New Year's Eve parties tend to be places where people get liquored up out of their minds, and need a place to crash.", ">>15217605\n>>15217612\nJ and D can't go anywhere that evening. Their own houses are full with family because they were counting on sleeping places (because C offered them first, but later said they couldn't).\nThing is, my dad doesn't want any more people over at new years. He is really sick and I don't want to burden him. I feel bad towards C but she has let us down so many times this year, and I'm not holding a grudge but J and D are hesitant on letting her over too.", ">>15217655\nI don't get it she is asking to come over new year's morning after all the partying is done. Why is this even an issue? She just wants to see you guys.", ">>15217654\nIf you're still into that retarded \"shit faced drunk\" party scene it is. Most people just have a good night then go home. You don't need to drink to the point of killing yourself. That's not fun. \n\nBut by all means, if \"getting krunk\" is your or OPs cup of tea (assuming you're not the same person), go ahead.", ">>15217662\n>Thing is, my dad doesn't want any more people over at new years\nWith new years he means new years day\n\n>>15217685\nWe're not planning on partying and drinking like that. Like I said, J and D have no place to sleep after C's party is over, so I offered them my place. Now they want to move the party over to me.", ">>15217574\nJust cancel all the parties. Parties are dumb. Go out to to eat New Years morning with your friends, maybe make out with one of them, or don't, it's your choice.", ">>15217781\nI guess the options are: keeping C out of it, somehow convince your parents and include her in, or just have everyone go to sleep in their respective homes.\nI think the less problematic choice would be telling them that because of whatever reason (lie a little) your home is not available anymore. Problem back to them.\nIf C wants to spend more time with all of you she has all the time in the world, not just now. And if J and D don't like her parties (which sound horrible) then they shouldn't go. \nIf it's your last new years celebration with your complete family, you should enjoy with them. Don't let this fuck that up."]}, "15216917": {"op": {"timestamp": 1419975144, "title": null, "comment": "im in canada so note that health care is free but medication isnt\n\ni used to work as a part time janitor and enjoyed my laid back work. i got paid 200 dollars more than my current job which i work full time in currently, and hate it.\n\ni have the opportunity to get back my old job but this would look horrible on my resume because my full time job is an administrative position. Other than health benefits, this job is making me miserable and i cant find any time to finish my undergrad because of the hours of work i have.\n\nwhat do you think i should do?\n\n1) keep working this job that i hate and dont finish school\n\n2)go back to being a janitor to finish my undergrad"}, "replies": ["bump", "Further your education.\n\nBTW nothing wrong with being a janitor. My husbands dad was a night janitor to help pay for his PhD.", "dont put it on your resume?", ">>15217100\nWasn't that the premise of Good Will Hunting?", "Oh and he was like in his later 30s, both of his kids were born and he still worked those jobs to get the PhD.\n\nSo education, no excuses OP.", ">>15217105\nits an internal job, so my movements within the corporation are tracked", ">>15217113\nWas it? I've never seen it.", ">>15217116\nHmm this is a predicament...", ">>15216917\n>1) keep working this job that i hate and dont finish school\n\nWhy would you want to Not finish school??", ">>15217122\ni had a few alternatives such as buying pre built property with friends and selling the property after its fully built. \n\nif i did finish school i would attempt to work in a place like alberta with a booming job industry but would take the risk of leaving this job which is essentially an entry level grade job", ">>15217132\ni wanted to use my saved income to invest in property to make capital gains in the future."]}, "15216359": {"op": {"timestamp": 1419967840, "title": null, "comment": "hey /adv/\ni need advice!\nyou see it's my 23rd birthday today\nand i am wasting my life away\nbeing a neet and whatever\npls send help!"}, "replies": ["birthday and new years eve so close together? \n\nyou are lucky. you are automatically depressed only one time a year instead of two like me.", ">>15216369\ni guess that's true\nt-thanks anon", "pls pls advise me!", ">>15216359\ncall for drink anyone thats on your mind right now\nno true man is gonna refuse rounds and rounds of beer in local pub.", ">>15216529\nbut i am not brave enough to do that anon!"]}, "15215726": {"op": {"timestamp": 1419960225, "title": null, "comment": "hi, \n\nI just cheated on my long term girlfreind for the first time. I am not really sure what to do now. do you think I should tell her? do you think this is an indicator that we should break up?"}, "replies": [">>15215726\nYou seem to do whatever you want, so do whatever you want.\n\nNothing good will come of telling her though; you'll just hurt her to make yourself feel better.\n\nBut then again, you have a track record of doing just that, don't you.", ">>15215726\n>I cheated\n>should I tell her?\n>is this an indicator?\n\nAre you seriously this big of a faggot? You obviously don't care for her, so why are you with her? Tell her, then dump her. That way, she can have a real good reason to never get with you again for being such a scumbag.", ">>15215726\nThe fact that you're posting this shows how weak minded you are or that you're just niave. The only thing that matters is what you want to do.\n\nDo you want a long loving relationship? If so do you think partners cheating on each other will help achieve this? Or will honesty and loyalty achieve it? See where im going with this.\n\nIf that doesn't get your brain going then think about this, if you don't tell her. There is a high chance she'll cheat and not tell you too. She dated someone who cheats so there's a high chance she'll cheat too. \n\nAnyway bro, do what you want. Be a shit person or a good one, your life, your story.", "You got off scot free. If you don't feel like a total piece of Shit you might as well act like it never happend. Pretty sure this will give you the upper hand in the relationship at the end of the day.", ">I just cheated on my long term girlfriend\n>Is this an indicator\ni actually kek'd\n\nOP.. try, just this once.. to think..", ">>15215755\n>She dated someone who cheats so there's a high chance she'll cheat too. \n\nSolid logic bra.", ">>15215726\ncheating threads are like shitstorm on /adv/ these days and in every single one is hard to give a straight answer.\nmy, advice OP\nthink of it as a new experience and keep that secret to the grave. there is no room for guilt in you short life"]}, "15215206": {"op": {"timestamp": 1419947551, "title": null, "comment": "I don't know what to do. My teacher was on flight 8501. The news still hasn't sunk with me that she might be inevitably gone forever and honestly I can't cope with it. \n\nShe may be a teacher, but I was extremely close to her, probably like a second mother in school. I.just.cannot.believe.it. and I don't know what to do anymore."}, "replies": [">>15215206\nTry going to see the counsellor/therapist at your school. They're probably prepared for students like you at this time.", ">>15215206\nGet over it, you pussy. How fucking long ago was this?", ">>15215274\nWatch the news some time, grandpa.", ">>15215274\nFuck you. What's your deal? I wonder how you like the sound of that if I said that to you over your parents' death.", ">>15215206\nthat's rough, op. \n\nbut you can be one of the people to honor her great memory, letting her family know that she was appreciated and loved by her students and not merely forgotten like so many others. \n\nhang in there. tragic sudden deaths are the worst to deal with.", ">>15215294\nThanks. I really appreciate your thoughtful words."]}, "15214714": {"op": {"timestamp": 1419934544, "title": "Rebound>Relationship", "comment": "So I recently had a \"rebound relationship\" run it's course, I knew it would be going in I guess but I feel like I deserve a shot at a proper relationship here..\n\nHow do I get that done?\nI was the reboundee so to say and we recently stopped \"hanging out\""}, "replies": ["bump", "If you knew it was a rebound you cant actually expect anything more than some comfort and a good fuck from it.", ">>15214750\nUnfortunately I can't control how I feel only what to do about it.. and I want to try atleast.", "Bump", "Someone must have something?", "Back from work and still nothing?", "H-hello? Is there anybody alive out there?", "You were the rebound nigger, its called rebound for a reason.", "What do you want? You got your answer, stop bumping your dead thread.\n\nYou can't turn it into a relationship, so spend your energies elsewhere.", ">>15216015\nYeah but how do I just.. not be the rebound?", ">>15216017\nI have no answers... only advice against my topic.. Wich is not what I'm here for.. I'm not one to just sit down and just ignore what I want because it will be tough to get it..\n>You always stride for gold, or there's no use playing,\nI'm gonna stride I just need some advice in wich direction this stride should be for the highest chance of succes?", ">>15216019\nman shut the fuck up faggot", ">>15216053\nHey! Please don't call rebound guy pathetic. He's in love with the ball, but she just keeps bouncing away from his grasp.", ">>15216053\nHaha what?\nI'm just asking for some simple advice mate..", ">>15216038\nOkay, let me put it to you a different way.\n\nThe best way you'll get into a relationship is by putting distance between you and your rebounder.\n\nFirst, you don't want to give the impression of neediness. That'll drive them the opposite direction, fast.\n\nSecond, it'll put some objectivity into your perspective. You're emotional now because you like what you had and want to make it last longer. With a bit of distance, you'll be able to more clearly determine if that's the best option available to you.\n\nThird, they've already started to break it off. Let them go for a while. If they wanted more now, they wouldn't start drifting.\n\nSo spend some time fixing up other areas of your life. Give it a few months. Then, assuming you still want that, seek them out for a friendly one on one outing. No hard date, no immediate fucking. You will need to build up the relationship from the ground based on mutual affection, not on short term passion.\n\nGet it now?", ">>15216085\nsee was that so hard?\n\nI'm so sick of the usual /adv/ advice = Drop it, Give up, let it be... Whoever gets their way by stand idly by letting others take what you could?\nI mean just try atleast..\n>\"If we fight we can win or loose but if don't we can only loose\"\n-Some wise dude"]}, "15214066": {"op": {"timestamp": 1419922706, "title": null, "comment": "Hi /adv/,\n\nI am about to walk away from a very good relationship and I'm not sure if I'm making the right choice.\n\nI have a very close tie with this girl. I can honestly say I get along with her better than any previous girlfriend. Over the course of our time together, we have not fought. (disagreements sure, but never anything over the top). We have almost identical interests and personalities, and she's emotionally available and trustworthy. It's really great. I emphasize that most of the relationship is fantastic.\n\nIt's the sex. Candidly, I'm a big guy. (6'4'', 196 lb), She's really tiny. (4'9'' or so.) Not to be graphic, but the sex leaves a lot to be desired simply because...its too big, and I also have a lot more experience than her. Every time, it really hurts her, she ends up bleeding and has to stop regardless of how slow or gentle I go, or the position we use, and I have to go to the bathroom and jerk off to finish. Naturally, she doesn't want to have sex too often. She's not willing to finish me off in \"other ways\" either, seeing as my penis is covered in blood after our sex.\n\nI absolutely love her, but I have physical needs from a lover and a partner. I would appreciate advice and input from you guys as to what my next moves could be.\n\nThank you for your help"}, "replies": ["Yup. Don't settle for less, you can find better.", ">>15214066\nHow often do you have sex? My friend's boyfriend has a huge dick and if they go more than a few days without having sex, it's painful for her and she bleeds too.", ">>15214078\nWell, towards the beginning she really wanted to accommodate me. She would try once or twice a day, but as time has gone on, she is more and more adverse to being physical with me. Perhaps now 2x a week? Again, it's the rarest time that the sex proceeds to conclusion.\n\n>>15214073\nI think this is right, but it is a hard decision when I love her so much.", "Any other ideas for what I can do?\n\nI wish it didn't have to be one extreme or the other - together or not. Ideally, I'd want to continue dating this girl but also enjoy the sex and stop injuring her.", ">>15214138\nI'd say try having sex more often given my friend's experience (I'm >>15214078) before you call it quits", ">>15214150\nWhat can I do to convince her of this?\nProbably gonna be hard to pitch:\n\n\"Hey, you know that extremely painful activity that you don't want to do? Let's do more of it otherwise I'm leaving your ass.\"", ">>15214188\nYeah, I realise it's hard to suggest it. Maybe say your friend and his girlfriend have had the same problem and that the more often they have sex, the less it hurts for her?", ">>15214066\nWatch hentai that will fix it.\nBut seriously don't leave her. A woman isn't born for you to be a sex slave", ">>15214203\nI think your advice is a bit off? No one is suggesting she's a sex slave. I want her to enjoy it too. We're discussing the physical component of sexual relationships, and you come out with this?\n\n>>15214200\nWorth a shot, nothing lost and if it doesn't work I'm in the same boat. Thanks.", ">>15214066\nWanted to follow up on how I handled the situation.\n\nI told her upon waking that while I'm happy with how we connect and communicate, the physical part of our relationship isn't quite working, has the potential to work better, and that I want to work with her to make it satisfying for both of us.\n\nShe didn't take it well. She started crying saying she feels really close to me, and if I have these kind of thoughts then the relationship isn't working as well as she thought it was, that she was deluding herself into thinking I was happy.\n\nIt was a rough conversation. I expressed to her that I wanted to continue seeing her, that I love her too, and that while sex is a small part of a relationship, it's a very important part to me.\n\nI told her I'd leave her be to think about things for a few minutes. It sucks to see her so upset, but it is what it is and I'm not really willing to compromise here. I'm thinking I want to make it open - I can continue to be friendly and intimate with her, without the sexual nonsense.", ">>15214668\n>I'm thinking I want to make it open - I can continue to be friendly and intimate with her, without the sexual nonsense.\nNo girl worth her salt will agree to that bullshit.", ">>15214672\nIt's that or nothing. I'm not a monk and I'm not looking for a celibate relationship.\n\nThat's what this board is for! If you or anyone else has some ideas here, feel free to throw them around. I could use the help.", ">>15214678\nYou either work out your problems, or you leave her. If you love her, don't make her give in to an open relationship (which I guarantee she does not want) because she wants you to stay", ">>15214681\nA fair point. I just hope we can reconcile things and stay together, it's unfair that some relationships are great emotionally and horrible physically, and vice versa.", ">>15214698\n>unfair \nAt least you have small gf, m8", ">>15214066\nI left a girl a few years ago who I had this same sort of close tie with. We loved each other and liked all the same things, did everything together, it was absolutely wonderful.\n\nI left her because I wanted to keep having sex with more people, basically. Her sex was boring and I wanted more.\n\nIt was the worst decision of my life. Nearly every day it haunts me, three years later. I've had to purge my life of anything involving her in order to help myself not remember her. I had to be a complete asshole to her to make her stop texting me.\n\nSeeing your followup post makes it look like you already fucked it up. If you actually love her, this might end up haunting you for eternity.", "Just because you're not able to stretch her IT doesn't mean she's too tiny. \nRemember some foreplay.\n\nWomen are supposed to give birth. Do you have any idea how big it's the head of a baby?", ">>15217017\nTo be fair 4'9 women aren't \"meant\" to have babies. They often miscarry and pregnancies are very difficult. Things aren't in their favor."]}, "15213576": {"op": {"timestamp": 1419915617, "title": null, "comment": "How to survive after getting kicked out from your home? I don't have a job and I only got $1000 in my bank."}, "replies": [">>15213576\nfriends and working part time jobs", "you're gonna want to find a job \n1000 is enough for rent like anywhere, pay your first months rent and get a job \nbam \n\nseriously I moved out on 250$, youll be completely fine", "Find a job and asap.", ">>15213581\nMy nearest friend lives 500 miles away from where I am right now.", "Not OP but on a related note\n\nhow much money should I save up to move out?", ">>15213598\nDon't they have beds for homeless people? \n\nIsn't it like a first come first serve kind of thing though", ">>15213598\nSo travel there with the $1000", ">>15213590\nGood to know you can survive out there for less.\n\nAny advice which job is the easiest to get in? I don't really care how menial it is since I've done my fair share of dirty work (for free though)", "Enough so that you have 1,000 saved and plan on not touching is a good start.", ">>15213621\nObviously, I don't have a car. Which do you think is the cheapest way to get from somewhere in San Diego to Sacramento? I've never ridden trains and buses in longer travels at least", ">>15213576\nFind a couch to crash on for like $200ish a month for now. Start looking for a job asap. Small businesses especially food service is always looking for employers.\n\nThere's no quick fix. No answer on here is going to help you more than just going out and doing stuff.\n\n>>15213612\nIdeally? Enough for 3 month's worth of rent plus food, some cooking utensil to take with you, and a reliable vehicle.\n\nObvious things change if rent changes. If you move to San Fran, it's going to be more than if you move to say Nebraska. Ya dig?\n\nAlso, if you move out during the summer time, you can get away with sleeping in your car. Not ideal but hey what can you do.", ">>15213624\nlandscaping, construction, general labor type jobs \n\nthey pay well too if you need money fast", ">>15213633\nGreyhound\n\n>>15213638\nThis guy is spot on. I paid my painters like $10-15 an hour and they were literally trash. These jobs are easy as fuck", ">>15213633\nGreyhound is really cheap and quicker then driving yourself, you can sleep while riding.", "On a related note, where can I get free access to internet while searching for jobs and some place to crash? My phone interwebz got cut off.", ">>15213624\nLook for now hiring signs (means they are desperate for employees) and the smaller the business, the better (less HR bullshit hiring managers need to put up with to hire someone). \n\nApply for pretty much anything you are half-qualified to do, though.\n\n>>15213590\nWhen did you move out? 1950? \n\nMost apartments require background checks, reference checks, job checks, and security deposits. It's not like OP can be like here I have some money, give me keys to an apartment. \n\n$1000 will easily be spent and fast...sorry to say, OP.", ">>15213576\nIf you can buy a cheap car that's good on gas, you can make really decent money delivering pizza.\n\nIf you're in a big city, taxi drivers make good money, too.", ">>15213633\nCan you buy a cheap bicycle?\n\nI can't speak for your exact location, but they usually provide reliable short-distance transportation with nearly no upkeep costs (generally just keeping enough air in the tires).", ">>15213667\nBought one thanks to /n/. But I doubt I can bring it with me to Sacramento."]}, "15213105": {"op": {"timestamp": 1419908724, "title": null, "comment": "Am I the only guy in the world that has too much pride to pursue girls?\n\nThink about it, to pursue someone that means they're more important than you, it's a power dynamic and you're giving them all the power\n\nThere's been many times where I've been excited about a girl only for them to pretty much dry out contact and kill any chance there was, leaving me with disappointment. I promised myself I would never let anyone else be in that kind of position of power over me man or woman."}, "replies": [">>15213105\nI'd read a book on the history or seduction. Believe it or not, women actually make the first move a lot of the time - it's just subtle. Flirtatious eye contact, subtle body cues from across the room, etc. \n\nYou also don't have to give them the power when you pursue. \n\nIntroduce yourself, and then walk away. You only give power when she feels like you're too invested. \n\nEXAMPLE FOR YA!\nTake buying cars for example.\nYou drive to a car dealership and you approach the salesman (most of the time).\nHe tries to jack up the price, but if you're willing to walk away with no deal, then he has no power in the relation dynamic. \nYou threaten to leave, and if he wants you to buy a car (or the girl actually has an interest in you), he'll end up chasing you. \n\nIt's how this shit works bro. It's all about how willing you are to say no deal. Instead of a lose-win situation (you on the losing side), you're looking for a win-win or you walk away.", ">>15213105\n\nDoes pride give good head? Because my gf does. She was worth the chase, and really, it was fun for both of us.", ">>15213105\n...you gota be vulnerable to love dude.", ">>15213124\nWhy even bother with that though just to get some shallow pussy?\n\nI'd rather have a clear peaceful mind, fap to all the porn my heart desires and spend the rest of my time doing things I love, hanging out with my friends, and playing vidya\n\nI can confidently say that if a cute girl were to walk up to me tomorrow and act interested I'd reject her just because I know what shitstorm is coming after the initial chat", ">>15213138\nI hope getting your dick sucked (which is about as pleasurable as a fleshlight) was worth losing your pride and balls over", ">>15213145\n\nOh, it is.\n\n>Fleshlights are basically as good as blowjobs\n\nOh, you.", ">>15213160\nThe only thing good about a blowjob is that a girl's stupid enough to put your filthy dick in her mouth, after that it's pretty much a lubed oral fleshlight", "I feel exactly as you do, OP. The same words come out of my mouth all the time.\n\nWomen, it seems, get to be the choosers -- I have been told from a young age by my family that \"you don't choose them, THEY choose YOU\" making me feel utterly powerless. Even if it SEEMED like I chose them instead , it's only because I subconsciously tried to win over their approval to get with them. Women have always been perceived by us as these outlanders, judges, etc -- they're different organisms. They get to filter through the dozens of men that hit on them every day, and if you hit on then you'll be just another mindless drone for this queen bee, stung, dropped, and maybe you can watch as she fucks that chad at the club.\n\nMost of this is a giant fictional nightmare scenario, I've realized, because women can be rejected too -- if nobody goes after them. What's the solution to stop feeling this way? I'm lurking to see.", ">>15213214\n>What's the solution to stop feeling this way?\nEasy, stop giving them power. Stop approaching them and stop showing interest. \n\nIf all men did this at once, the collective womankind would go through a deep depression and come out of less cunty uptight and full of themselves.", ">>15213105\nMan, no. My girlfriend has zero power in the relationship. I just love her for being a rare decent fucking human being in a sea of fucking shit.\n\nIf we broke up tomorrow, I'd be fine with it. I don't lose anything besides her company and time invested that I would have wasted anyways without her.\n\nShe's infinitely less important then me, while I love and respect her, she doesn't control anything. I don't understand your point.", ">>15213232\nok as long as you know that she will eventually either cheat on you or break up with you", ">>15213357\nYeah, that's how relationshits work anymore, man, you can't be unrealistic. That said, it's unrealistic to think every relationshit will end in failure because of an affair or her leaving you for someone else. It puts too much fault on somebody else and mitigates your own responsibility to make a relationshit work. I've never had a girl cheat on me, nor leave me for somebody else.\n\nI'll ask you this, how long were your grandparents dating before they married? How long did they stay married?\n\nDifferent generation, sure, but same human beings.", "Honestly it sounds like you take yourself too seriously."]}, "15212602": {"op": {"timestamp": 1419901964, "title": "To Cheat, or not to Cheat.", "comment": "Hey /adv/\n\nI posted this on /b/ a while ago, because I had forgotten about this board...\n\nBasically, I've been 2 years with the same girl. We have a good relationship. We both make each other happy and we almost never fight. She's a sweet person, always smiles, always does a little something to make my day better. \n\nThe thing is... thanks to her religious beliefs, she won't have sex with me.\n\nI've beared it for this long; but it's frustrating and I feel it's actually being harmfull to me. I can't help but be a guy that is turned on all the time by everything, I must have the testosterone levels of a Tyranosaurus. Ever since I went abstinent because of her, I've become a short tempered person, my mood shifts all the time and I even began losing sleep. My agression has gone through the roof and I lose my shit over every little thing.\n\nLately I've been thinking about cheating. With a prostitute or some stranger woman who just wants a night stand. I'm seriously considering the prostitute, as this would be \"business only\" and to my eyes would feel like I'm not cheating since there is no sentiment.\n\n\nI sound like an asshole, and I feel like one, I feel actually very bad about this... but what should I do ?"}, "replies": [">>15212602\nWhy are you even with this girl, and are you willing to marry her?", "Back to b, they'll give you the answer you want", ">>15212606\n>I'm seriously considering the prostitute, as this would be \"business only\" and to my eyes would feel like I'm not cheating since there is no sentiment.\nThat's great and all but I'm not so sure she'd agree.", "You have been with her for 2 years now. That's enough time to decide whether she is worth marrying or not.", "If you want to cheat, then break up with her and fuck all the bitches you can. If you see her as marriage material then you dont cheat, mature the fuck up and stick with her.", "This girl is god tier, marry her", "If you're worried about the morality of your actions, no don't cheat. Just because she's stingy as all hell with her vagina doesn't give you a free ticket to stick it in others.\n\nYou've got two options.\n\n1. Be an insensitive ass hat and just do what you want. If you really couldn't care less about what the \"right\" thing is, just go ahead and cheat.\n\n2. If you do actually value your relationship and the person you're with, try consulting with your girlfriend about this issue. Ask if there is any middle ground you can settle on (Oral sex, temporary FWB on the side of her choosing, etc). I know it must be rough as hell to go without sex for two years with a girl you love, but if you actually love her you will consider other options.\n\nIf you're prepared to cheat on her, you two probably shouldn't be together.", "giver her a ring", "You know the answer to this yourself, friend."]}, "15212069": {"op": {"timestamp": 1419894691, "title": "In a confused state...", "comment": "I need your help /adv/ recently I went to a party here in Brooklyn at which several people I know showed up, and some I didn't know. I met up with this one girl that seemed familiar to me, one that I've seen on an occasional basis, but didn't exactly know her backstory. Anyways their was an affection for us both, nothing serious or lustful, nothing that involved bumping or grinding. But that's not where I need the advice, it starts here... it would later turn out that I was dancing with my 1st cousin, once removed/ or second cousin, however you'd like to put it. I didn't find out until afterwards when I saw her mom and father pick her up after the party. You see the thing is, I've never really had that type of 'cousin relationship' with her(the girls mother) mainly because I grew in a generation late than she did(she's more than 2x my age), so there's not much given time for me to get to know her or her daughter(the one I danced with). On the other hand both me and the daughter are just a year apart. I want to know from you guys, whether I should just drop this and forget about it, or pursue against what some people believe to be as somewhat precariously 'socially unacceptable'. Keep in mind, this is the 2nd cousin I which I've hardly had any relations as 'family' member. Please help?"}, "replies": ["So you are asking us if you should shag your second cousin who isn't really related to you ? That makes her just a person.\nGo for it, champ.", ">>15212149\nI can't be that simple, I mean can it? It's the fact that she shares the same 1/8 of blood that I do that startles me a bit, yet she's practically a stranger rather than family...but thanks for the reply", ">>15212224\n>the fact that she shares the same 1/8 of blood that I do\nSo ? 1/8 isn't enough to endanger your descendency if you ever end up having kids with her.\nJust go and fuck it/her.", ">>15212303\nI kinda meant it in a metaphorical manner. But whatever you're right."]}, "15211356": {"op": {"timestamp": 1419884502, "title": null, "comment": "How can I cope with not being able to play MapleStory.\nLong story short: I got locked out of my account and there's no way I'm getting it back.\nMaple was basically the only game I played for the last 6 years (sometimes on hiatus when got addicted to another game, but I still came back to Maple).\nI get sad when I try to play other games now.\nI can't seem to do anything.\nHow do I get the drive to do new things and move on?"}, "replies": [">>15211356\nYou grow up.\n\ntry being atleast 15 years old before posting on this board"]}, "15210917": {"op": {"timestamp": 1419876767, "title": null, "comment": "I'm a man who's pretty bad at sex, my girlfriend barely gets wet and never has an orgasm.\n\nIs there any way to get better?"}, "replies": [">>15210917\ngirls get wet?\n\ncare to explain", ">>15210922\nLook it up.", "Which actual part of sex are you bad at friend. Whats your typical session with the lady like. How's your foreplay game?", ">>15210957\nWell, she usually doesn't like foreplay but when I'm allowed to I usually start out cuddling, grabbing her by the throat (her request) and kissing her, making sure to caress her whole body, then I go down on her for as long as she'll allow me.\n\nDuring sex itself I try to be dominant, picking her up, and per her request I fuck her as hard and as long as I can. If I break rhythmn in any way she usually tells me I'm not trying hard enough and leaves the bedroom.\n\nThere's about seven positions we have sex in, the rest my girlfriend doesn't like or care for.\n\nAll in all I guess I'm all-round bad, it takes about 30 minutes of unbroken stimulation to even get her to have an orgasm orally.\n\nAll men I know had women have multiple orgasms their first time. My girlfriend told me her first thoughts with me were \"is that it? My boyfriend was better\".", ">>15210994\nShe's the one who sounds terrible in bed to be honest... brutal! \nDo you have any experience with other girls? Were they pleased?", ">>15211049\nSounds like she is the one who is terrible in bed*", ">>15210994\nfrom your description, I'd say that you're dating either a confused ice queen, or a total bitch of a human being.\n\nNow, do you know what she likes? Not specifics, in general. You said she likes you grabbing her throat and other dominant gestures. Does that mean she likes feeling like a sex toy, like some 50shades of shit crap, or that she just likes the certainty. \nDo you go down on her because she likes it, because she wants it, or because you read that it's what will get her hot and bothered?\nWhat else can you tell me about her?", ">>15211049\nI've never had anyone else, never even kissed anyone else.\n\nShe's had seven guys before me, she says they all thought she was amazing in bed. And as she said, her ex was bigger and better than me, he could cum about three times in a row before going soft.\n\nThat's why I figure I must be terrible in some way.", ">>15210994\n>My girlfriend told me her first thoughts with me were \"is that it? My boyfriend was better\".\n\nAnd you put up with that shit?\n\nAt least tell me you told her to go fuck herself for saying that to you", ">>15211055\nIn general she likes sex to be rapey, where she struggles and tries to push me away. She has rules though and if I do anything she doesn't like (accidentally touch her asshole if I'm grabbing her ass for instance) she'll get out from under me.\n\nI go down on her partially because I just love doing so, also sometimes she feels like getting off and she'll ask me. Usually she hates it though, so I don't really get to \n\n>>15211062\nI apologized for doing poorly, actually. It's important she gets what she wants out of sex, so of course she'll have to tell me stuff like that.", ">>15211057\n>>15211062\nDamn dude, even if you are bad in bed you don't deserve that.\n\nI honestly would dump that bitch and find someone who cares about you and wants you to succeed in bed with them", ">>15211057\nShe's bullying you m8, don't let it get to you... I'd tell her to go back to her ex.\n\nIs she great outside of the bedroom, why do you put up with that? Are you scared of being alone?", ">>15211069\nWhy are you still with her?\nShe sounds like and insufferable pretentious cunt. If she doesn't respect you this much, drop her ass.", ">>15211069\n>rapey\nIt falls into BDSM territory, the second stuff like this pops up. Specifically DSM, but bondage could be involved.\nHer rules sound a lot like it as well. Common practice in the scene.\n\nThat said, she's a bitch, who doesn't care about your satisfaction, or even state of mind. Telling someone how they suck and how everyone else is better and crap, is controlling behavior. Get away from her.", ">>15211073\nHer ex broke up with her so she can't really go back. \n\n>>15211073\nI don't think she was bullying me, she was just being honest I reckon.\n\nOutside of the bedroom she's great, she doesn't cheat on me (or at least not openly) or hurt me regularly.\n\nAll in all I'm pretty sure the problem is with me, it's what she says at least.", ">>15211096\n>Outside of the bedroom she's great, she doesn't cheat on me (or at least not openly) or hurt me regularly.\n\n>All in all I'm pretty sure the problem is with me, it's what she says at least.\n\nYou sound like a battered husband.", ">>15211119\nWell, not a husband (yet) and I don't get hit, so I'm pretty lucky.", "Is this a troll? No one can seriously think they're lucky because they don't get hit (yet). Anyway,\n\n>she usually tells me I'm not trying hard enough and leaves the bedroom.\n>There's about seven positions we have sex in, the rest my girlfriend doesn't like or care for.\n>My girlfriend told me her first thoughts with me were \"is that it? My boyfriend was better\".\n>she says they all thought she was amazing in bed. And as she said, her ex was bigger and better than me, he could cum about three times in a row before going soft.\n>She has rules though and if I do anything she doesn't like --- she'll get out from under me.\n>she doesn't cheat on me (or at least not openly) or hurt me _regularly_.\n\nNone of this sounds normal to me, these are not things that a loving person would say or do to you. A lot of men are very selfish in bed, you sound like you're giving a lot and trying hard. She should appreciate it, not make you feel terrible about your skills.\n\nLike >>15211091 said, she's trying to control you by making you feel bad about yourself. This might be because she is frustrated that you're not her ex (not your fault!). She takes the anger out on you. I'd get out before she shatters your self-esteem.\n\nWhy did her ex dump her?", ">>15211133\nDude. Look up \"Identifying losers by Joe Carver\" (first result if you write it into google). Read that shit. Then make up your mind.", ">>15211143\nShe stopped taking her antidepressants and subsequently got too lazy for him. She'd never go to his house (not a problem for us because we live together) and sexually she stopped pleasing him.\n\nThat's his version anyway.\n\nI do think I try hard but who gives a fuck about how hard I try of I don't perform regardless?", ">>15211149\nI looked it up, it doesn't fit my girlfriend very well as she shows little to no physical violence. She can be provoked but outbursts can be measured in times-per-year.\n\nIt does fit my mother to a T, which might shed some light into my development.", ">>15211377\nRead again. If we're reading the same damned site, then it covers not only physical, but emotional and psychological traps that many abusers have a habit of using. Hell, the majority of the site is about the psychological aspect...\n\nThat said, I posted due to your responses, and yeah, your mother being somethign like that would make the same impression. \nHowever, you're still unsatisfied with your sex life and you gave everyone here the impression that she's basically a bitch about it. A manipulative bitch. Maybe you chose a girl just a wee too similar to your mother, and thanks to love, don't see the bad sides?", ">>15211568\nIt's emberassing to admit but I sometimes think that's the case. I normalized women being manipulative, demanding and mean, it's all I saw growing up.\n\nI hope I can find the backbone to do something. I was actually a bit shocked to find that the steps for detachment are a very close match for my current state of being. I've long since given up hiding my depression and trying to be exciting. I'm done dealing with the constant rejection.", ">>15211670\nI think she's trying to motivate you and piss you off a little so you'll be more aggressive. You need to man up and take her. That's what she wants.", "how do you get better at anything? practice. Have more sex til you get awesome at it. Jeesh people ask shit they already know the answer to.", "hate to say man but she will def cheat on you. you better invest in some toys bigger dildos etc..hurry", ">>15213075\nThis was also my thought. She's into being dominated and wants you to dominate her. But I also stronglyyyy suggest you leave her. She doesn't sound like a good girlfriend. You would be happier without her.", ">>15214223\nThat's if she's not doing it already. Though her reasons for OP being bad a sex, prob wouldn't even be a reason why she is cheating.", ">>15210994\n\n> when I'm allowed to I usually start out cuddling, \n> I go down on her for as long as she'll allow me.\n> I try to be dominant, \n> per her request I fuck her as hard and as long as I can.\n> she usually tells me I'm not trying hard enough and leaves the bedroom.\n>There's about seven positions we have sex in, the rest my girlfriend doesn't like or care for.\n>My girlfriend told me her first thoughts with me were \"is that it? My boyfriend was better\".\n\n>>15211069\n> I apologized for doing poorly. \n> It's important she gets what she wants out of sex\n\n>>15211096\n> she doesn't cheat on me (or at least not openly) or hurt me regularly.\n\n>>15211133\n>... I don't get hit, so I'm pretty lucky.\n\n>>15211670\n> I normalized women being manipulative, demanding and mean\n>I hope I can find the backbone to do something \nYour gf might be a bit of a cunt and maybe your stroke game could use some improvement. But there's one make problem I see here\n\nNo (straight) women wants to be fucked by another women. I can tell by your writing that your a cowardly bitch in bed. I mean it in the sincerest form your apologetic effeminate submissive and timid. You've taken a thing that's supposed to be a raw hot passionate session of two ppl getting their rocks off into \" Oh sorry dear. d,did I pull your hair?\" \" Is, is this angle good? D,do you like it? I'm sorry\"\n\nMy advice for you, you need to actually FUCK your gf. No asking for permission no trying to set the mood in fact don't even talk, next time your horny just throw her on the bed and start ripping of clothes. Fuck her hard the way you want to and ignore her complaints. Bust all over her face and then still make her suck your dick. Quit apologizing and waiting permission OP. take what's yours. That's the attitude you need\n\nTrust me shell appreciate it. And shell be thinking about how, you, her sexy alpha bf fucked her little pussy hard next time she's fingering herself and not about her ex again."]}, "15210503": {"op": {"timestamp": 1419870354, "title": "should I propose or run?", "comment": "So.\nMy boyfriend moved state and we've been living together a year.\nLove him and rship is great and we are cool.\nNow says doesn't know if we will go the long haul and unsure of marriage (certain before).\nHe was engaged to his exgf which bums.\nIs not that into me?\nThinking of proposing to him if we're still good next year...\nOr do you guys think I should cut my losses?\nCan't help but thinking he doesn't really love me and I should look elsewhere. \nAside from this revelation things are cool but his little outburst really got to me."}, "replies": [">>15210503\nYou shouldn't propose, especially if you have a shred of doubt. \n\nI don't know if you should necessarily do something such as leave but I would definitely put the thoughts of a ring out of my mind.", "If he loved me he would at least say wait and see though, wouldn't he?\nWhy propose to ex and not me?\nFeel like its a time bomb...end inevitable.", "NEVER MARRY\n\nHOW HARD IS THIS TO UNDERSTAND?!", ">>15210555\n>If he loved me he would at least say wait and see though, wouldn't he?\nIf i was in a relationship and really cared, I would, but that doesn't necessarily mean he would. \n\n>Why propose to ex and not me?\nHe was probably very young, could you tell me if he was? Looking at it in terms of \"you loved her more than you love me\" isn't going to help your situation. People make mistakes.\n\n>Feel like its a time bomb...end inevitable.\nThere could be other signs he has emotionally checked out of the relationship, temporally and/or permanently", ">>15210555\nNot necesserily. Maybe he likes being truthful (about this), or he wasn't aware that there was a better phrase.\n\nMaybe he got burned by her refusal. Maybe he doesn't have the money for a wedding. Maybe it's one of a dozen other reasons. But that's beside the point. You are not in a competition with his ex (unless he still has feeligns for her, in which case, RUN), so stop acting like you are. Stop thinking of it in terms of \"he used to kiss her, does that mean he doesn't love me?\", start thinking of it in terms of \"He's with me, so he loves me, right?\". And yes, there's a reason for the question mark there...", "Guess he was bit younger and more immature but can't help feeling I'm the booby prize.\nLove him to death but don't want to be in a rship with someone who 'doesn't know' about our future. \nAm I over reacting? !\nSurely 2+ years is long enough to decide if yr in it for good (understand that yea, shit happens and could go wrong but the 'intention' would be there and he would know if he sees a future with me).", ">>15210582\nRight, I mean you can give it time but that is unlikely to fix shit. The \"booby prize?\" I don't understand, do you just feel like a trophy girlfriend or something?\n\nTwo years is enough for some and not others. If it is any consolation it is probably legit grounds to breakup with someone over.", "I meant compared to his ex he wanted to marry.\nYall right, I shouldn't dwell on his past.\nRegardless tho it feels as if he's setting me up to leave coz he doesn't know if we will end up together period.\nHe's been honest n shit happens but would have preferred an I love you and I WANT to stay with you despite married or not.\nShould I 'wait' when hes unsure?", ">>15210638\nI really need to ask. Are you in a relationship, or in an unofficial business practice? You make it sound so clinical, like you don't have any feelings for him, and are considering only the practical sides of a relationship. Or are you just that upset right now, that you're effectively psychopathic?", ">>15210638\nNoone can make that call for you, that's what life is about; fucking up and being better for it.\n\nIf you want to leave, leave, if you want to wait, wait. Your destiny is yours to control, don't let someone else take control of your life.", "Well I am upset.\nMy bf told me he 'doesn't know' if we'll make it.\nI would have said that I love him and despite what could go wrong RIGHT NOW I wanted to stay with him.\nOf course I love him thats why I didn't just leave when my feelings were hurt.\nI want to stay but I also want to be with someone who says they wanna stay, not are unsure.", ">>15210716\nIf you're upset and not thinking rationally I would advise relaxing or taking a bath or something. Maybe a walk, just clear your head.\n\nIt seems like you are pretty distraught, which is normal. To make these sort of decisions you have to have a clear mind.", ">>15210503\n>Now says doesn't know if we will go the long haul and unsure of marriage\nIs it just about the marriage or he’s unsure about the relationship in general?\n If he’s afraid to commit fully… well either wait for him to fix that of bail. What more there is to it?\n\n>He was engaged to his exgf which bums\nHe probably danced salsa while wearing pink boots and declared hamlet to her.. does he have to repeat that too so you wouldn’t feel inferior?\n\nHave you ever asked for a mans hand? And then have him fck you over?.... probobly not..\n\nI bet the value of a ring has dropped to floor, and in 2 or 3 years his perspective hasn’t changed. If having a ring on your finger is the only way you can feel trust form him… I wouldn’t expect that too soon though…\n\nHow long ago did he break up.. I bet he doesn’t want to look like idiot for proposing to a next gf again.", ">>15210582\nThe Rules state that if he doesn't marry you in <2 years, you're wasting your time.\n\n$20 you guys will break up, he'll meet a girl 5 years younger than you, and they'll get married and have a baby less than a year later", ">>15210727\nThere are rules... fkc.. Can I see them.. I've been doing this wrong all my life. god damn it I knew something was off", ">>15210755\nThe Rules is a famous book written in the 90s for women who want to get married. It's literally the first result when you type in \"the rules\" into Google", "They we're engaged about 4 years ago????\nHe's unsure about if we will stay together. Says he's happy but doesn't know if he will be with me for good.", ">>15210780\nTranslation: I'm going to keep Anonette for sex and company until I met the real woman of my dreams, then I'll dump Anonette and marry new girl. Whatever I told her I'd marry her, but it was 4 years ago, obviously no one thinks I'll actually go through with it, not even her if she's let it go on for so long", ">>15210762\nOh.. lel... I can even imagine the people who took them without second thought.. .sad.\n\n>>15210780\n>He's unsure\nThen thats that. That is how he feels. Ask him honesty if that is how he feels or its just fear speaking. Tell him that it bothers you. He wont change his feelings overnight if youre ready to work on that - stay. If you want someone to verbally promise you 4ever&ever and a ring look somewhere else\n\nIts all aobut how you feel.\nIf you tell him that it bothers you and he doesnt want to lift a finger to work on that, you’ll never be happy there.\nWill you feel happy / satisfied if you have to work on this more than you wanted?\nJust ask yourself what makes you happy and if you can achieve it in this relationship", ">>15210503\nFirstly, not all men are going to propose so early in the relationship. While you may be ready to get married, he may not want to yet due to financial reasons or just because it's very time consuming to plan a wedding. I'm assuming you both have jobs, are in college working on a degree, or something of the sorts.\n\nSecondly, is there anything you may have done or said to make him change his mind about getting married? Did he want to any point in time before this?\n\nPerhaps he's not the type to commit, and if that's the case, then do what you have to do. But it's not healthy to go about comparing his past to your relationship. Believe me. I've done that before, thankfully my fiance was understanding of this, but not everyone will be.\n\nAnyway, I really think you need to give him more time. Perhaps someday he'll surprise you. My mom and stepdad were together 8 years before he proposed to her. I know it may be hard for you, but you need to be patient. And if it bothers you that he says he's unsure of marriage, simply ask him why instead of just assuming he doesn't wanna commit on a higher level."]}}