{"12742": {"op": {"timestamp": 1451430000, "title": "So we really trust the Iranians, apparently", "comment": " https://www.algemeiner.com/2015/12/29/iran-receives-large-delivery-of-yellow-cake-uranium-powder-from-russia/> Ali Akbar Salehi, the head of the Atomic Energy Organization of Iran, said that Tehran had received nearly 197 tons of of uranium concentrate powder needed for the enrichment process, in exchange for 11 tons of low enriched uranium (LEU).> Salehi said that Iran had carried out the exchange with Russia in accordance with Supreme Leader Ali Khamenei’s letter regarding compliance with the Joint Comprehensive Protocol of Action (JCPOA), which instructed that Iran first take delivery of the yellow cake before exporting the LEU. "}, "replies": [" >>12742This is really good news. Basically, yellow cake is \"raw\" uranium that takes months to turn into the enriched stuff they sent to Russia. While still classified as LEU, some of what they had was enriched to a higher grade than necessary for fuel use, indicating that it was likely intended for possible weapons use in the future. That's now gone.Also importantly, this was one of the terms of the deal that some experts worried Iran would refuse to comply with.More Jewish sources:http://www.jpost.com/Middle-East/Iran/US-hails-Iran-shipment-of-low-enriched-uranium-stockpile-to-Russia-438767http://www.nytimes.com/2015/12/29/world/middleeast/iran-hands-over-stockpile-of-enriched-uranium-to-russia.html ", " >>12742I've been extremely surprised how well the Iranians have managed to accomplish their goals. Not only did the sanctions get lifted, they still have the ability to develop nuclear weapons within a short amount of time. That's basically having a soft nuclear deterrent on you.Take that along with the massive amount of influence they've been developing in Iraq (not sure how much they've gained in Syria), and Iran is sitting mighty happy as far as middle eastern geopolitics is concerned. ", " >>12781Thanks Obama. ", " >>12781I doubt they could produce a nuclear weapon with relative ease like everybody expects. At least, a usable one. That shit's hard, and expensive. Still, the fact that everybody acts like they can makes it effective in scaring people like having the actual ability would. ", " >>12742We might as well trust them if we're fighting ISIS along side them in Iraq for the time being. ", " >>12856You could actually with the material they have.But it wouldn't be a conventional nuclear weapon as the nuclear material would not be part of the chain reaction that creates the explosion but rather to 'salt' a conventional weapon with adding radiation. This is known as a \"dirty bomb\".Both the US and UK government believe it is very likely that this with happen before the end of this century. ", " Good. Watch Israel suddenly become very well behaved. Gee, no more atrocities against Palestine? Wonder why. ", " >>12781its called having a limp wristed faggot as presidentif dubya was still in office today iran would probably be our puppet and there would be no ISIS or syrian civil war. ", " >>12742This is nothing. Yellow cake comes straight from the ground, they could have dug it up themselves if they wanted ", " >>12885>being this deluded ", " >>12880Ah, but a dirty bomb isn't a very good deterrent. And I don't think Iran is suicidal. If they build a nuclear weapon, they're gonna do it right. ", " >Ali Akbarfucking seriously? Christ ", " >>13023Two very common Arabic, and therefore Muslim, names. What's the problem? ", " >>13033Finally a post worthy of their dubs...Also, there has to be an Alliyah Akbar out there somewhere... ", " >>12880A dirty bomb is more akin to a biological weapon than a nuke. Not many are going to die from the explosion it's the fall out that's going to get you. And frankly with all the missing yellow cake from when the USSR fell chances are if a dirty bomb goes off it won't be because of Iran. ", " >>13015Iran's supreme leader said \" Israel won't exists in 25 years\" wouldn't put it past them to indeed be suicidal. They want their damn 72 Virgins. http://www.cnn.com/2015/09/10/middleeast/iran-khamenei-israel-will-not-exist-25-years/ ", " https://www.youtube.com/watch?v=k9trCus2SG0 ", " >>13111So why do I always hear about these Iranian \"Leaders\" that seem to always spout rhetoric contrary to what Irans real politicians are actually trying to achieve? Is this just propaganda? ", " >>13131Iran's government is pretty schizophrenic.Of the top of my head, this article is a pretty good showcase of how all-over-the-place its policies can be:https://en.wikipedia.org/wiki/History_of_the_Jews_in_Iran#Islamic_Republic_.28since_1979.29(You can also see the obvious bias and poor English in places, so do check sources and take a grain of salt before accepting anything written there as fact) ", " >>12890Bush and Cheney's advisers actually advised them against invading Iran because of their large conventional military that could have easily waged guerrilla warfare across the country which itself is pretty huge.Militarily invading Iran would be the worst decision ever and would have bankrupted our country alot more then Iraq+Afghanistan and we would have seen tens of thousands of causalities in the first few months.The US can't make Iran their puppet and there isn't any reason why we should anyway. Iran are the good guys of the middle east for the most part. Our allies Saudi Arabia and Qatar are the cause of most of the regions problems.>>13111He didn't mean that in terms of Israel being nuked or whatever, he just meant that in 25 years there won't be a Jewish-state called \"Israel\" located in Palestine, essentially he was just implying there will be an arab state or a multi-ethnic and pluralist one there instead of a state that favors jews over arabs ", " >>13111Except if Iran were suicidal, we'd probably be suspecting a lot more clandestine support for jihadists than we actually do. Iran's policies have all been towards state-building, with who they fund outside of their nation, to how they develop within it. Even if the Ayatollah went nuts, there's enough state-building interests within that nation that it wouldn't last. ", " >>13131They need to seem really anti-West, so the religious leaders provide that rhetoric, while state organs operate in compliance. This way, they keep much of the more still revolutionary minded populace that they've built, satisfied that the government is indeed representing the interests of the 1979 revolution, while actually doing things necessary to build a functioning nation with the ability to project power. Support for the revolution still has quite a lot of strong supporters, despite even very conservative leaders (e.g. Ahmedinejad) making motions to weaken the Ayatollah's power in government. ", " >>12880>before the end of this centuryA lot of things can happen before the end of this century... ", " >>13164But Iran has voiced their hate for Israel on multiple occasions. And correct me if I'm wrong, do they not support Hezbollah (spelling) a major terror organization in the region? Saying they're the good guys if the Middle East may be a bit extraneous. ", " So a nuclear Iran isn't a threat? ", " >>12742No, but they're a problem for Saudi Arabia and Israel, not us. Honestly the Islamic world annihilating itself in a nuclear war would be the best of all possible outcomes. ", " >>13273Israel is our ally. A problem for them is a problem for us B ", " >>13265Iran's leaders and most of its citizens are vocal in their disdain for the Israeli government but they still make it clear that they just don't like the government and its policies and its not that they don't like Jews, Iran has a large Jewish population and Iran's leaders are very respectful of Judaism and any Jews who aren't linked to the Israeli government.They do support Hezbollah but its a large stretch to call Hezbollah terrorists, Hezbollah does not intentionally target civilians unprovoked like Al-Qaeda, they only launching rockets at civilian Israeli areas during the war as reprisals when Israel would drop tons of bombs on Lebanese civilians ares where Hezbollah wasn't operating. Hezbollah has been accused of involvment in the Marine Corps bombing and in the bombing of the Argentinian embassy but if you look past what the MSM will tell you about those the evidence for Hezbollah's involvement in those is actually really thin. Hezbollah also legitimately and legally participates in Lebanon's politics and hold seats in their parliament and treats civilians of all religions and ethnic groups fairly and never targets them except in retaliation during war like I mentioned so its not really fitting to call them \"Terrorist\" like we called Al-Qaeda. Right now Iran has 20 times more then the US to fight ISIS because Iranian soldiers are on the ground fighting them now and have been for a long time. Iran also does not generally support groups that target America (like Al-Qaeda). Virtually all of the terrorist groups that threaten the US are funding mostly by Saudi Arabia, Qatar, and Kuwait.Unlike Saudi Arabia or Qatar Iran also has a parliament and hold presidential elections and is one of the most democratic governments in the middle east, even though the presidential candidates have to be approved by the clerical establishment there is enough leeway given that a relatively liberal reformer was elected recently (Rouhani). ", " >>13266Iran isnt a threat period, only fucking idiots believe that Iran is some kind of aggressive power. ", " >>13169>they are anti-west because they NEED to be politically, not because the west has fucked up half the world, the middle east, and Iranian itself with their constant blundering, tone deaf interventions to preserve their business interests across the world <:^)When will people from the US/Western world finally admit to themselves that the rest of the world has very good historical and contemporary reasons to hold the western world in contempt? Stop pretending your shit doesn't stink when you've been laying deuces around the globe without pause for 4+ centuries. ", " So many butthurt Amerifags, cheers to Iran. "]}, "8734": {"op": {"timestamp": 1450047600, "title": "French National Front defeated in bid to win regional vote", "comment": " http://www.bbc.com/news/world-europe-35088276France's far-right National Front (FN) has failed to win a single region in the second round of municipal polls.The party was beaten into third place, despite leading in six of 13 regions in the first round of voting a week ago.The centre-right Republicans finished ahead of President Francois Hollande's governing Socialist Party.FN leader Marine Le Pen said that mainstream parties had colluded to keep it from power and vowed to keep on fighting.\"Nothing can stop us now,\" she told supporters. \"By tripling our number of councillors, we will be the main opposition force in most of the regions of France.\"Ms Le Pen said the party had been \"disenfranchised in the most indecent of ways by a campaign of lies and disinformation\".She had stood as a regional presidential candidate in the northern region of Nord-Pas-de-Calais-Picardie, while her niece Marion Marechal-Le Pen was the FN's candidate in the race in Provence-Alpes-Cote d'Azur, in the south.After both led with more than 40% of the vote in the first round on 6 December, the Socialist candidates in those regions pulled out so their voters could support Republican candidates in the second round.The FN actually increased its votes in the second round to more than 6.8 million, from 6.02 million on 6 December as more people voted, according to the ministry of the interior (In French). But the FN share of the vote went down slightly from 27.73% to 27.36%. "}, "replies": [" Thanks to France's use of runoff elections, I don't think there's any chance for FN to have significant power. There's no way they're ever going to get a clear majority of voters, and they're controversial enough that if people see that they might win major elections, they'll actually vote to make sure that doesn't happen. ", " >>8735Extremist parties gain power in times of crisis.FN losing isn't a sign of common sense, it's a sign that things aren't bad enough yet for people to throw stability out of the window. ", " >>8740Oh, I'm not saying it's necessarily common sense, and they definitely don't have the crisis necessary to gain support for their extreme positions. But the election system makes it hard for them to win any election, even despite gaining popularity. Though it probably makes any initial gain in voters easier because people aren't as worried about voting for fringe parties in the initial election. I just can't see enough people swinging to FN unless the Republicans massively fucked up, but even then that's assuming all the voters who abandon them would switch to FN, over a different party. ", " President Obama Delivers Statement on US Military Force Against ISIS | AUMF FULL SPEECHWatch the full video here !http://alb-news24.com/obama-against-isis-latest-news/ ", " >>8750You posted this after you posted your thread. You okay, mate? ", " Disgusting how the French political establishment disenfranchised so many voters during the election. Imagine the butt hurt that would be created if the FN played the same dirty game locking out a rival political party from government permanently. ", " will rise again "]}, "12044": {"op": {"timestamp": 1451257200, "title": "South and Japanese prime ministers to discuss the issue of wartime sex slaves", "comment": " http://bigstory.ap.org/article/3a3c22abbf21499399a9cf1f632cd46f/south-korea-japan-discuss-wartime-korean-sex-slavesI wonder how they will try to excuse it this time. "}, "replies": [" The excuse for thousands of years was 'vae victis' ", " Damn. Too bad they didn't have cameras back then I bet they wouldve leaked some choice pornos. BDSM. All that good shit. ", " >>12051Wouldn't they be immediately taken down anywhere they were posted? I'm admittedly not sure of how websites handle warcrime rape when it's posted. ", " Korean will ask Japan to pay money again. ", " >>12044It's to late for this shit. Everyone is dead.Hate it when new generations have to shoulder the blame of previous gens actions. ", " >>12051They did have cameras back then. You'll sometimes see trolls posting pictures of World War 2 Japanese soldiers bayoneting babies. The Japanese were such awful people in the war that they made the Nazis look like nothing, and that's an understatement. ", " >>12070>not sure of how websites handle warcrime rape when it's posted.That is a hillarious phrase.I think mainstream porn sites would delete them, but there are some sites with barely legal things(or not legal at all) ", " >>12084>Everyone is dead.>In South Korea, there are 46 such surviving former sex slaves, mostly in their late 80s or early 90s.>Hate it when new generations have to shoulder the blame of previous gens actions.Do you also hate it when the current generation tries to take pride in previous generations' accomplishments? Can't have it both ways. ", " >>12110>Do you also hate it when the current generation tries to take pride in previous generations' accomplishments?Don't you? It doesn't even have to be the previous generation. Too many people take too much pride in things that they didn't have anything to do with. ", " >>12090100% this.The Japanese behaviour during that time was so sadistic and horrific compared to the Nazi's more clinical and less common warcrimes (most Nazi warcrimes being the result of a few specific sick individuals) that it was a regular occurance for the Nazi high command to try to stop Japanese atrocities. During the Japanese Rape of Nanking, Nazi officers and medics set up safe refugee zones where the Chinese could escape the Japanese butchering and rape, and get medical attention. During that conflict the Nazis actually worked with the Allies to evacuate Chinese.Sometimes I look at Japan then and Japan now, and wonder how their culture could change so dramatically. Then I remember that they were nuked. Twice. So I think the US must have essentially beaten them until they became submissive. Thank god, because old Japan was a nation of monsters. ", " >>12185>mfw even seeing this people still claim that \"human nature\" is a thing. ", " >>12190How do you mean exactly?You may need to clarify that statement. ", " >>12110What the hell kind of logic is that?The current generation has no credit of the actions of previous ones. I am proud of the accomplishments of my country and ashamed of it's failures. I am not accountable for any of them though. ", " >>12044Not sure how well you are into this issue.But I highly doubt this is the end of this bullshit issue.Once they find out they have nothing more to bitch about.S.Korea will bitch and moan till the end of time.Japan already payed a hefty sum way back.S.Korea never gave or issued any funds or treatment to these people. ", " >>12195How can a peoples change so dramatically, so fast if supposedly their character, values, etc. Are fixed and unchanging? That's what the human nature crowd argues for, we are inherently this and that, therefore there is no point in even trying to fight some of our ugly behavior because that's just how we are. ", " >>12050Sargon pls go. ", " Several South Korean 'comfort women' protested outside the Japanese embassy in South Korea for decades in an attempt to seek redress. Not sure if they still do it today, but there are definitely Japanese people alive today who didn't care about their distress. ", " >>12274Oh I get what you mean now.And yes, the idea that we \"cannot help ourselves\" when we do something terrible is a total copout. It's just a way to try to let ourselves off the hook.Human nature does exist, but not only is it something which is VERY easy to fight against, but it is something we succeed over EVERY FUCKING DAY. Every time you walk over a subway grate and your stomach recoils for a second, every time you drop a coin into a homeless guy's cup, every time you see an attractive person and DON'T immediately throw yourself at them, every time you sit in front of a computer for several hours rather than go outside and look for food... all of these things are successfully battling \"human nature\", as human nature is just another way of saying our instincts. We fight our instincts constantly, it's called impulse control. We even fight our own SURVIVAL instincts! We skydive, we read scary stories and watch scary movies, even though our survival instinct literally spends the whole time shrieking \"RUUUN! RUN, YOU IDIOT!\" from our hindbrain. But what the fuck does our hindbrain know? It's a moron, it doesn't know shit, so we ignore it.Claiming you did something because of \"human nature\" devalues the accomplishments and strides we have made out of the prehistoric era, and is just an excuse monsters use to try and excuse behaviour which is primitive and shitty. ", " >>12420This anon for president ", " >>12424I don't know about president but maybe Anon 12420 can be the ambassador to a non-shitty country somewhere? ", " >>12420>mfw people give me Steven Pinker's The Blank Slate as some sort of refutation ", " >>12556>mfw you don't bother to make a counter-argument, just a vague implication that my post is inherently wrong because I am not the first person to think of it.Are you planning on making a point? Or are you just going to greentext as if your opinion should be unchallenged gospel? ", " fuck japanese people. good thing they got hiroshima'd and nagasaki'd. only humans to get atomic bombed in the history of our universe. guess why? the worst forms of humans and im from ghana but from what i studied, those japs were worse than nazis ", " >>12561I agree with your post.I'm >>12274 I was trying to say that \"human nature\" advocates like to rally around Pinker for some reason, but in reality anyone with an ounce of intelligence can poke his conclusions full of holes. ", " >>12044Heard Japan was settling with 8.5 Million worth of funds. ....Which I guess means that Korea is officially recognizing their women as whores who got paid to have sex with Japs, but the Japs dined and dashed on the bill, and are just now paying up. ", " >>12588Ahahaha, I see. I have never read Pinker, so it being 4chan, I just assumed you were trying to be combatative.I always am forced to wonder, when people advocate hard for \"human nature\", what skeletons lie in their own closets that they want to excuse themselves for. I mean, why try to excuse monstrous behaviour unless you have something you want excused yourself? ", " >>12190>People don't get hungry or feel emotionsWhat do you think drives us? Pure rationality? And if you don't think those are human nature, then what is it? ", " >>12185You're full of shit, it was one german guy, who was only member of the nazi party to do missionary work, he was made leader, since he was the closet thing to an ally to the japs. ", " >>12668They usually want to justify a social construct, such as monogamy for instance, they use crappy pseudo science to claim that its our inherent nature to be monogamous and so that's how they justify it, they want validation of their behavior because they're insecure about it. ", " >>12675By \"human nature\" I and everyone (except you it seems) mean an unchanging patter of behavior, and/or an inherent character trait, such ad violence or kindness, or an inherent way that we do things or structure the society no matter the environment.Of course we get hungry you moron. "]}, "12722": {"op": {"timestamp": 1451430000, "title": "you see, it's all about the puddin pop.", "comment": " http://www.people.com/article/bill-cosby-arrest-warrant-alleged-sexual-assault-2004>An arrest warrant has been issued for entertainer Bill Cosby for allegedly drugging and sexually assaulting former Temple employee Andrea Constand at his Elkins Park, Pennsylvania mansion in January 2004, Montgomery County District Attorney-Elect Kevin Steele said at a Wednesday press conference. "}, "replies": [" Bill Clinton not available for comment ", " >>12723What does Bill Clinton have to do with it? ", " >>12722>2004C'mon guys, it's the >current year! ", " >>12725It's a fail troll anyway but 2004 is emblazoned on the URL!!! ", " >>12724He's referring to two accusations of rape and one of sexual assault. The latter was settled out of court with no admission of guilt, while the former two were never brought to trial.The main thing held against Bill are the dozens of confirmed affairs and the subsequent perjury. ", " bill cosby dindu nuffin ", " http://cantstopwolf.imgur.com/all/ ", " >>12816Hes a goods comdeidians like kevan hert. ", " >>12725>>12731The statute of limitations on rape is 12 years in Pennsylvania.> •originally published 12/30/2015 AT 09:35 AM EST "]}, "12291": {"op": {"timestamp": 1451343600, "title": "Cancer kills rocker days after diagnosis", "comment": " http://www.theguardian.com/music/2015/dec/29/lemmy-lead-singer-of-motorhead-dies-at-70-after-battle-with-cancerThe band requested fans “play Lemmy’s music LOUD. Have a drink or few. Share stories. Celebrate the LIFE this lovely, wonderful man celebrated so vibrantly himself. "}, "replies": [" When I think of Lemmy, of course the first song is Ace of spades. But then I recall 1916. A look at war with soul of an artist. To Lemmy, a drink and a toast. He did what few men do, he truly lived. Prost! ", " >>12291>cancernah, it was /mu/>>>/mu/61318865 ", " Rock and Roll is dead. Rage! Rage, against the dying of the light. ", " >>12519Holy shit, I never check /mu/, I hadn't seen that yet. Thanks anon ", " >>12519what the fuck manthis is just like that one time /tv/ downed a plane ", " >>12578>>12589just wait until the day Stan Lee kicks the bucket.It will be /co/'s Iwata, and there are regular \"when is he gonna die\" threds "]}, "11017": {"op": {"timestamp": 1450738800, "title": "SpaceX Successfully Lands Rocket", "comment": " http://www.nytimes.com/2015/12/22/science/spacex-rocket-landing.html?smid=fb-nytimes&smtyp=cur&_r=0 "}, "replies": [" We're in the future now... ", " >>11025>yfw the future we've been waiting for is finally arrivingJET CARS WHEN? ", " Now is the time a candidate should capitalize by invoking the \"Ask not\" speech.Perfect time to try to inspire constitutes rather then talk shit. ", " >>11034You mean like, make fun of them going to the bathroom?! ", " >>110172nd stage re-ignited after payload delivery, good sign for GTO! ", " We are one step closer to space porn. Ok, I had to get that out of my system. Anyway, it really is good that they have learned how to get stuff back to earth safely. ", " https://telegram.me/joinchat/CFnQZwOhFSAkez55NrFJvQTIRED OF IRL PEOPLE AND THEIR BULLSHIT??JOIN THIS FUN /INT/ GROUP TODAY AND HAVE TIME OF YOUR LIFE! ", " >>11017Is space mining still illegal or what? We can seriously make it a thing with a fleet of these rockets ", " >>11194https://www.washingtonpost.com/news/the-switch/wp/2015/05/22/the-house-just-passed-a-bill-about-space-mining-the-future-is-here/It's no longer illegal except for governments. Corporations and people can do it. Space is going to be anarchism-capitalism because it's too big to regulate. ", " >>11208Well time to get ready to become a fucking space pirate ", " >>11223Yar, we be boarding those UFOS. ", " >>11017Thank you free market. Thank you for the future space feels. ", " >>11029Jet cars are f*****' expensive. This is the future, not a future shop sale. ", " >>11025Yeah, we're finally getting back on track to where we were 35 years ago. Hooray.I will never understand the SpaceX flight. ", " >>11240>Yeah, we're finally getting back on track to where we were 35 years ago. Hooray.>I will never understand the SpaceX flight.>t.Dr D.Syndrome ", " Hello Reddit! ", " Why are there soo many white males?That's problematic. ", " >>11055Hello,reddit. You are on 4chan, an anonymous message board! Quick reminder, you will not receive any repercussions for typing anything unsavory here! Thank you for your time, and have fun browsing! As common courtesy, I will show you how things are done here. >space porn whenNext time, lurk moar! ", " we need to push it harderhttps://youtube.com/watch?v=MvacG_nhD34 ", " >>11055>We are one step closer to space porn. Ok, I had to get that out of my system. >One can smell the redditfagottry from here ", " >>11240>>11240>we're finally getting back on track to where we were 35 years agoWe never got this far. Every booster that has ever flown has either been expelled, or in the case of the space shuttle, would have been cheaper if it was spent after each flight. Recovering the first stage for re-use is uncharted territory in the history of space flight, and I for one am excited to see where we'll go from here. ", " >>11055Reddit: the post ", " I watched it on the livestream and it was awesome to see it all work out well. The atmosphere when they pulled it off with all the cheering was ecstatic and contagious, I felt slightly touched seeing it considering the implications of a reusable first stage. Economically speaking this is a tremendous breakthrough, the cost of the first stage of a rocket generally accounts for 75% of the full total cost of the rocket. Again innovation has guided the market well and this marks a significant step in reducing the cost of getting off the ground. in times of such little public R&D funding for space projects by the government its great to see the private sector continuing to innovate whilst also reducing costs. ", " >>11208Oh thank god the House passed the bill, because America owns the fucking universe and we needed their approval to space mine.Christ the Chinese can't nuke you fucks soon enough. ", " USA USA USA!!! ", " >>11318What you said was more reddit than the first guy. Who gives a fuck that he doesnt spout memes and use the lingo. Eat ass nigga ", " >>11759>Not spouting memes ", " >>11797Space memes... ", " Does this mean I'll be able to shitpost in zero g within my lifetime? ", " >>11291Why is there am additional \"o\" in your \"so\"?\"Soo\" is a distinguished and respectable Chinese name with centuries of historical importance and to see you so blatantly shit on them is beyond pathetic.To say that your post is problematic does not do justice to the countless oppressed Chinese people you seem to so jovially mock. "]}, "10730": {"op": {"timestamp": 1450652400, "title": "Woman Mows Down Las Vegas Pedestrians", "comment": " a few hours ago, a woman with a toddler in her car deliberately ran down dozens of pedestrians on the Las Vegas Strip, killing at least one.here's the link: http://edition.cnn.com/2015/12/21/us/las-vegas-strip-pedestrians-hit/index.html "}, "replies": [" BUCKLE UP BUCKAROO ", " >>10745We need to ban assault cars! Driverless cars 2016! ", " >>10730Hope someone can find out who this cunt is ", " >woman driver>mows down 40 pedestrians>'96 OldsmobileWhen we get a mugshot I'm adding her to the 4chan killer list under /o/ ", " >>10730Possible Allah ackbar? ", " >>10761She's black, so don't expect to see anything more about this story in the MSM. ", " >>10786GMA had a story on it a few minutes ago.they didn't talk about her race, but they did mention the 3 year old in the back seat. ", " >Las Vegas Deputy Police Chief Brett Zimmerman said the incident was \"not an act of terrorism\" but appeared to be intentional.Oh, phew! At least it wasn't terrorism! ", " >>10751Please kill yourself>>10730Yeah 37 people were injured (ouch) and one person died. ", " >>10730kek whites are psychos fucking stinky mayos ", " >>10842She was a nigger m8 #niggerlivesmatter ", " The woman who drove her car onto a sidewalk along the Las Vegas Strip, killing one person and injuring 37 others, has been identified as 24-year-old Lakeisha N. Holloway, Las Vegas Metropolitan Police Department Sheriff Joe Lombardo said.http://i2.cdn.turner.com/cnnnext/dam/assets/151221132753-lakeisha-holloway-mugshot-exlarge-169.jpghttp://www.cnn.com/2015/12/21/us/las-vegas-strip-pedestrians-hit/ ", " >>10870>L a k e i s h aShe was mowing down white oppression you inconsiderate blankie. ", " >>10844Underrated post m8. ", " >>10885+1 ", " >>10870Shes only initially being charged with one charge while a list of others have yet to be charged. Fuckin niggers m8.When will the justice system crack down on people again without having to worry about black lives matter protesters coming out. She had a child in the car mowing down a crowd of people, child abuse/neglect should have been charged as well as many charges assault with a niggermobile that they can give her. ", " Where the fuck are the mods? ", " >>10899Something more interesting that moderating this shitstain of a website probably. People have a life you know, we don't ALL post sexist and racist comments on websites all day and bait people for attention because your parents rightfully thought you were fucking failiures. ", " haha o fugg DDDD::: ", " >>10908reddit pls ", " >>10908back to >>>/tumblr/ you go ", " >>10908>Being this Reddit>Le Racists have no life maymayGo back to your hugbox, faggot. ", " >>11147Do you have a life? ", " >>10842>Lakeisha>white ", " >>11147This anon knows what's upI read an article that said she was 'stressed out and living in her car'All of a sudden this is the white mans fault and will turn into a talking point on why we need government housing and relocation.. Which is a scheme to flip red countys blue.>maybe if we pay for their housing too the black women won't chimpout and kill shit.Please give her the chair. ", " >>11243>will turn into a talking point on why we need government housing and relocationI don't think that will happen.>Please give her the chair.I think you need relocate.>>>/pol/ ", " >>11252 hereYeah I read it over and it was pretty /pol/ worthy. But the chair? She killed someone and injured a whole crowd.. Sounds pretty malicious. I know Nevada has the death penalty.. I dont think its a stretch really. I know people have gotten it for less. ", " get ready for more of this type of shit, this is by design to turn normal people that want to work into some of the poorest as opposed to the ghetto whores that think having babies is a job. ", " http://www.nowtheendbegins.com/woman-in-las-vegas-shouted-allahu-akbar-as-she-ran-over-40/She was shouting Allahu Akbar as she slammed into people with her baby in the backseat.Snopes has completely discredited this of course, which is how you know it's true. "]}, "11456": {"op": {"timestamp": 1450911600, "title": "Syrian Government agrees to participate in peace talks to end Civil War", "comment": " http://news.yahoo.com/syria-ready-enter-geneva-peace-talks-foreign-minister-070928842.html>\"Syria is ready to participate in the Syrian-Syrian dialogue in Geneva without any foreign interference,\" Walid Muallem said during a press briefing following his meeting with Chinese foreign minister Wang Yi.>With crucial backing from the United States and Russia, the plan aims to install a ceasefire in Syria, possibly in January, when talks could also begin. "}, "replies": [" >>11456Great we can return the Syrians now... ", " WOW IT'S FUCKING NOTHING ", " I pray everything goes well soon.I wish well to the Syrian people. ", " What if its a trap?! Lol, sure, get them refugees back ", " >He added Syria was also waiting to receive a list of \"terrorist organisations\" that would not be allowed to participate in the talks.Sounds like \"peace talks\" between Assad and himself. ", " >ceasefire in syria>ceasefire>in syria>kek ", " The real question is who is going to enforce this \"ceasefire\"? ", " >>11740the UN probably, with major help of the US, because nobody in the region wants to help ", " >peace talks>only one side has agreed to participateyeah its nothing ", " >>11466Edgy ", " >>11767Not a single member of the UN is going to be willing to send troops to enforce a ceasefire. ", " >>11767LOL ", " >>11466get out libtard cuck sanderslover r3eeeeee ", " >im-fucking-plying "]}, "11854": {"op": {"timestamp": 1451084400, "title": "SHOCKING!!! A Woman Was Set Ablaze And Killed In L.A. On Christmas Day", "comment": " http://www.risingsun247.com/2015/12/shocking-woman-was-set-ablaze-and.html "}, "replies": []}, "11560": {"op": {"timestamp": 1450911600, "title": "MUST READ!!! GENOCIDE IN BIAFRA LAND", "comment": " http://www.risingsun247.com/2015/12/must-read-genocide-in-biafra-land.html "}, "replies": [" >africano surprise ", " >monkeys kill other monkeyskek ", " >>11560>DECEMBER 7, 1968.>>>/his/ ", " >>11673>implying there are mods. "]}, "7602": {"op": {"timestamp": 1449615600, "title": "Angela Merkel is the Time person of the year", "comment": " 1. Angela Merkel2. Abu Bakr al-Baghdadi3. Donald Trump4. Black Lives Matter5. Hassan Rouhani6. Travis Kalanick7. Caitlyn Jennerhttp://time.com/time-person-of-the-year-2015-angela-merkel-choice/?iid=bottomrecircDiscuss "}, "replies": [" >>7602Why is that murderer Caitlyn Jenner even on the list? ", " Is this a list for Americans or is it supposed to represent the world? Because I don't see how some \"literally who?\" Americans are on the same level as globally relevant statesmen. ", " >>7606The only one I didn't know is Travis Kalanick, who it turns out is the founder and CEO of Uber. ", " >>7602>Trump>JennerThis is why I don't take TIME seriously ", " >>7612Trump's done a lot to change the political game this year. ", " >>7612at least Trump is relevant ", " >>7616No he didn't. Sure, he effected this race, but I doubt he'll be remembered as anything other than \"that rich nut that tried to be president.\" ", " >>7618>he effected this raceeffected != affected ", " >>7602I'm reading this article and still don't get why Merkel is the person of the year. But having Trump and Jenner on it is a joke. If Trump WINS the primary and presidency, then he'd be a lock. ", " >>7602Should been the Uber dude. Only person on there that actually had a legitimate fix to one of our problems. ", " >>7607It's a good service and one that we probably should've already had by this point in time, considering it's THE CURRENT YEAR. If nothing else, it provides an excellent way for drunks to get home without having to risk a DUI and a murder charge (like Bruce Jenner should've gotten). But all in all, it's one of the most pro-free-market phenomenon I've seen in years. Your city has a shit taxi-service that overcharges? Shit, sign your city up for Uber. Your city lacks public transportation? Uber. People will always be willing to drive others around with a GPS for money because it's easy and can actually be fun. Full time or Part time, it doesn't matter. Uber will never have a shortage of drivers, and will never have a shortage of passengers. It's genius.I'm glad he's higher up on the list than that murderer Bruce Jenner. ", " Why is albahdadhi on this list? ", " >>7647Because she ruined an entire continent and is pushing the globalist-communist agenda. ", " >>7602>that fucking listAmerican journalism is such a fucking joke, holy shit. ", " >>7616Nice meme politician, braindead /pol/lack. ", " >>7602I was pulling for Bernie to be the PotY. Still, I can see why they picked Merkel. I certainly wouldn't want her job. ", " >>7663Hitler was Time people of the year once as well. Being person of the year has more to do with global impact than morals or integrity. In fact I'm surprised Al-Baghdadi isn't #1 on the list. Probably bumped him down a bit to avoid the controversy. ", " >>7605Caitlyn Jenner is #1 Freak Show of the Year. ", " >>7602I mean, she IS the most relevant person of the year.Nobody fucked up as hard as she did. ", " >>7618He's been the #1 Republican candidate for like 5-6 months without spending any money, and has forced a ton of shit into the public discourse that our resident morons in the media and political establishment wished would go away forever.The sheer colon cancer he's inflicting on half the world is reason enough.>>7707Thanks friend |:^) ", " Most influential people are Muslim Terrorists, leftist-liberals and a transgender who is hypocritically against gays and gay marriage. ", " >>7706The list is for influential people, not good people. ", " Reminder that it's not BEST person of the year, it's most impactful. ", " >>7602What the fuck is a hashtag doing on the list? ", " >>7734Doubt it. Stalin was Time POTY twice. Although I also doubt Merkel was more influential than Al-Baghdadi. ", " >>7874You know it isn't like black folks have been murdered with impunity for decades while nobody does nothing about it ", " >>7884Its mostly the deads' fault as they don't know how ti surrender. Anyway it's prettydumb. Hashtags are people ", " Bernie Sanders won Reader's pick, so I'm good. ", " time to say good bye ", " >most incompetent, passive, inept politician in the world>person of the yearwhat has this fat eastern german slut done to deserve this? wow, she sat back and watched while a million refugees flooded into her country, with no plan on what to do with them, completely relying on voluntary help.that sure is praiseworthy. ", " Hello. I am a young Pole and I see these happening at our border .... that hundreds of men ready to fight. A woman ??They wear 3 children on his hands, backpacks, bags, etc. These guys have it somewhere .... but it's their religion .WTF Germany already are afraid to live in their own country, with Poland am not afraid. But we begin to fear our government because if someone publicly objection immediately give them a racist, fascist or other anti-someone (sry for pol. I explained on google) ", " Daily reminder, because no one ever gets this: Person of the year represents who had the most impact and is not an award of the person who did the greatest or nicest things.Bin Laden was once supposed to be person of the year but was changed due to outraged. Stalin has had it like twice and so has Hitler. ", " >>7843As a leftist liberal, I don't feel any real influence m8 ", " >>7908>praisePerson of the year is not a praise award, dunce. Every fucking god damn year since the awards initial year like a century ago, there's been someone who thinks the award is a badge of honor. All it means is most influential.Admittedly they rarely give it to the most influential either do to the misconceptions you and others have about the award. ISIS should have won, but then all the people who don't understand the award would flip ", " >>7772This ", " >>7605I think you're trying to hard when Baghdadi is number 2 on the list. It's about impact, not morality. ", " >>7912They always use buzzwords to fight, you have to just ignore them and use logic People eventually get sick of hearing buzzwords instead of a real argument ", " >>7618>causing so much asspain that UK wants to ban him>not globally relevantjust because you don't like him, doesn't mean he is not relevant or else there wouldn't be death threats coming from a member of the ACLU ", " >>7707meme magic is real. ", " you're a fool if you give a shit about this after they pussied out in 2001 and gave it to the NY mayor instead of bin laden ", " >>7602>4. Black Lives MatterI've never met him. ", " >Black Lives MatterWhat the fuck? Did SJWs rig the poll or something? ", " >murderer Caitlyn JennerWhere the fresh hell this meme come from? ", " >>8177bruce jenner was in a car crash a while back and the other person ded ", " >>8166SJWs probably wanted CIS Scum to win the poll... ", " >>8216Okay, how is 'car accident' the same as 'murder'? ", " >>8246He was impaired at the time. That is to say, he was a woman. ", " >>7888>Memeie MemedersSomeone call Bernie and tell him his European socialist utopia is in the process of collapsing ", " >>8272Not to defend socialism, but one of the main factors for the collapse is the thoughtless implementation of a shared currency.Another one is the thoughtless opening of borders to immigrants. Neither of those two is particularly socialist. ", " >>8274Seems like Globalist Socialism has failed.Perhaps something like Nationalist Socialism might work for Yurop ", " >>8276>Globalist SocialismWhat?>Nationalist SocialismYou talking about this?https://en.wikipedia.org/wiki/National_socialism ", " >>8278Well, what would the opposite of National Socialism be?Also yes ", " >>8283There is such a thing as international socialism, but that's for the proletarians to fight against the international free market, not for national governments. International socialism works towards the world revolution and thus towards socialism, not within a socialist country.With the socialist mindset it is criminal to accumulate large amounts of wealth by having others work in your factories.A rich country in the modern world cannot be actually socialist. It must justify the discrepancy between its own wealth and the poverty of others with free market ideas. At best it can have socialist aspects.That roughly describes Europe though.They are (relatively) free market economies, but they also offer some socialist extras to their inhabitants./tldr ", " >1 million refugees in Germany this year>20 million muslims by 2020how many billions does this cost? Will they have to convert their homes to cucksheds soon? ", " >>8391>20 million muslims by 2020What?I mean it's true that more than 60% of the refugees that come here are muslims, but how the fuck will there be 20 million of them by 2020? ", " >>8391I have to add something to >>8415You can't trust CSU politicians. They are batshit-crazy and Germans know that. That's why people call Bavaria the \"crazy south\", because the CSU is very successful there. ", " >>8391>how many billions does this cost?Newspapers are already speaking of a strengthened German economy because of the refugees. ", " >>8437I actually laughed out loud at this ", " >>8448It does make sense though.Germany's domestic economy has been lackluster, what with Germans having so little money to spend.The refugees need (and get) food, and that boosts sales.Whether this growth is healthy or not is a different question. ", " >>7939>ISIS should have wonNot it shouldn't have because ISIS is not a person you dumb fuck. ", " >>8721I beg to differ.http://danbooru.donmai.us/posts?utf8=%E2%9C%93&tags=isis-chan+ ", " >>8724Well all I can say is she sure influences my dick. ", " >>7661You wanna drive around people without insurance and get totally wrecked financially if you ever run into an accident? Drive for Uber.You want to force people to drive with shitty underpaid nutjobs who may or may not try to murder or rape you because they can barely be traced? Drive with Uber and run Taxi services out of business.Yes, Taxis are fucking overpriced, but at least they do their job correctly with professional training and shit. They are there when you are fucked and you shouldn't need to use their services all the time, anyway. ", " >>7602>a hashtag gets a spot>a literal memePepe for person of the year 2016 ", " >>7607What the hell is Uber? No i'm not joking ", " >>7602Ahhh yes, we all know how beloved the Furher was about 80 years ago and now history has come to repeat itsself, der furher Merkel truly deserves this,not everyone can destroy a trust and sense of companionship that has taken so long to rebuild after the last world war,but hey, you can always count on a germanic nation to destroy europe one way or another,long live the reich and merkel the kike "]}, "8013": {"op": {"timestamp": 1449788400, "title": "Moscow’s Connection to the Islamic State", "comment": " An investigative report published in July by Novaya Gazeta reporter Elena Milashina documented that, beginning in 2011, the FSB had established “safe routes” for North Caucasian militants to travel to Syria, where it was providing the necessary documents for travel. The report claimed that FSB officers directly aided potential jihadis who wanted to leave Russia to fight in the Middle East. While the FSB has not admitted aiding potential extremists, FSB deputy director Eugene Sysoev recently heralded Russia’s success in “[achieving] a sustained reduction in terrorist activity” inside Russia. He cited a reduction in “crimes of a terrorist nature” over the previous year, and claimed a ten-fold reduction in terrorist activity in the North Caucasus over the past five years. In the same remarks, made in November, Sysoev admitted that at least 20 percent of foreign fighters in the Islamic State are from Russia and other post-Soviet countries, an assessment somewhat similar to estimates from private security consulting groups. The interview with the purported FSB defector advanced the idea that Russia may be exporting its extremists, detailing how Russian security services have recruited Muslims to infiltrate extremist groups in Europe and materially supported their advancement within these organizations. When asked if Russian agents could be involved in the recent terrorist attacks in Paris, Yevgeniy said there was “complicity in acts of terrorism.” He continued, “And the complicity could be direct or indirect. By analyzing their connections, one, of course, will be able to see the ties leading to Russia. Primarily Russia could benefit from this, and the Russian security services had all the possibilities to organize this.” http://freebeacon.com/national-security/moscows-connection-to-the-islamic-state/ "}, "replies": [" The Islamic State has claimed responsibility for the Paris attacks. On the Russian periphery, it is widely believed that Russia has used the Islamic State as an opportunity to get rid of domestic jihadis. “In spring 2014, local information networks provided credible information that individuals affiliated with Russian security forces were recruiting potential jihadists in Pankisi and in the Northern Caucasus to travel to Syria,” says Giga Bokeria, a former Georgian national security adviser. “They were promising financing for trips, and assistance acquiring weapons.” ", " Pankisi is a remote, mountainous Georgian region bordering Russia with a local population of Georgian Muslims, known as Kists. Omar al-Shishani, one of the Islamic State’s top commanders, is from Pankisi. Oleksandr Danylyuk, formerly chief of staff to Ukraine’s Minister of Defense and now chairman of Ukraine’s Center for Defense Reforms, believes there is a strong connection between the Islamic State and the Russian government. “ISIS is definitely a product of the Russian special services. Only the blind cannot see it. A significant part of the terrorists are citizens of the Russian Federation,” Danylyuk said, using a common acronym for the Islamic State. “The ISIS military command is composed of former Saddam Hussein generals, who studied in the Soviet Union and worked closely with the KGB,” says Danylyuk. “The connection between the Russian-speaking jihadis and the Russian-trained ex-Baathist Sunni military officers is what formed the core of what we now think of as ISIS,” said Estonian expert Eerik-Niiles Kross. Kross, now a member of Estonian parliament, is a former director of the Estonian intelligence services, and served under the Coalition Provisional Authority in Iraq in 2003-2004, working to rebuild the Iraqi military intelligence organization. ", " “Based on Russia’s history of infiltrating and manipulating terrorist organizations and extremist groups, it’s not so far-fetched to believe there is an operational relationship — at some level — between Russian security services and elements of ISIS,” he said. The conflict in Syria has allowed Russia to rebuild relationships with European countries that were damaged by the Russian intervention in Ukraine. While the White House remains publicly cautious about collaborating with Russia against the Islamic State because of Russia’s support for Bashar al-Assad, the possibility of a Russian connection to terrorist attacks in Western countries would add a new element to Russia’s relationship to the West. In Washington, however, Russia’s relationship with Islamic radicals has not been seriously evaluated, according to several congressional sources. “The issue of Russia’s relationship with ISIS has been raised in closed door briefings on the Hill,” said one senior staffer with knowledge of recent intelligence briefings to lawmakers. “It’s unclear how much the administration has looked into this issue.” But people in states close to Russia say American and other Western officials have been reluctant to accept information on Russian involvement in recruitment for extremist groups despite the use of explicitly anti-American rhetoric as incitement for enlistment. “More than 80 percent of ISIS’s weapons are Russian-made,” offers Danylyuk. “In Syria and Iraq we are witnessing the same form of hidden aggression as in Ukraine.” “The problem is,” he says, “if Russia is recruiting for ISIS, and ISIS is attacking European and American targets — will anyone be willing to say that Russia bears responsibility in these attacks?”http://freebeacon.com/national-security/moscows-connection-to-the-islamic-state/ ", " https://www.youtube.com/watch?v=-N3Uk8Y5km8 ", " I'd like to see this evaluated by other countries before accepting it, but it's not particularly hard to believe. It would be a pretty simple and convenient way for Russia to increasingly quell any Chechen resistance, considering most of those rebels are jihadists. And this could then mean they could attack them in Syria without nearly as much bad press as they normally get. And we do know that Chechens have been joining ISIS regardless. ", " >>8013>The report claimed that FSB officers directly aided potential jihadis who wanted to leave Russia to fight in the Middle East.Meanwhile, Western Europe and Obama are welcoming potential jihadis with open arms...Putin is a crooked ex-KBG mobster without a doubt, but at least he isn't fucking over his _own_ people. ", " >>8056The economic sanctions placed on his country due to his decisions are more than likely hurting his people. He does not give a fuck. ", " Wouldnt surprise me at all if russians had some spies to infiltrate ISIS. ", " >>8056The weird thing about Putin is that he is starting to behave much like Stalin both in speech and in action. A lot of domestic assassinations with no suspects found. A lot of aggressive speeches, expansionism and risky moves. Plastic surgery? Weird moments where he is mysteriously gone. All of this does not bode well for Russia and it's neighbors. All of the airspace infringements, the fight he is picking with turkey, his involvement with the Syrian government...I know he has great disdain for the Muslim community. So I would not see him beyond expunging them from his territory. But Putin always want's to strike aggressive and hard against his perceived enemies. If he want's the extremists gone, he's not talking about secretly supplying ISIS with troops. He probably will try to kill them all in the end. ", " Pyccкий в тpeдe, Хyeю c вac, чтo зa бpeд вы нeceтe. Гo к нaм нa двaч. У нac вeceлo.И кapтинки ecть. LOL ", " interesting article "]}, "6326": {"op": {"timestamp": 1449270000, "title": "Say hello to the newest member of the NATO club!", "comment": " http://www.nytimes.com/2015/12/04/opinion/russias-fury-over-montenegro-and-nato.html?_r=0At least it's bigger than Crimea... "}, "replies": [" >>6326i dont want them ", " >>6326>implyingit's not going to happen ", " C'mon Russia another fake invasion won't hurt. ", " >>6326No problem here, I would like to visit Kotor and sights of the country more easily. ", " >>6342Can you read, kid? It has already happened. The entire European Mediterranean coastline is NATO. ", " >>6429No it hasn't. Quit being a retard ", " >>6326I still think it's hilarious how Russia can get away with dictating to other states which military alliance they are allowed to join and which they aren't. ", " >population 621,383That would make it the second least populous US state, between Vermont and WyomingWhy do they even need to be their own country in the first place? ", " >>6432Why are you so insistent over something that you know isn't true? Why do you believe it wouldn't have happened?My friend, you're a mystery. Are you in denial? Could you believe that you're trolling? Could you believe that NATO is a conspiracy, or perhaps, the conspiracy is Montenegro...Don't tell me. I want to remember you as incomplete. I think it's a perfect, poetic commentary of Russia. ", " >>6372It's not like the game at all.I don't recommend it. ", " >>6326>Budget: 37 million euros (2015)>Active Personnel: 1,950 (2015)>Reserve Personnel: 400>planes and helicopters from the soviet union era>1 transport ship, 1 frigate, and 1 fast attack craftAnd a snowblower is listed on their wikipedia page just to make it look longer.Jesus christ. I love new allies, but this is just embarrassing. My fucking city's law enforcement has more man power. ", " What's even the point of NATO expanding anymore?What's even the point of NATO still existing? ", " >>6459I dunno, what're you gonna do, not be friends with small countries? The more the merrier. You wanna ignore Montenegro too small, you're gonna be cutting out most of Eastern Europe. ", " >>6459>My fucking city's law enforcement has more man power.Well ya, police>soldiers. That's not really saying much. ", " >>6463>What's even the point of NATO expanding anymore?Russia is soviet union 2.0They're expanding as well.>What's even the point of NATO still existing?It is supposed to keep countries safe. A small shit country like Montenegro wouldn't even survive the artillery fire before Russia even invades.But now they're allied with NATO, and thus they have a potential army of millions to draw upon. Along with weapons, vehicles, and training.NATO is seen as incompetent though because they don't want to get into a full scale war with Russia. Though, WWIII would not be great, so you can't fault them much.>>6465Not saying lets ignore them. I just said I love new allies. It's just embarrassing. Are they at least increasing their army size? adding more funds to the military?>>6468> police>soldiers.I never said that, I just said they have more manpower. Though, I heard SWAT gets trained pretty much the same as in the military. So, it won't be everyone, but a portion, still larger than their reserve would likely be trained well enough to serve in the army. ", " >>6474>embbarassingIt's a tiny country, so it has a tiny military. Saying their armed forces are embbarrasing is the same as saying the existence of montenegro is embarassing. What dya expect from a country with 600k pop? ", " >>6444It seems like a good place to find lightsaber crystals and jedi ruins. ", " >>6433>I still think it's hilarious how the US can get away with dictating to other states which military alliance they are allowed to join and which they aren't. ", " >>6501this. also replace US with... NATO and EU. same shit.reminder: neocolonialism is still alive and well, and fucking NATO hypocrites keep playing the victim cardwhy doesn't russia bomb you all and you bomb them back so the whole global north is finally wiped... ", " >Nigger mountain You literally cant even make this shit up. ", " >>6536Because Russia's military power is heavily overplayed by everybody involved.https://en.wikipedia.org/wiki/List_of_countries_by_military_expendituresIf you look at the data you can tell that not only is Russia's military a joke compared the US American military, but that even in Europe Russia is more than matched. You can ignore Germany because nobody cares about soldiers whose guns don't work, and you still get a much bigger number for the allies in west Europe than what Russia has.I think one of the main reason people pretend Russia is so strong is so that the NATO countries have an excuse for their own martial expenses. ", " >>6474>But now they're allied with NATO, and thus they have a potential army of millions to draw upon. Along with weapons, vehicles, and trainingWould you have YOUR country start a war for Montenegro? ", " >>6566Fuck yes. If Russia invades montenegro I expect war. /Brit ", " >>6568You do realize you'll probably be drafted? And that the war might turn nuclear? ", " >>6572>you'll probably be drafted?You hugely overestimate Russia. Or underestimate European NATO. Or both.Also, I'm too old :p>And that the war might turn nuclear?That's a worrying possibility, but there's no way around it. We can't just let Russia do anything they like because they have nukes. If we ignore them invading a nato nation we may as well just ceed kent to 'em right now. ", " >You hugely overestimate Russia. Or underestimate European NATO. Or both.Or perhaps you hugely underestimate just what \"total war\" means. Are you seriously suggesting that it's possible for NATO to defeat Russia without a general draft (at least in a hypothetical non-nuclear war)?>We can't just let Russia do anything they like because they have nukesBut that's the thing - would you allow worldwide thermonuclear war over an irrelevant balkan shithole like Montenegro? We already made this mistake in WW1, if we repeat it now it might literally result in an apocalypse.NATO should be a strong alliance between like-minded great powers and key countries. It should NOT be american's power projection blob which also happens to have a defensive clause (as it is now). A border skirmish in the baltics should not be equal to a bombardment of a major USA city, and should not lead to the same result of total annihilation.The sad truth is that countries like Montenegro or the blatic states have no place in a rigid defensive alliance as broad as NATO. Armed provocations and even invasion should be dealt with, obviously, but not through something as dangerous and shortsighted as Article 5. This goes double for the baltic states, which have always been Russia's backyard.More to the point - NATO has no place in the 21st century, at least not in its current form. After the cold war ended (or paused, depending on your viewpoint) it should have been disbanded. American needs to find some other way to project power (perhaps defensive agreements with individual countries?), one which doesn't put the entire world at risk over a bunch of tiny irrelevant states on the periphery of the USA's sphere of influence. ", " >>6558You're wasting your time bro, no one wants to here about the reality, they only believe the propaganda ", " >>6578>Are you seriously suggesting that it's possible for NATO to defeat Russia without a general draftManpower isn't an issue for NATO like it is for Russia and their capibilities arent any more than where the US was almost 30 years ago. Stop pretending to know something, Russia would be trashed by Turkey alone. Also, the second they go nuclear all of the FSU joins and is drafted into the NATO cause. Putin can't even threaten nukes for fear of being boxed out his Syria spoils. Besides, the color revolution will happen long before Russian goys are forced into the Russian military again. ", " >>6578>NATO has no place in the 21st century, at least not in its current form.I think you mean Putin's Russia. ", " >>6721Lol at turkey can trash Russia. You really dumb. ", " >>6728Turkish manpower would be the only manpower necessary to defeat Russia. The rest of NATO can have the balance of its guns and all its butter.Putin's Russia is the shadow of something that was already pathetic. ", " >>6501>implying most nations don't activley want to be a part of NATOSeriously, ask the any former country what life was like post 1992. I'm sure no Pole or Czech would want to go back to that ", " >a nato member keeps fucking up >badly too >do what's on the agenda today >let's invite literally who to our club! ", " >>6732Russians fight for their country. Others for money. If you talking about all in war. Russia can go long way as them people never give up. I bet no turks will fight for their president. But Putin got huge respect. Plus modern weaponry can render lots of man power useless. ", " >>6854Russians aren't patriotic, they're a loose confederation of envy, amorality, and opportunism. They're not going to die for Putin. They live shitter lives than Africans and the trend is down hill. The Putin brand is going sour without another vector of humiliation, and economic collapse is right around the corner. Turkish on the otherhand,1. Are ready to do anything to get closer to Europe2. Actually work and have an economy that would benefit from war keynesianism3. Are apparently spoiling for a fight4. Have allies5. Have access to tech and expertise that eclipses that of Russia ", " >>6859>1. Are ready to do anything to get closer to EuropeThey voted for Erdogan so No.>2. Actually work and have an economy that would benefit from war keynesianismWar is expensive. Americans only think that war is good for one's economy because of the great wars where they were barely involved as combatants. ", " >>6859You are retarded, stop talking now. ", " >>6931/news/ seems to have 50 or less active posters. Chances are, whoever you are disagreeing with in this thread, you are also arguing with him in a different thread about the same topic. ", " >>6859Patriotism is not for president but for country. How many Russians do you know to speak about patriotism? I know a lot. And if the time comes they definitely choose to die for Russia and not for any other country. Economic collapse won't happens in Russia. Russia survived and always get up without anyone's help. Which can't be said about other countries. Russia can produce most of the stuff itself. They only but because some cunts were getting a slack from the deal. Ams what \"tech\" are you talking about? Russia for top notch military tech. And I bet they can get all the tech from China cos they manufacture it for the west. ", " >>7134>Russian patriotismI would call you a good goy, but you're more than likely being paid.http://www.gutenberg.us/articles/web_brigades>Russia stronk1. Russia is not gaining ground in Syria and is losing ground in Ukraine; in a real fight they would quickly implode.2. Russia can't afford to buy poor Chinese knock-offs of exclusive NATO and US tech, so they really have no hope of anything approaching parity. ", " >>11184>http://www.gutenberg.us/articles/web_brigadesI'm pretty sure every country has a team of those. Israel is also confirmed to employ a team of web activists. "]}, "7944": {"op": {"timestamp": 1449702000, "title": "Muslim convert now faces jail for threatening to bomb MP's house", "comment": " http://www.dailymail.co.uk/news/article-3349803/Muslim-convert-faces-jail-threatening-bomb-MP-s-house.htmlA Muslim convert who protested outside Parliament with a sign saying 'I am Muslim, do you trust me enough for a hug?' is facing jail for threatening to bomb an MP's house.Craig Wallace used the sign as Stop The War protesters came to Westminster for the vote on military action in Syria last week.It stated: 'I am Muslim, I am labelled a terrorist, I trust you, do you trust me enough for a hug?'But the 23-year-old, of Willesden Green, north London, is now facing a possible prison sentence after he threatened Tory MP Charlotte Leslie online following the vote.Wallace, who calls himself Muhammad Mujahid Islam online, wrote on Facebook: 'I'm going to smash her windows then drop a bomb on her house while she's tucked up in bed. You dirty f****** pig-s******* s***.'On December 3, the day after MPs voted to authorise the air strikes, he wrote: 'I'm going to find her and show her what it's like to murder innocents. You dirty pig-f****** w****.'He also described shadow foreign secretary Hilary Benn as a 'war criminal' and a 'terrorist' the day after the Commons vote to bomb Syria.His defence lawyer Abu Sayeed said Wallace had posted the messages after he had been out protesting against the Syrian bombing vote for 'two or three days and had very little sleep and had not taken his medication.' "}, "replies": [" Wallace has a string of convictions for violent offences including possession of a knife.He converted to Islam while in prison serving a sentence of almost five years for attempted robberyThree weeks after he was released he posted the messages on a thread of comments on the UK Truth Movement Facebook page.Wallace today pleaded guilty to sending threatening communications at Hendon Magistrates' Court.Wearing a white traditional Islamic dress and a grey jumper slung over his shoulders, he spoke only to confirm his name and address before entering a guilty plea. He was remanded in custody and will be sentenced on December 30.The court heard the messages came to light after Ms Leslie's father saw the comments online and reported them to police.Wallace claimed he was 'venting his anger' and had not had any sleep because he had been 'protesting for two or three days'.District Judge Mark Jabbitt said: 'What's absolutely clear is that your language and expressions about this MP Ms Leslie, who you have no knowledge of, went beyond any sort of legitimate comment or protest on an extremely serious issue.'What you did was personalised it and used really the most vile, insulting and threatening language imaginable on a forum.' ", " He ordered a full risk assessment report on Wallace and expressed concern that he was not being formally supervised after his release from prison.Abu Sayeed, defending, said Wallace has mental health issues and had not been taking his anti-psychotic medication.'He has co-operated fully with the police and expressed remorse and regret,' he added. 'He made the comments to vent his anger.'Mr Wallace is a Muslim convert, he converted while serving his last sentence. He feels very passionately about the bombing in Syria and the vote recently taken in Parliament.'He had been out with other protesters and was protesting for two or three days and not had much sleep and hadn't taken his medication.'Wallace has never met Ms Leslie and thought the page was a 'closed group', Mr Sayeed said.'In the current climate people would have been fearful of his comments,' he added.Wallace, whose mother died when he was young and who claims his father abused him as a child, had attended an anti-war rally outside Parliament on the day of the Syria vote and was pictured carrying a giant white poppy.Shortly before he sent the messages he also posed for a series of pictures with strangers carrying a placard that read: 'I am Muslim, I am labelled a terrorist, I trust you, do you trust me enough for a hug?'. ", " The day after the vote Wallace sent Mr Benn an email, which he then posted on his Facebook page.It said: 'I hope to God that you will have nightmares when you hear that kids woman and men have been murdered by your govt.' The court heard Wallace had been in and out of custody since he was 13 after being expelled from school following the death of his mother when he was eight. The judge warned Wallace the maximum sentence for the offence was six months.Wallace, of Teignmouth Road, Willesden Green was remanded into custody, while risk assessments reports were carried out.He is next appear at Willesden Magistrates court for sentencing on December 30.A number of other MPs, many of them in the Labour Party, have complained to police that they had received death threats after voting in favour of airstrikes on Islamic State in Syria.Neil Coyle, the MP for Bermondsey and Old Southwark, said police had stationed extra officers outside his surgery after he received an apparent death threat on social media, while Labour Rochdale MP Simon Danczuk has spoken out about receiving an apparent death threat on Facebook after he voted in favour of the military action. ", " >possessing a knife is a crimeCan't make this up. Props for not coddling him for being Muslim, though. ", " >>7945>>7970>Get A Life, Bin That Knife ", " >>7944Islam: not even once ", " he just hates torys, and hilary benn may as well be a tory.dirty f****** pig-s******* s***.' lololol "]}, "7591": {"op": {"timestamp": 1449615600, "title": "Man drives 200 miles to murder a 6 year old boy", "comment": " Man drove 200 miles from KY to IN and picked a random house, broke in, stabbed a 6 year old boy to death and attacked his siblings.http://wgntv.com/2015/12/09/indianapolis-nurse-drives-to-kentucky-to-kill-6-year-old-boy-police/ "}, "replies": [" He was on his way to buy some milk ", " He dindu nuffin'! hes a good boy, just oppressed! ", " >>>/7000/Search the catalog before making news threads pls. ", " >>7722>>7000 ", " >>7716This statement should be word filtered and a bannable offense ", " >>7643*yawn* ", " >>7768>>>/reddit/ ", " >>7768Well that's just like your opinion man ", " >>7768Well since he pled not guilty maybe he thinks 'He dindu nuffin'! \" ", " >>7591From IN to KY not KY to IN. Makes me so upset shit like this happens one County over and we can't really do anything about it ", " >>8776>we can't really do anything about itYou can vote for Romney. ", " >>7768lol things I don't like should be banned "]}, "8720": {"op": {"timestamp": 1450047600, "title": "Company gives $100,000 Christmas bonus to every employee.", "comment": " http://www.foxnews.com/us/2015/12/12/hilcorp-energy-gives-100000-bonus-to-all-1381-employees/?ICID=ref_4chanHilcorp Energy, one of the largest privately held oil and natural gas exploration companies in the United States announced that it would give all 1,381 employees a year-end bonus of $100,000 after what the company called a positive year in growth. "}, "replies": [" I don't understand your choice of image. ", " >>8720Annnnnnnnd... ", " It's shit like this that pushes people to socialism and communism. ", " >>8786What, money?Or anonymous posts on image boards? ", " >>8787Hearing about an oil company which doles out hundreds of thousands of dollars like it's nothing ", " >>8794Explain to me how that's a problem that would make you a socialist. ", " >>8796I'm not saying turning socialist is a legitimate response (I'm not denying it either), I'm just pointing out the fact that news articles like these point out (or exaggerate) the inequality in our society. ", " >>8800>point out (or exaggerate) the inequality in our society.An article about an employer allowing his employees to partake of the profits they helped him earn points out or even exaggerates the inequality in our society?Sure, he's a billionaire and his employees are not rich. But that's beside the point, isn't it? If you were ignorant to the existence of billionaires prior to this article then there is no helping you. ", " >>880399.9% of people don't receive 100,000$ bonuses. ", " >>8817So?99.9% of all people aren't billionaires either. ", " >>8822They don't get reminders of it in the news ", " >>8822They don't get reminders of it in the news ", " >>8826So when people are talking about millionaires that goes completely over their heads.When people mention guys earning lots of money they are essentially deaf.But when somebody says something about somebody who isn't a millionaire getting a big bonus, then that's suddenly enough to remind them of everything that is wrong with the world? ", " >>8829uh, yeahlet me rephrase itYou DO get reminders of it on the news, which is what pushes people to believe society's is too unequal. ", " >>8834Shut the fuck up ", " >>8720>>8834this thread is bad and you should feel bad ", " 8888 get when ", " Small loan of 100,000$ ", " >Big oil pretending they're not fucked ", " >>8786I disagree, though I am a socialist. I feel this is the lone example of capitalism \"working...\" and think it would embolden the arguments of conservatives (in their eyes) Though the guy is a freakin billionaire so 100M is really only 1/10th of a billion ect. ", " Cool, good on them. Lots more corps could give out big bonuses and still profit plenty but they don't because they are evil. ", " >>8794>It's only ok when the government does it ", " >>8877>becuz dey r evil!11 ", " >>8786>>8794>>8817Are you saying people are actually resentful of Hilbert and its employees for this? Because that certainly wasn't my first response. My first thought was \"how hard would it be to switch careers just so I can work for this company?\" ", " >>8927*Hilcorp ", " >>8888 ", " Wow, so nice. I wish more execs were this generous. This gives those employees a chance to invest that extra money and join the ranks of the wealthy. ", " >>8887Have I implied it's okay when the government does it?>>8907>what is sarcasm?>>8927good for you ", " >>9008Filtered. ", " >>8981>>8742Have you never heard of Defcon? In short terms, Defcon 5 means peace, and Defcon 1 is absolute chaos. ", " >>9042What does that have to do with the shape of the world? ", " >>8863This ", " >http://www.foxnews.com/us/2015/12/12/hilcorp-energy-gives-100000-bonus-to-all-1381-employees/?ICID=ref_4chan>?CID=ref_4chan>ref_4chanThe fuck is this shit? ", " >>9042Have you ever heard of bonuses? When your employer gives you one of those, that doesn't mean it's the end of the world. ", " >>9005>implying that won't blow it on hookers and blackjackStill, a really nice gesture. What the fuck is a billionaire even going to use all that money for besides influencing politicians to protect his money. ", " >>9081It's his affiliate ID, so Fox pays him a couple cents every time one of us clicks on his link. ", " Profit-share companies are cool, I worked for one for a while where every year 10% of company profit was equally divided between every employee which usually was about a thousand dollars. ", " >>8786Lol Wut, what do you think all those people are gonna do with that moneyFucking spend it and buy dank shitThat's the definition of capitalism ", " >>9142So if all of /news/ clicks his link, what does he get?A dollar? ", " >>9236If each newschan... then... maybe 100 dolla ", " >>8720>?ICID=ref_4chanwhy is there this in the URL? ", " >>9320See >>9142 ", " >>9233Yeah, and capitalism is shit.Germany has a equal or superior quality of life for most people than the US despite its socialist-ness.If Germany was the same size of the US, its overall financials would be far superior. (relatively speaking, the world would be vastly different with such a huge socialist state)Capitalism and \"freedums\" are just too easy to abuse. Regulation is NEEDED. ", " >>9384>Regulation is NEEDEDRegulation by who? Couldn't the people in charge of regulation abuse their position just as much, if not more since they practically have total control? ", " >>9042You completely misunderstood.Fucking completely man.Seriously, right over your head ", " tbh a good chunk of this bonus is being directly donated to the state and federal government in the form of taxes ", " >>8794>appreciating your workers is a bad thing ", " >>9384And Communism isn't? ", " 10000? ", " This is the way businesses should operate. The goal should be to maximize the happiness of its employees. Making money should only be a means to that end. "]}, "9201": {"op": {"timestamp": 1450220400, "title": "Tonight's Debate", "comment": " Okay, here some people debating about how to run the nation. They seem pretty serious about things so it's good to give them a listen, right/http://abcnews.go.com/Politics/candidates-tonights-gop-debate-gain-lose/story?id=35777823http://www.playlivenew.com/2010/08/watch-cnn-news-live/ "}, "replies": [" And the shit officially begins. ", " Yes! It's hosted by Wolf Blitzer... ", " Damn buzzer. ", " MOMENT OF SILENCE ", " Why does Donald Trump want to block Internet venues we could be MONITORING?!? ", " Trumpxico ", " >The city of Yeb ", " The debate sucked compared to the last CNN debate in terms of format. The topic was more fascinating this time around, and the candidates largely demonstrated a better grasp of Syria and Terrorism, but the thing devolved into a uncomfortable shouting match on multiple occasions, the time went by slowly, and only the crowd succeeded in stumping Trump.Rand Paul (thought I'm not a fan) did well.Fiorinia and Bush seemed (to me) to do badly.Everyone else seemed meh.Not my favorite debate. ", " >>9234> only the crowd succeeded in stumping TrumpYes, because it takes multiple people to stump 1 Trump...I'd like to think that Trump's point was proven about Cruz being insane with this debate though... ", " >>9234Fiorina and Bush always do bad. Why is there another Bush trying to become president already?And Fiorina never says anything interesting, she just constantly talks about her business. ", " >>9211Lmao way to introduce yourself guy xD lets have a random 6 sec of silence~ ", " >>9240> And Fiorina never says anything interesting\"Secret Sauce\" ", " >>9234Trump stumped the crowd tbh ", " >>9201>the nation>[actually talking about the USA]Dear US citizens,Please stop presuming that the rest of this site lives in the same nation as you, 4chan is an *international* site accessible from around the world.Thanks, a concerned anon. ", " >>9359lmao like what australia? but that's so far away from here ", " >>9359Dear rest of the world,Nobody gives a fuck about you and US politics are also your politics until we feel like removing our cock from your collective ass. ", " >>9235>Trump's point was proven about Cruz being insaneI don't know about insane, but backing down from his criticism made him seem like a coward. ", " Rand Paul was the only one who made any logical sense on that stage.Ted Cruz made some good comments though. Especially that one quote allegedly from FDR's grandpa. ", " >>9234I liked how Marco Rubio just blatantly said that the US is already a part of the Sunni/Shia war and that is the only reason why Saudi Arabia is an ally and Iran is an enemy. ", " I watched it, pathetic.>ISIS>fear>more NSA>ISISWe created that fucking mess and the answer is more if the same foreign policy?There's other things going on in this country.Why is CNN defining the narrative?Doesn't that make them the real power? ", " >>9434I wish Rand had charisma. ", " >>9462Spoilers: 90% of our news media is owned by 6 companies. They set the narrative that benefits their bottom line and investments, and endless war is good for both. ", " >>9465I think his cold made his voice seem less... Well you know... ", " >>9359are you actually so retarded that you're assuming he means anything other than the US in a fucking thread about the US?This is an american website fuckfence love it or get out ", " >>9462It was a very hawkish debate... ", " >>9465Don't we all. ", " >>9213He wants to do both. He wants to block off some sites for America while having it monitored at the same time. ", " Anybody else notice that Rand Paul had like 5 fans way in the back of the audience that went crazy every time he spoke? Best part of the debate ", " >Trumpflawless victory>Ted cruzget over here>RubioRound three>JebFatality>KasichFinish him>CarsonRing out "]}, "9423": {"op": {"timestamp": 1450220400, "title": "MOST BRUTAL PLANE CRASHES *graphic content*", "comment": " https://www.youtube.com/watch?v=dE_OC-aDV8Q "}, "replies": []}, "9169": {"op": {"timestamp": 1450134000, "title": "This is the best board ever - have a Ron Paul ASCII", "comment": " ██████████████████████████████████████████████████ ████ █░░░░░░░░░░░░░░░░░░░░░████████████░░░░░░░░░░░░░░░░ ░░░█ █░░░░░░░░░░░░░░░░░░░████▒▒▒▒▒▒▒▓▓████░░░░░░░░░░░░░ ░░░█ █░░░░░░░░░░░░░░░░░██▓▓▓▒▒▒▓▓▓▓▓▓▓▓▓█▓██░░░░░░░░░░░ ░░░█ █░░░░░░░░░░░░░░░█▒▒▒▒▒▒██████▓▓▓███▓█▒▓█░░░░░░░░░░ ░░░█ █░░░░░░░░░░░░░░█▒▒▓▓██▒░░░░░░▒▒▒▓▓▓▓█▓▒▓█░░░░░░░░░ ░░░█ █░░░░░░░░░░░░█▓▓█▒▒░░░░▒▒▒▒▒▒░░░▒▒▓▓▓█▓▒▓█░░░░░░░░ ░░░█ █░░░░░░░░░░░█▓▓█▒▒░░▒▒▒▒▒▒▒▒▒▒▒▒░░▒▓▓█▓▒▓▓█░░░░░░░ ░░░█ █░░░░░░░░░░░█▒▓▓▒░▒▒▒▓▓▓▓░▒▓▓▓▓▒▒▒░▒▓█▓▓▒▓█░░░░░░░ ░░░█ █░░░░░░░░░░░█▒▓▓░░░░░▒▒▒▒▓▓▒▒▒▒░░░░▒▓█▓▓▓▓█░░░░░░░ ░░░█ █░░░░░░░░░░░█▒▓▓░░░░░░░▒▒▒▒▒▒▒░░░░░▒▓▓█▓▓█░░░░░░░░ ░░░█ █░░░░░░░░░░░▓█▓▓░░░████░░▒▒░█████░░▒▓▓███▒░░░░░░░░ ░░░█ █░░░░░░░░░░▓▒▓█▒▒░█▒▒▒▒█░░░▓▓▓▓▓▓██▒▓▓█▓██░░░░░░░░ ░░░█ █░░░░░░░░░░▓▒▒▓▒▒▒▒▒██░▒█░▓▓░██░▒▒▒▓▓▓▓▓██░░░░░░░░ ░░░█ █░░░░░░░░░░░▓▒▓▒▒▒░▒▒░░▒▓▒▒▒░░▒▒▒░▒▒▓▓▓██▓░░░░░░░░ ░░░█ █░░░░░░░░░░░▓▒▓▓▒▒░░░░▒▓▓▒▒▒▒▒░░░░░▒▒▓▓▓█░░░░░░░░░ ░░░█ █░░░░░░░░░░░░▓▒█▓▒░░▓█▓▓▓▓▓▓▓█▓▓░░▒▒▓▓██░░░░░░░░░░ ░░░█ █░░░░░░░░░░░░░░█▓▒░░▒▓███████▓▓░░▒▒▒▓▓█░░░░░░░░░░░ ░░░█ █░░░░░░░░░░░░░░█▓▒░▓▒▒▒▒▒▒▒▒▒▒▒▓░▓▓▓▓█░░░░░░░░░░░░ ░░░█ █░░░░░░░░░░░░░░░█▓▒▒▓████▓████▓▒▓▓█▓██░░░░░░░░░░░░ ░░░█ █░░░░░░░░░░░░░░░░▓▓▓▒░▓▓▓▓▓▓▓░▒▓▓█▓█▓██░░░░░░░░░░░ ░░░█ █░░░░░░░░░░░░░░░░░█▓▒▒░░░░░░▒▒▒▓█▓█▓▒▓██░░░░░░░░░░ ░░░█ █░░░░░░░░░░░░░░░░░░█▓▒▒▒▒▒▒▒▒▒▓▓▓█▓▒▓▓███░░░░░░░░░ ░░░█ █░░░░░░░░░░░░░░░░██▓█▒▒▒▓▓▓▓▓▓▓█▓▓▒▓▓▓██████░░░░░░ ░░░█ █░░░░░░░░░░░░░░████░▓▓███████▓▓▓▒░░▓▓███████████░░ ░░░█ █░░░░░░░░░░████████░░░░▓▓▓▓▒▓▓▒░░░░▓██████████████ █░░█ █░░░░░░░███████████░░░░░▓▓▒▒▒▓▓░░░▓▓██████████████ ████ █░░░░░██████████████░░░▒▓▒▓▒▒▓▓░░▓████████████████ ████ ██████████████████████████████████████████████████ ████http://townhall.com/columnists/ronpaul/2015/12/14/if-you-want-security-pursue-liberty-n2093537 "}, "replies": [" >this is the best board ever >let me ruin it with irrelevant shit You and janitors unwillingness to enforce shit is the reason why there are only a handful of good boards left on this site Thanks for that ", " NOTHING LEFT "]}, "8879": {"op": {"timestamp": 1450134000, "title": "Tallinn to Buy Drones for Russian-Estonian Border Protection", "comment": " >TALLINN (Sputnik) — The Estonian Interior Ministry has allocated some 500,000 euros ($547,000) to buy unmanned aerial vehicles (UAV) to protect the country's border with Russia, the Estonian interior minister said Monday.>\"There are areas on our external border, where a foot patrol can not reach. That's why unmanned aerial vehicles, or drones should be used to deal with border incidents faster and more efficiently\", Hanno Pevkur said, as quoted by the Estonian daily Postimees.He added that UAVs would help to detect violations more thoroughly, because they would help to provide a better overview of the area when compared to border officers on foot.>According to the Estonian Interior Ministry, drones could be used to collect evidences of criminal activity, such as illegal border crossings, smuggling and human trafficking.>In August, Estonia announced plans to construct a 108-kilometer-long (67-mile) wall on the land section of its eastern border, to prevent illegal crossings.http://sputniknews.com/europe/20151214/1031727432/uav-border-purchase-estonia.html#ixzz3uMPbwAyH. "}, "replies": [" >>8879I can't imagine the drone wars coming in the next few decades. I wonder if there are any specific Russian counter-drone fighter drones yet. "]}, "8241": {"op": {"timestamp": 1449874800, "title": "A fight breaks out on the floor of the Ukrainian parliament", "comment": " On Friday, December 11, a fight broke out on the floor of the Ukrainian parliament. Oleg Barna, a deputy in President Poroshenko's bloc approached the speaker's podium, where Prime Minister Arseniy Yatsenyuk was delivering an address. Handing him a bouquet of roses, Barna started shoving Yatsenyuk, then tried to carry him away, even grabbing him between the legs and lifting him into the air. Immediately, several other deputies intervened and a mass brawl began. Neither Yatsenyuk nor his roses took part.Barna was responding to Yatsenyuk telling members of Poroshenko's bloc that they are welcome to direct questions about Ukraine's energy sector to \"their own minister,\" Minister of Energy and Coal Industry Volodymyr Demchyshyn.Commenting later on the incident, Yatsenyuk said, \"Everything is fine, but there are a lot of morons here.\" The head of the Poroshenko bloc has apologized for Barna's behavior and excluded him from the faction. Barna's awkward assault on Ukraine's prime minister has already inspired a myriad of edited photos online, many exploiting the homoeroticism of one man grabbing another in so nether a region.https://meduza.io/en/lion/2015/12/11/democracy-by-the-balls-a-fight-breaks-out-on-the-floor-of-the-ukrainian-parliamenthttps://www.youtube.com/watch?v=4gDF7ib66yY "}, "replies": [" Russian politics are cool! ", " >give roses>acquire husbando ", " >>8241A nuuuuu cheeki breeki iv danka "]}, "7739": {"op": {"timestamp": 1449702000, "title": "Mitt Romney Could Stop Donald Trump.", "comment": " But when will he make his move?http://www.huffingtonpost.com/entry/mitt-romney-could-stop-donald-trump-seriously_56689e49e4b080eddf56dc2d "}, "replies": [" Didn't Trump already get disqualified? ", " >>7747\"Disqualified,\" yes, actually disqualified no.. If that actually happened, it would be major news instead of Trump's anti-Muslim ideas that are getting him more interest votes. ", " How in the fuck havent you faggots hit >>7777 yet? ", " >>7751> interest votesThe American system you've got there sure is crazy. ", " Typical huffpost clickbait. Romney isn't going to do anything and they know it. ", " >>7761Yeah, he's going to be Donald Trump's big failure-y punching bag... ", " 35 - 0 : THE MOST DANGEROUS LEAD ", " >>7739pew pew  ", " quads please ", " the next post in this thread will be dubs ", " Hey guys. Trump and Romney bullshit is great and all, but check my quads. ", " >>7777Wowee ", " >>7778WEWLADEWLAD ", " >>7777checked ", " /news/ is [s4s2] ", " >>7777All I ever wanted... all I ever needed...dubs ", " >>7777We'll going to have to wait for 77777 now... You know, in over 220 years... ", " >>77848888 is around the corner though ", " >>7791We'd better start posting, right? ", " Post real news, faggots. ", " >>7799Okay... Here's something I found about a giant boxing Kangaroo from mirror.co.uk - http://www.mirror.co.uk/news/weird-news/roo-want-some-giant-kick-boxing-5822015 ", " >They think Republican voters will listen to a loser that lost them the last electionPlease. ", " Trump/Romney 2016 pls ", " >>7791oh no! ", " >Huffpo said they would stop covering Trump>immediately start covering himlolThese faggots are gonna go on the DOTR ", " >>7859it said it would remove him from \"Entertainment\" to \"Politics.\" You need to make sure your statements are accurate before you post. ", " Nope. BUILD WALL ", " >>7896Darn I was hoping they'd keep him in Entertainment even if he won the election...>>7898My sentiments exactly. I'm strongly inclined to go to the Southern Border Wall if it actually becomes a thing to help build it! ", " >>7906When are the sea walls going to come? ", " >>7910Vote for Ben Carson if you want that...?! ", " looking back on it Mitt Romney really wasn't even that bad of a candidate.it seems like there's a new quote every week from some questionable stuff trump said, but the only thing I can remember the media getting romney for was the \"binders full of women\" memehonestly i would vote for mitt, he's the only candidate who wants to tackle the issue of lyme disease, literally no other candidate gives a shit about that and it's an important issue ", " >>7739Mitt didn't stump Obama how can he stop the unstumpable? ", " >>7739Romney didn't stump Obama, how can he stump the unstumpable? "]}, "3991": {"op": {"timestamp": 1448924400, "title": "well", "comment": " http://bigstory.ap.org/article/25fb633c4def434d8baed14bbdaa7465/male-vs-female-brain-not-valid-distinction-study-says "}, "replies": [" >>3991It seems like a flawed premise to do a study on. Brain shapes are as different as fingerprints between people.Wouldn't the hormonal differences between men and women be more of a variable? ", " >While specific parts show sex differences, an individual brain only rarely has all \"male\" traits or all \"female\" traits, researchers report.Thanks for the useless article, OP ", " >>3991>It's more likely to be a mixed bag: some things are more common in women, some more common in men, and some are common in bothThis article is already giving me a hard on. ", " >>4007>>4012please read the article before posting. ", " >apthanks for the bull shit source ", " You don't need to use an image to start a thread. ", " >>3991Because the Abstract for the journal publication belies the need for Malcolm Ritter's blog post,http://www.pnas.org/content/early/2015/11/24/1509654112 "]}, "5694": {"op": {"timestamp": 1449097200, "title": "Doctor faces 2 years in jail for sharing meme that likens president Erdogan to Gollum", "comment": " http://dha.com.tr/referee-to-investigate-gollum-over-probe-for-insulting-erdogan-son-dakika-haberi_1085600.html "}, "replies": [" Kek ", " >sharing a meme>it's just a funny pictureTriggered ", " >>5694A progressive, westernized and democratic country under rule of the law... Turkey, you are our greatest ally. ", " Triggered ", " >>5737People have no idea anymore what meme used to mean. ", " >>5739Why not pay them a few billion euros to be the jailers of europe keeping out the migrants from greece. Im sure the authorities will handle them humanely ", " >>5892Because Turkey will just take the money and continue letting them through. ", " >>5892We are talking about the same people that still deny the Armenian genocide and shell kurds for fun, they will probably put all the migrants in labor camps and run away with the money to a swiss account. When the international community calls them on their shit, they will problably blame it on Russia or the kurds or greece and let the migrants loose on Bulgaria. ", " I swear that greasy fuck Erdogan has undone everything Ataturk and his predecessors stood for. ", " Any country with lese majeste or any other similar laws is a shithouse. "]}, "4279": {"op": {"timestamp": 1448924400, "title": "t b h f a m", "comment": " who /int/ here?http://www.9news.com.au/national/2015/12/02/07/08/police-raid-home-at-merrylands-in-sydney-s-west "}, "replies": [" WE ", " WUZ ", " KINGZ ", " N' ", " QUEENZ ", " CUCKED ", " Stop bypassing the filters. ", " >>4712t͏͏b͏͏h f͏͏a͏͏m youre a c͏͏u͏͏c͏͏k. nice trip ", " >>4279Ayyy /int/ here too ", " We need some more banalposting tbh fam. ", " >>4712i was originally going to come in here and comment on the quality of the thread, but instead i'm just gonna tell you to fuck off with your trip ", " Since this thread sucks ass, I just want express my hatred for the autistic meme lords that destroyed /pol/.Seriously, ending every post with a gay facebook tier acronym is retarded. "]}, "6734": {"op": {"timestamp": 1449442800, "title": "Iraq threatens Turkey with UN action over troop deployment", "comment": " http://www.bbc.co.uk/news/world-middle-east-35023249https://archive.is/02XVg>Iraq has threatened to go to the UN if Turkey does not withdraw soldiers it sent to areas near the northern Iraqi city of Mosul within 48 hours.>Baghdad said the deployment was done without consultation and was a violation of national sovereignty.>Turkish Prime Minister Ahmet Davutoglu defended the move as routine troop rotation at a pre-established camp.>Mosul has been under the control of militants from the so-called Islamic State group since last year.>Turkey deployed hundreds of its forces to the town of Bashiqa to train Iraqi Kurdish forces fighting IS.Why aren't they co-operating? Wouldn't it actually benefit Iraq if Turkey was helping them with the recapture of Mosul? Even if it was just training Kurds.Also why is Turkey being so dickish recently? they have been flaunting their power quite a bit recently. "}, "replies": [" >>6734>Why aren't they co-operating? Wouldn't it actually benefit Iraq if Turkey was helping them with the recapture of Mosul?The Shiites seem to want Iraq and Syria to devolve into Stans and fear what a coherent and united Sunni-stan would mean for Assad and Iran. To that end they're inclined to want ISIS to stay strong, active internationally, and contained regionally. Iraq's PM is an idiot, it wouldn't have been his idea, but with oil rents as they are his man hole is likely owned by dozens of dirty dicks, and meek as he is, he may as well be their dick puppet.Just my theory, but why else would sectarian militias get more state support than the army, and the taking of Sinjar warrant a gov attack on the Kurds and tribes. ", " >>6734duplicate>>6679 ", " >>6737That would kinda match up with how they just keep delaying the recapture of Mosul, though at the same time it sounds insane that people really want to let ISIS to stay strong no matter the reason. ", " >>6749State sponsors of stateless terror groups isn't a new thing. It's only a small jump to regional collation tacit and occasionally active aid of \"state\" terror. There's no way to end IS without a political solution for this reason and they could be gone in a few months if a non-Russian/Iranian asset was in charge of either the Syrian or Iraqi Army, or even if it was just someone willing to let the Turks do it. "]}, "5076": {"op": {"timestamp": 1449010800, "title": "White Student Unions", "comment": " So, white student unions are cropping up now. But will they succeed?http://www.dailywire.com/news/1519/ucsb-white-student-union-releases-list-demands-pardes-seleh "}, "replies": [" >>5076nope because only #blacklivesmatter and if you disagree with the apologists and people looking for handouts then you're a nazi ", " Yes.If they follow the motto and make sure to keep out Neonazi shits.They are going to need them if they want to protect themselves in the future.Europe will be fine for at least 100 years. ", " >>5076>http://www.dailywire.com/news/1519/ucsb-white-student-union-releases-list-demands-pardes-selehThe whole list is obvious satire. ", " >>5076>But will they succeed?only if the opposition is unhinged.Given enough rope they'll hang themselves. It's always the case with these nutjobs. ", " >come closer to achieving true pluralism than we ever have in the history of mankind>members of nearly every race decide to pull back and live amongst themselves rather than live in the pluralityFucking hilarious ", " >>5276Human nature is a real bitch sometimes ", " >>5276i'd die for two brothers or six cousins ", " >Nobody bats an eye at black/asian/jewish/muslim/whatever student groups>White students groups are neonazi hate groups thoughI'm glad people are starting these. Really brings up a good point about how lopsided the issue of supposed racism is in the US. \"unprivileged\" groups can do no wrong, but whites are the devil. ", " >>5448Eh, \"white\" isn't really a culture though. Ideally there would be a greater proliferation of \"culture that is primarily white\" groups. Germans, Frenchmen, Italians, and whatnot. Unfortunately most Americans are just Americans, and so their \"group\" is almost everybody else around them. Nobody uses that argument though. They just parrot shit about ingrained racism etc. ", " >>5127Satirists don't usually insist that they have a real group with real intentions ", " >>5457The unified idea of white arises form Americanism. ", " >>5461I'd dispute that. It's mostly a function of the majority of immigrants until recent decades being white. A hundred years ago most people named Carlino were considered Italians or Italian Americans, people named Strauss Germans or German Americans. Give it fifty years or so and you'll have plenty third and fourth generation Americans of non-white descent calling themselves just \"Americans\" without mentioning their ancestors' national origins. They may remain racially homogeneous like the Chinese Americans have to a large extent since the mid 19th century, but culturally and ideologically they will be no different from the average WASP.Honestly, I'd be more in favor of American regionalist groups, since that's where the real diversity among our three hundred million people is. a Cajun student union and a Cascadia Club, things like that, since those people will actually have something in common other than low amounts of melanin. ", " >>5448Maybe because the last time whites organized something it left most of europe destroyed? ", " >>5479Hey, at least the original intention of the EU wasn't to fuck everything up. ", " Maybe because whites already run the world so arguing that they don't have a voice, especially on a college campus where the majority of students are white, is redundant as fuck. ", " >>5483I know that's not the case for California as a state, I'm pretty sure that's not the case for any of the Universities of California, including UCSB. ", " >>5483Also the fact that the people who push for these things are generally a bunch of racists... ", " >>5276Yeah. We could be so far down the road of true pluralism/\"post-racialism\" by now. But instead we get this shit. People just hate anything that's not immediately like themselves. ", " >>5457By that logic there shouldn't be Asian student union s either, only Chinese, Japanese, Filipino etc groups. And for Latinos only Mexican, Guatemalans, Salvadoran, Colombian etc. Groups. I'll give Black Student Unions a pass since most don't know their heritage. ", " >>5459the group itself is satirical, that's part of the joke ", " >>5483I can't believe you made that post unironically. Fucking shameful, get the fuck out.Yeah, whites sure have a lot of power in campus. What with all the hate whites, especially white males get. How they literally cannot do shit, and how even setting up a club for their own interest is enough to provoke outrage.Seriously, get the fuck out. This is pretty much the new definition of racism - power + privilege ", " >>5276Anyone with a brain and anyone who understands human nature,and anyone who understands game theory could tell you that this was inevitable. Racial pluralism is 100% impossible. ", " >>5592True racial pluralism isn't feasible, but amicability and an cross-racial sense of camaraderie that trumps internal divisions is not. We ought to all be Americans before whatever we put in front of the hyphen. Nobody seems to want that for some reason though. Kind of depressing. ", " >>5594>Nobody seems to want thatOnce again, Human nature is a real bitch ", " tl;dr racism is for losers ", " >>5448I for sure didn't bat an eye at black/asian/jewish/muslim/wahtever student groups.When I saw the white student group my initial reaction was just \"...yea! we should have that too.\" And I think that reaction is what most of us had, and we gotta think of why exactly we think that way.There's something significant to having a white student union obviously, something that makes us say \"oh this is going to piss off minorities\". Maybe it's because we don't really feel like we need one. Honestly, I wouldn't join one, would probably be a waist of time. But who knows, maybe if we lose representation or something I would be willing to join one. And that very well might be an issue in the coming years. It's already happening to Christians, a previously dominant group. ", " >>5683You're not white. ", " >study european history>realize that everybody in europe fucking hated each otherWhat happens with the irish and the scots learn about British history? ", " >Polish Student Union attracts students of Polish origin or ancestry and people interested in the culture>German Student Union attracts students of German origin or ancestry and people interested in the culture>French Student Union attracts students of French origin or ancestry and people interested in the culture>Russian Student Union attracts students of Russian origin or ancestry and people interested in the culture>White Student Union invariably attracts butthurt stormfags who willingly ignore all of the other European student unions and bitch and moan about everyone's against them for being whiteIt's not rocket science people. ", " Reminds me, here at NYU we had a white student union crop up about a month ago as a Facebook group. Was a pretty big shitstorm, seeing as how it's probably one of the most liberal schools in the country.For the most part, people've stopped talking about it now. ", " >>5753Most realize that it happened ages ago so besides the banter between the people out doesn't matter cause they aren't a bunch of fucking children. You know besides the nationalists who act like it was them personally who were wronged and demand people never forget it. ", " >>5768This is a sad truth.The number of people that celebrate what Caucasians have given to the world is minor compared to the people that just want to find others to bitch about \"inferior\" races.Supremacists are the biggest faggots next to nationalists and patriots.Even worse, and it even happened in this thread, are those that try to use genetics to state that Negroids branch are inferior because they have a lack of certain genes that Caucasoids gained from Neanderthals. But they would be implying that intelligence is an end-goal. It isn't.All that intelligence won't save you from a lion about to rip your face off. Brute strength and stamina, however, might actually give you a fighting chance to survive. Fucking nerds getting BTFO. ", " >>5768>Black Students Union>All POCs are one and United yet evil whitey needs to be divided.I reccomend you read stuff from Mosley on why Europeans should be United while still retaining our culture.>>5777Regardless of racial theories, intelligence would give me the intuition to avoid the lion, construct a spear or maybe a gun to kill it, or build a house that lions can't get into.Your argument doesn't do anything but stroke your own self againts a strawman.Most people who are labeled as \"supremacists\" today are simple racialists who say \"Whites are typically more intelligent due to a mixture of factors as a product of their enviornment over many thousands of years, and other races have their advantages as well; Africans are typically stronger than Europeans but Slavics are typically stronger than Africans. And so on.\"The neanderthal theory has no basis for intelligence, as we can't accurately depict it besides their cave drawings. Intelligence was a product of our seasonal and challanging climate and hardships during the ice age, along with the end of the iceage and the introduction of agriculture Europeans exploded in population and built the world's now most renouned civilizations to form one grand civilization of global cooperation; called western, civilization.Saying \"Whites are all and completely supreme\" is wrong, saying \"different races are better at different things, AND WORSE, at different things as a product of their enviornments over many thousands of years and need different systems and cooperations for their needs and services\" ", " >>5770Hi! posting from NYU here now too. And yeah, something like that really won't fly at NYU. It was obviously a hoax. But if it wasn't, then anyone behind it really would need to leave the university and re-enroll in a more appropriate institution, like Bob Jones University. Or the Special University for Angry Retards. ", " >>5794is this satire ", " >>5746why do you say that? ", " >>5788>built the world's now most renouned civilizations to form one grand civilization of global cooperation; called western, civilization.You mean the civilization that had its roots in Egypt, was brought to full glory in Greece and then turned into an empire centered on Italy?Yeah, those countries are fucking cold.Who was it that invented modern mathematics?Damn, that was South of the Mediterranean Sea too, wasn't it? How did those non-thinkers do that? ", " >>5421Nailed it. ", " >>5482Ohmysides.jpg ", " >>5522Hi, member of White Student Union here. Haven't met any racists in my group. I'm sure with your wealth of experience in WSU's you would know more than me, though! ", " >>5594So, you're saying that people naturally segregate themselves with those that they feel comfortable around? Such strange behaviour indeed... ", " >>5809I don't get it, what exactly are you trying to argue? That civilizations are built on the shoulders of previous civilizations?No shit! ", " >>5479>destroyedDon't you mean liberated when the allies came together and saved it? ", " >>5829>what exactly are you trying to argue?No.What are YOU trying to argue?If being in the cold is a requirement for the intelligence necessary to build a civilization, then I just disproved that.So, what are you trying to argue? ", " >>5835>If being in the cold is a requirement for the intelligence necessary to build a civilizationIt's definitely an incentive for innovative. ", " >>5459You sure about that?https://en.m.wikipedia.org/wiki/Colbert_Super_PAC ", " >>5809>western civilization>EU countries, America, Australia, New Zealand, Canada and some others>dead coldYou're fucking retarded >>5835Just to be clearI am >>5788Not>>5829However Intelligence is required for civilization(Humans overall are the most intelligent beings), that wasn't what I was talking about. I was talking about how we are all different and there is no one universal \"man\" or system that we can work under. ", " >>5141So are black student unions nutjobs too? ", " >>5788That's some great dancing around just outright saying \"hey y'all, I'm racist!\" Reported. ", " >>5768>Black Student Union invariably attracts butthurt blm members who [...] bitch and moan about everyone's against them for being black ", " >>5860I have no problem to admitting to racialism, we are all different. But I have no racial hatred friend.You, however, are nothing but a bigot.>ReportedSuch is the life of a child ", " >>5852>So are black student unions nutjobs too?The short answer: NoThe long answer: Some of them do have to tackle legitimate problems on campus about high levels of racism and the lack of support for black students. If these problems were solved before they arrived at the college or don't exist at all, there would be no need for Black Student Unions.Now unfortunately, a lot of them have no idea of how to actually solve their issues, for one reason or another. ", " >>5872I don't understand the difference between this \"racialism\" thing you've coined and garden-variety racism.You're still saying some people are inferior to you, and seeing others as subhuman is the first step to deciding to kill them.Whites are only about 18% of the world population. You don't get to just denounce 4/5 of all humans. It's abhorrent. ", " >>5882Where did I denounce 4/5ths of all humans or claim that I am racially superior?I am saying>hey, we're all different and we work better under our own systems>self determination and national unity are good thingsAnd so on.I don't have any views of supremacy, only that we are different.Racialismis the belief that the human speciesis naturally divided into distinct biological categories called \"races.\" ", " >>5880>racism against blacks>universitiesIt's 2015, this simply isn't true anymore, they are prioritised over whites. ", " >>5921>they are prioritised over whitesYou don't think that might lead to resentments? ", " >>5893>Racialismis the belief that the human speciesis naturally divided into distinct biological categories called \"races.\"So you're scientifically illiterate? Great. ", " >>5925I just pulled it off of wikipedia, and no; I'm not.While I'm not a Geneticist I do deal with them from time to time in my line of work and most that I've spent time with affirm with me; but say there isn't enough data or research to really nail down what we have.The human Genome has only been recorded for some of 15 years, and any type of racialist science is instantly discarded, despite any validity it has. ", " >>5924Black Students get affirmative action, why would the resent this?If they do, why don't they speak out about it?To me, it's racist to accept or collect any kind of racial data during admissions. ", " >>5289was human nature responsible for attempting pluralism -- or for pulling back?Or do different groups of humans have different \"human natures\"? ", " >>5961I don't know what was responsible, some corruption that was tried in wake of mass delusion from what made us so succesful in the past.The second question is, sure, maybe, but we all have primal values. ", " >>5457asian isn't a culture either\"American\" is certainly a culture, though - mixture of white (white American/Jewish American/Canadian - ya, Canadian, they're about 40% of Hollywood, ffs) and black (black American only, not African or Carribean) cultural accomplishments.American is one of the strongest and richest cultures in the world, but people, especially Americans, seem to downplay it at every turn.Self-loathing? Whatever the reason. it certainly doesn't negate American culture. ", " >>5970American culture is not a strong identity at all. There is no identity in it.Especially when mass immigration, and minorities who refuse to integrate essentially destroy the old cultural aspects.Quite literally, in 1973; the United States was 90% white.In 40 years it has been decimated to almost less than 60%.That is absolutly astounding.However I think because of that there is no \"American culture\" anymore, or if there ever was one (sectionalism is a bitch), but certainly with society so racially and ethnically fragmented there is no American culture Now it's, Mexican culture, or Black Culture. ", " >>5483that's not necessarily true. look at these American campuses, \"run by whites\" but giving in to every nonsensical demand any visible minority/sexual proclivity screams. ", " >>5950>why would the resent this?I was speaking of the other students. ", " >>5483having a middle-manager who shares your skin color does not mean that you're going to get preferential treatment from them as a white. As a black, it almost invariably does, I've seen cashiers let customers get away with quick-change scams because \"they kin.\" Maybe that's why they think whites are oppressing them--since they're so likely to break the rules, they think whites must be as well. ", " >>5978Actually the federal government gives funding to certain service industries based on the number of minorities they hire (mainly African american), the thing is they are not hired as long before the grant runs out; and they get fired and the company pockets the money.This is from an HR friend of mine who's business he worked for got shut down. ", " >>5979At this point it's just an anecdote versus an anecdote. Let's us take a walk down to the white house's web page to take a gander at the crime stats?Oh wait Obama shut it down? Oh well. Must mean you're right, blacks cheat at exactly the same rates as whites according to our samples. ", " >>5972>American culture is not a strong identity at all.I see what you are saying and I agree with a lot of it, but I think if a person has lived \"overseas\", lived in other countries (not just travelled or studied there, but actually lived and worked) it is much easier to see that there IS a very strong American culture. Is there also a patchwork of ethnic groups whose hermeticism prevents them from contributing culturally to society? Yes. But doesn't diminish the strength of American culture, as embodied by:jazzcountryrock 'n' rollAmerican architectureAmerican poetryAmerican literatureAmerican artAmerican \"modern classical\" music (John Luther Adams, Jennifer Higdon, et al)raprockabillyAmerican filmAmerican operaAmerican cuisineAmerican fast-foodAmerican advertisingAmerican graphic artsAmerican designThat's a VERY strong culture.Take part in it, if you don't already - and explore! Go beyond what you are comfortable with - when is the last time you went to see an orchestra? a show at a museum or art gallery? read an American work of literature? read some great American poetry like Walt Whitman or Emily Dickinson? taken a tour of local architecture?None of that shit is \"gay\" or \"boring\". It's awesome and invigorating. It's the highest expression of what it means to be human, and more specifically what it means to be an American human.It's what the country IS.It's what Americans ARE.Get out, and immerse yourself in your own culture. ", " >>5921>It's 2015, this simply isn't true anymore, they are prioritised over whites.There must be something wrong if they still feel like protesting and creating unions, otherwise there would be no need for any of this at all. You know that shit is no one's hobby or past time. ", " >>5980Re-read what I typed.I wasn't negating your point, I was bringing up another example.>>5987Self victimization is the new fad. ", " >>5988So uh, you don't think thousands of people are demanding fair treatment because there's some deficit with the establishment that isn't being addressed? ", " >>5995What fucking deficit?Crab mentality and group think plague everyone, especially BLM. ", " >>5996Alright, fine. I guess people just like harassing College administration now.For the record, no I don't like or pay attention to BLM for my own reasons, and no one should harass any student that is just minding their own business. ", " >Majority group in the US still moaning and bitching about not having enough catered to them. ", " >>5972American culture is real. White culture is real. It may not be real to you, because you are living in it. Anyone not living in it can see it as plain as day. ", " >>5948>and any type of racialist science is instantly discardedBecause it's bullshit science and you're making shit up. Why isn't the term \"race\" used for any other group of species with minor differences? You'd think if it were a term with any validity you'd see it applied universally--but no, it's only applied to humans, and by pea brained little inferiority complex having faggots like you. You're a racist. It's what you are. Face it, embrace it, make it your own. Then promptly walk off a cliff. Or get assfucked by a bayonet when the facist regime you want to set up finally decides you're not white enough. Seig heil, friend. ", " >>5482kek ", " >>5592Anyone who understands game theory? The average person is not a rational actor, nor are they informed enough to be so. ", " >>5995Replace>fair treatmentwith >special perksand> there's some deficit with the establishment that isn't being addressedwith > liberal whites have proven themselves to be a weak race that will roll over for any grievance, real or imagined, and accommodate nearly any demandand the answer is yes. ", " >>6022PUAs are misogynist trash. Why the fuck are all the stupid right-wingers into the same ignorant and stupid shit? ", " >>6020Its bullshit because you say it is, because it makes you feel uncomfortable? The theory arose from peoples' real world observations which is why it is a valid question. There is no research proving or disproving it so you can't just pretend it isn't real. ", " >>6025Did you mean to reply to someone else? I'm not sure what your response has to do with what I said. ", " >>6000Yes they do like it. Step into any American campus anytime soon. One good example is the harassment of president Stenger at BU by SJWs and blm shitters making unreasonable demands. The majority of students called them out on their bullshit and roasted them which lead to them begging for a ban on social media. ", " >>6026All valid science absolutely refutes it. The average genetic distance between races as a whole is absolutely dwarfed by the possible genetic difference within races. You've probably heard this many times but it just. doesn't. sink. in, does it? Doesn't fit with your racist worldview, eh? Your ilk is fucking retarded.Black skin, thicker bones-- these observable differences don't mean that race exists. Those are variations that are selected for because they enable a group to survive in a certain habitat. They don't mean that there's any difference between human \"races\".Science would probably call different groups of people \"sub-species\" if race was a real thing. But they don't, because it's not. Get wreckd. ", " >>6025What does the non existent PUA boogeyman have to do with game theory ", " >>6028You're into game, aka attacking women's self-esteem to get in their pants. ", " >>6033Um, that's not what game theory is. ", " >>6034Oh yeah you try to make it into an entire cultish system of behavior, \"USE SEDUCTION TECHNIQUES TO CONVINCE YOUR PARENTS TO GIVE YOU MONEY AND GAIN POLITICAL POWER\"Then you associate with nationalist movements as being \"truly masculine.\" You're just making yourself look ridiculous. ", " >>6031>undeniable physical differences mean race doesn't exist>adaptations to survive in different climates mean race doesn't exist>finches on different islands of one grouping of islands are considered different subspecies, but even more stark differences between humans means there's one race, the human race>get wreckdI should've stopped there. ", " >>6038>Game Theory>Game theory is \"the study of mathematical models of conflict and cooperation between intelligent rational decision-makers.\"[1] Game theory is mainly used in economics, political science, and psychology, as well as logic, computer science, and biology. Originally, it addressed zero-sum games, in which one person's gains result in losses for the other participants. Today, game theory applies to a wide range of behavioral relations, and is now an umbrella term for the science of logical decision making in humans, animals, and computers.Congratulations, you learned something. Now start debating like an adult, and not someone from tumblr who can only cry racism and misogyny. ", " >>6007I'm not white doe.I think white culture is probably pretty good seeing as they practically dominated the world for 400 years and still do.>>6020Using exorbents amount of emotion in an argument and strawmaning people is what happens on /pol/, you'd fit right in there.I don't care about whiteness, I care about freedom of association and self determination. It's not \"all bullshit\", there is genuine racial research that is essential to the fields of medicine and history.>Why is it only called race in humans?Would you prefer subspecies? I find that a bit dehumanizing. And generally not a good idea.>>6031The first part of your statement is very far from true, and uses comparisons between people like Italians and Englishmen or Slavics and Iberians.There are probably thousands of races in the world really, but those differences are very tiny and won't be decernable in a now cosmopolitan world. The best we can do is use a mixture of genetic and anthropologtic data to classify races and their common range of traits; as its traditionally been done.>call it subspeciesthat was actually used for quite a while, in the 1920s, and VERY high in the 60s and 70s and consitantly today, you can use NGRAM viewer for an idea of this.It also had substantial usage in the 1880s.But again, none of these important scientific discussions happens because people like you are more concerned with decrying \"racism\" (which is not what it is) rather than even establishing basic facts.>>6025Lol. Women have become so easy someone turned it into a game. (^:You're probably just have jelousy for their attention ", " >>6020>Why isn't the term \"race\" used for any other group of species with minor differences?It is, they call it subspecies. The fact of the matter is that different races are just that, different. Not saying one is better than the other just that we are different biologically. Not as different as Chips and Apes but different enough to warrant separate subspecies. The problem people are afraid to publish anything on the matter or do any research because they are afraid of being labeled racists. There have been several who have done so anyway and there is quite a bit of information on the subject if you would look around for it. Its not made up, its actual science. ", " >>5777>But they would be implying that intelligence is an end-goal. It isn't.>All that intelligence won't save you from a lion about to rip your face off. Brute strength and stamina, however, might actually give you a fighting chance to survive. Fucking nerds getting BTFO.the ability to make a bow and arrow certainly helps stop the lion ", " >>5076>will they succeed?Nah. This is a brief explanation of why >>5091Obviously there's more to it than that, but that's the gist of it. ", " >>5982The only people who say America has no real culture have no idea what culture means, or they're Europeans who're trying to rile up Americans by claiming all American achievements for themselves. ", " >>5816please, you can't run with an idea from the daily stormer and expect people to believe your weak denials ", " >>6100who gives a shit even if they are racist ", " >>5475There is no such classification of people as white outside of the context of american bullshit. ", " >>6112>Caucasian ", " white student unions are dumb for a number of reasons. being \"white\" isn't an ethnicity. people who push for white student unions often use the argument that black student unions are based solely on skin color which is disingenuous. black student unions exist because black is an ethnicity in america. African Americans are an ethnicity just like German Americans or French Americans or Mexican Americans. the major difference is black students aren't afforded the same knowledge about the ancestry that white students are because of their history being largely erased because of the slave trade so being black is largely it's own ethnicity in america. Go to places in Europe and you'll often hear blacks refer to themselves as Ghayan, Sudanese or Jamaican or w/e something that doesn't really happen here in AmericaI think if white students want to combat affirmative action or discuss immigration policy should create political groups rather than isolate themselves racially and disenfranchise themselves or make their message branded as \"racist\" the UKIP or the Front Nationale is a good example that us HBD aware whites should model after ", " >>6143African isn't an ethnicity either.Africa is the most diverse.White students unions are for Americans because we usually discard our allegiances to our former countries and create a new \"white\" identity.Anyway, your idea of a political group is much better for things like combating affirmative action, but their are other social issues that American whites face that cannot be addressed or brought up simply politically ", " >>6000>Alright, fine. I guess people just like harassing College administration now.https://www.youtube.com/watch?v=nd4kX66uG1MYes, they really do. Watch this video. This is happening at fucking Yale, too, not just the public universities and community colleges. ", " >>6220Quote from the woman in the video at ~7:10, \"If that is what you think about being the Master, you should step down. It is not about creating an intellectual space; it is not! Do you understand that? It's about creating a home here!\"This is the current state of American higher education, and again, let me remind you that this happened at FUCKING YALE. ", " >>5076No, because anything white people do is racist. As you already know, black people can't be racist to white people, therefore black student unions aren't racist.I just love this shit though. They believe they are fighting for civil rights, when in reality they are completely unraveling everything the past leaders fought for.Bring back segregation? Impose a racial caste system (\"progressive stack\")?Don't be surprised when the whites say yes to the first half and everything goes completely against you. ", " >>5091This is probably the most accurate thing I've heard. ", " What I really want is for everyone to stop giving a shit. ", " >>6254Me too, but that's not going to happen unfortunately. Even though we know all of the alleged racial issues in our society today are fabricated; it's something that's not going to end until one side of the argument wins. Either these people get their way, or we finally have that pushback/outright rejection of this shit by the whole.It's not simply going to go away. ", " >>6270It's not going to go away until we get rid of the incentives for playing the race card. This means that we should stop accommodating imaginary grievances. ", " >>6220>>6228By the way, apperently that women who screams \"WHO HIRED YOU\" was actually apart of his hiring. ", " >>5568>there shouldn't be Asian student union s either, only Chinese, Japanese, Filipino etc groups.That's actually how it worked at my college. The only time I've seen actual Asian student unions (as opposed to several different groups doing a \"coalition\") is when there aren't enough members to splinter off into subgroups.The fun thing about these culture clubs were that they welcomed everyone and the food was almost always great. ", " >>5076NoThey're attempts to show that any racially based student union is hypocritical if they oppose a white student union - but only people who are interested in trying to preserve 'white culture and race' will join - fueling accusations that white student unions are uniquely racially prejudicedalso, 'power + prejudice = racism'The real question is, once body cams are instituted - will campuses ever get tired of the BLM type protesters?Academic administrations actually get more grief, and increasingly absurd demands, than anyone else (so even though they're largely socially liberal)Protesters keep coming in, and graduating after 4-5 years, giving them a pretty limitless supply of new bodies ", " >>5592>anyone who understands game theory could tell you that this was inevitableDunning-Kruger the post right here. ", " >>5809>>5835>>5860>>5882>>5925>>6020>>6025>>6031>>6033these are pretty funny.i just hope its someone pretending to be retarded. ", " >>5076Nope, because black student unions exist and it's not a double standard to ban white student unions. ", " >>5568That's how it works for the Asians. Almost every school has multiple korean chinese and Japanese heritage clubs, and many have groups for the smaller southeast asian communities as well. ", " >>6309>'power + prejudice = racism'No.racial prejudice = racism ", " >>5987What's wrong is that blacks are fed a constant diet of slavery and race propaganda in schools and in the media. At school, when they're taught about slavery, they're shown a picture of a black guy hanging from a tree next to a quote from Strange Fruit and a Jim Crow-era \"whites only\" sign. They're not told that the guy hanging there in the tree had committed a heinous crime and that lynchings were cases of outraged communities taking the law into their own hands. Nor are they shown photos of all the white victims of lynch mobs. NOR are they shown evidence of the amount of black-on-white violence that occurs every day.In the following link, zoom in on the second page and read the first three paragraphs.http://archive.org/stream/congressionalrec103dunit#page/n25/mode/2upI don't know whether or not Cohen actually said that. Most people will tell you that it's a forgery. Maybe so. But now check this out. Straight from the US govt archives. http://www.eisenhower.archives.gov/research/online_documents/civil_rights_eisenhower_administration/1956_10_Communist_Party_and_the_Negro.pdfThe plan is indeed real. They never really got black America on board with communism like they had hoped, but through the use of schools and media they've successfully introduced blacks to Marxism 101. Whitey (bourgeoisie) got dat privilege (wealth, ownership) and I (proletariat) goin get me sum of dat (collectivization, redistribution e.g. diversity quotas, affirmative action.) ", " >>5880It's like I'm really on reddit. "]}, "3045": {"op": {"timestamp": 1448838000, "title": "Adult film actor 'James Deen' accused on Twitter of rape by his ex-girlfriend", "comment": " >Porn actor James Deen, 29, has been accused of rape by his ex-girlfriend>Stoya, who is a porn actress and writer, accused Deen - real name Bryan Sevilla - of rape Saturday in two tweets>She wrote: 'James Deen held me down and f***ed me while I said no, stop, used my safeword'http://www.dailymail.co.uk/news/article-3338046/Porn-actor-accused-rape-Twitter-ex-girlfriend-adult-movie-actress.html "}, "replies": [" >>3045I was like OP didn't tell me any important info about this rape...>read the articleThis article doesn't tell me any important info about this rape. I don't even know if the safe word was something confusing or forgettable. Why did she tell him to stop? Was it too rough? Was she just bored? Was this a personal or professional thing? When did it happen?And just in general how can you give support or make a judgement on it without any of that info? I get it's twitter and people on twitter I get it's click bait. But what was the point of her telling twitter to begin with? Why not the police? ", " >>3045It's a shame Piers Morgan is letting this kind of twitter gossip onto The Daily Mail in his new job as editor of the online version. ", " >ex-girlfriend slanders her old boyfriendIt's not news. ", " >>3045>I'm not going to go to the police about this rape>but I'll tweet and cry about it online all I can without actually doing anything but slandering him ", " damn, even I would rape Stoya, even if they'd losen my boipussy in jail. ", " >>3072>daily fail>caring about that>piers morgan>vetting every little thing that goes up on the website ", " Fucking manlets. When will they learn? ", " >>3045It's likely a false accusation made by Stoya. This will turn into a high profile rape scandal and almost 100% of high profile rape scandals turn into rape hoaxes. James Deen is gonna get his public image and career destroyed. For very little reason. ", " >>3045>be james deen>having sex with your girlfriend>all of a sudden, the moody bitch changes her mind>you're almost finished>\"come on\" you say \"i'm almost done\">you ejaculate>she's in a bad mood, but whatever>months go by>you eventually break up>you're much more successful than she is>she feels moody again one night and decides to slander you>\"HE RAPED ME\">everyone will take her side because she's the \"victim\" and no one wants to tell a \"victim\" that she's in the wrong>#IStandWithStoya>you can only sit at home and watch and think to yourself:>YOU'RE TEARING ME APART!How much of that do you think is accurate? ", " >>3069Hmm... You're a piece of shit ", " I wonder what her safeword was ", " >>3224All of it, I can tell by some of the pixels. ", " Innocent until proven guilty is a thing of the past. Now you just get your public image destroyed on social media with absolutely no repercussions towards the woman if the accusations turn out to be false.In middle eastern primitive societies, men can raise claims against women and people can't dispute it. They just LISTEN AND BELIEVE.In western progressive societies, women can raise claims against men and people can't dispute it. They just LISTEN AND BELIEVE.Listen and believe is literally asking us to throw away the foundation of our justice system because of an extremist ideology. ", " >>3045Awesome, accuse someone of something they can't defend themselves against when you have no evidence. What a way to try fuck up someone's life. ", " I'd counter with this:http://www.dangerandplay.com/2015/11/29/how-we-know-the-stoya-rape-accusation-against-james-deen-is-a-hoax/ ", " He is a big guy ", " >>3588for you ", " >>3571I'm not sure countering a bullshit accusation with a bullshit website is the right way to do it ... ", " >>3704>>3571I'm pretty sure it is just advertising for her new video with him but I ain't nobody, just a asshole. ", " >>3487whores don't have safewords ", " >>3045>dailymail.co.ukMight as well be tripe.puAlso, there are actual procedures for when you have been raped. Its called going to the police, and taking care of the issue. When you go on Twitter and accuse someone of rape, without actually going through the police and going through the evidence collection process, then its not rape. Its called being \"Sourey\" and \"Needing attention\" Here's something of a big shocker, especially to the young folks of the current generation. Just because you break up with someone, or think back on \"Oh god how could I sleep with that person.\" is not an actual excuse to cry \"rape\". Even if someone forced you to have sex with them against your will in the past, without any evidence or proof (which isn't really hard to get, and tears/feelings don't count as evidence) doesn't mean you get to shout at the top of your lungs \"THIS GUY/GAL IS A RAPIST\" That's like if I went to every black man with a mean look on his face and took his picture and tweeted \"OH LOOK ANOTHER BLACK CRIMINAL\" Or if I took a picture of every woman wearing a skirt shorter than knee high and posted it on twitter crying \"JESUS WHAT A SLUT.\" You kids, and you filth of humanity that calls itself news providers need to understand that just because someone points a fucking finger and cries \"RAPE\" doesn't actually mean jack shit. Now if you got a whole case load of files on the rapist, or even better, catch him/her with his/her dick/cunt in the middle of his/her latest beau then you can actually publish it. You can't make fucking assumptions and call it fucking news you fucking asshats. Because if could, then I could make my own news story about how dailymail.uk rapes my intellect and my pride in being an educated human being on a daily basis. How it try and force liquid shit into my mouth and call me uneducated swine the entire time. And they just want me to take it more and more, begging and crawling back to them at the end of the day. ", " >>3045Has she not gone to the police? ", " >>3484Name calling without actually criticizing an argument or offering a new argument is utterly childish. If you're not intelligent enough to actually discuss ideas, just don't talk. ", " >>3484Amazing argument, my friend. You're really making this board a better place with such a high level of discussion. ", " >>3754No one knows. There was a post on /tv/ saying how a friend of hers knew that the accusation was bullshit, but wanted to go through with it because she'd rather lie than tell the truth.>>3751I know that regret is not rape, but why doesn't everyone else?>>3704>>3713Probably, but their last scene was back in June, apparently. Guy seems to have done his research, but hey. ", " Well all the porn companies he is currently working for (Even the rape-esque Kink.com) are severing ties with him now that other girls are coming forward. Rip, James Deen. ", " >>3776What other girls? ", " >>3795Tori Lux and Ashley fires or Fries or whatever her last name is. ", " >>3045duuuude I totally used to live with tori lux. ", " >>3776Well that's telling ", " >>3772>No one knows. There was a post on /tv/ saying how a friend of hers knew that the accusation was bullshit, but wanted to go through with it because she'd rather lie than tell the truth.She didn't want to back up her friend Deen despite knowing the claims were bullshit, because she believes women should always be believed.https://i.4cdn.org/tv/1448956050631.png ", " >>3224>screw tons of dudes>get paid for it>guy is screwing her>all of a sudden no stop i can't do this you're raping meNot saying it's her fault, it's just ironic.It's a shit industry, if she wants to not feel abused she should do something else ", " This news of Stoya being raped is such good news for SJW narrative building: Deen's white! What a terrible thing he did!But let's not mention the three black guys who broke into Cytherea's house and gang raped her earlier in the year.http://www.returnofkings.com/57034/why-are-feminists-ignoring-the-violent-gang-rape-of-porn-star-cythereaSo progressive it hurts. ", " >>4152>Deen's white!Jewish*She's whiteThe gang rape has been talked about already and is old news. ", " >>3045so where's the vid ", " It's serious now. Tasha Reign cut ties with him! Who the fuck is she and why is her cutting ties with him worthy of news? ", " >>4153>Jewish*Fuck off back to /pol/ ", " Shit-tier porn stars try to get 15 minutes of fame with false accusations, what the fuck is news here? ", " >>3069>Why did she tell him to stop? Was it too rough? Was she just bored? Was this a personal or professional thing? When did it happen?Stop means fucking stop. It doesn't matter why. ", " >>3713You mean, *an asshole. ", " >>3172>It's likely a false accusation made by Stoya.Based on what? Other people have spoken out against him. He's always come off as a douche, it wouldn't surprise me at all if he's a rapist. ", " >>4153>>Deen's white!>Jewish>whyispolalwaysright.jpg ", " >>6507Being stand offish is being a rapist.Well then why didnt she go to the police.This is a dumb thread. "]}, "4499": {"op": {"timestamp": 1449010800, "title": "Why some Americans remain skeptical about climate change", "comment": " http://www.csmonitor.com/USA/Politics/2015/1201/Why-some-Americans-remain-skeptical-about-climate-change>Two new analyses examine 'how a culture of misinformation' can be spread within the American public, according to their author.>A network of conservative donors and interest groups in the US form an intricate ecosystem effective at converting dollars to public doubts about global warming.>That is the broad conclusion from an exhaustive analysis of 20 years' worth of IRS documents, as well as speeches, blog posts, books, and position papers from politicians, conservative think tanks, and trade groups.>The analysis spans two research papers, the latest of which was published Monday in Nature Climate Change. It follows a study published Nov. 23 in the Proceedings of the National Academy of Sciences that in effect set the table for the latest study.the study: http://www.pnas.org/content/early/2015/11/18/1509433112.abstract "}, "replies": [" >Taken together, the analyses by Yale University sociologist Justin Farrell, does the best job yet of connecting the dots along the paths from donation to representation of contrarian viewpoints by politicians and in the media, from whom people take many of their cues on policy, says Robert Brulle, a sociologist at Drexel University in Philadelphia.>Monday's study fills what Dr. Brulle calls a key gap in the sequence of steps that leads from donations to the appearance of climate-contrarian language in the media, where most people get their climate information. It suggests that the message donors are paying for increasingly has worked its way into the media, where the public gets most of its information on climate change.>This follows work Dr. Farrell published Nov. 23 that identifies the links within the network, highlights several themes contrarians have included in their material, and explores the impact funding has on the emphasis those themes receive.>Over the past decade, other peer-reviewed studies, as well as books, have been written about efforts by key players in the fossil-fuel industry and among conservative groups to sow doubt among politicians and the public about the need to curtail the greenhouse-gas emissions that are driving global warming.>It's not a question of winning over a majority of Americans, notes Anthony Leiserowitz, director of the Yale Project on Climate Change Communications and a collaborator on a project with researchers at George Mason University in Virginia that tracks public opinion on climate-change issues.>Contrarians “just need to be strong enough to say no” to major policy decisions aimed at curbing global warming, he says.>The broader issue remains, however – “how a culture of misinformation can be spread so effectively within the American public,” writes Farrell in an e-mail. ", " >In trying to help answer that question, the new work “adds a level of detail and integration that we did not previously have,” adds Naomi Oreskes, professor of the history of science at Harvard University and co-author of the book, “Merchants of Doubt,” in an e-mail.>Farrell opted to treat climate contrarians as a social movement and searched for the links between all of the key players to gauge their relative influence with politicians and the media.>Initial outlines of the network have appeared in previous studies. Two years ago, for example, Dr. Brulle's research identified 140 foundations that between 2003 and 2010 collectively contributed nearly $560 million to 91 conservative organizations focused either exclusively or in part on casting doubt on climate change and the need for action to counter it.>Farrell identified another 73 groups, expanding the sample to 164. To represent the donor community, he focused on ExxonMobile and the Koch Family Foundations. Previous studies had identified these two organizations as among the most influential.>In addition, he used computer-based text analysis to hunt for common themes among nearly 41,000 documents or speeches the network produced during the 20-year period.>The first part of the analysis, published in the Proceedings of the National Academy of Sciences, focused on the donors and the organizations they fund.>Not all contrarian groups in the sample received money from ExxonMobil or the Koch Family Foundations, the study noted. Those that did, however, were more likely than the received-nots among contrarian groups to write and publish documents aimed at polarizing public views on climate change. ", " >Prior to this analysis, “we didn't know that there was a difference between these two groups,” Brulle says. “We knew there were variations among groups, but we hadn't tied that to their funding.”>Perhaps more important, the money was a signal of the recipients' places nearest the center of the contrarian network. That's where the money goes because “they are better organized and better connected, which leads to more influence,” Farrell notes.>In addition, Farrell's data hint at the influence corporate and foundation money may have on the themes that recipients emphasize. By 2013, for example, funded groups were placing a higher focus on criticizing scientists' analysis of global temperature than groups that had not received funding. That marked a reversal from what had been the norm during the past 20 years, and the change took place over the past eight years, data show.>The shift loosely tracks the rise of the so-called hiatus or pause in global warming as an issue. The notion of a pause didn't come from the scientific literature, where researchers are interested in trends over century time scales, notes Drexel's Brulle.>Instead, “it was a climate disinformation meme” he says, one that the media amplified. It sent scientists scrambling to explain it, even though the decade in question not only was the warmest on record, it hosted several of the warmest years on record – later to be topped by 2014 and now expected to be topped by 2015. ", " >The second of Farrell's two studies takes the initial analysis an extra step by exploring the potential connections between the material contrarian groups funded by elite donors publish and similarities in the climate concepts appearing in the media – dubbed semantic similarity.>The media information comes from articles published in The New York Times, USA Today, and the Washington Times. He also tracks the language similarities with presidential speeches and speeches from the floor of Congress.>Over the past 20 years, the semantic similarity between climate contrarian groups and these high-profile public outlets has increased across the board, he finds. Although the steepest increase occurred in the media, the research doesn't distinguish between news and opinion pieces, and does not include the context of the broader article in which the terms appeared. >That was followed by a less pronounced increase in presidential speeches. The smallest increase in similarity appears in congressional speeches.>“Contrarian language began to filter in to what news media were writing,” Farrell explains. “Over time, the language in the media began to reflect this language.” ", " Merchants of Doubt by Naomi Oreskes talks about the same issue and parallels the tobacco industry's success at slowing down information (took 50 years before government warnings appeared on packs) with climate change. Other corporations have followed suit and normally fund heavily for PR campaigns and thinktanks. Not news but she also backs with sources. I only watched the documentary which probably isn't as good because I'm lazy. Toxic Hot Seat has a more specific example using the chemical industry's push for placing and selling carcinogenic flame retardants in furniture and foams (see TB 117). ", " >>4499Pnas posts some legit insightful studies. But I'd like to talk about the subject of disinformation for climate change. This polarization isn't only caused by doubt that climate change is occurring, but also by necessity of the fossil fuels that we use. I've heard people arguing about deficiency of new energy sources and how changing to a new energy source can be costly, but what really scares people is how resourceful is a new approach to energy. This scare could be fuelled by disinformation spread by news media but I'd like to think of people as habitual creatures that don't like change in their normal daily tasks unless they are absolutely required to. ", " >>4499It's an \"Inconvenient Truth.\" That's why. They realize that if they accept global warming as true, they would start feeling guilty about driving gas guzzlers and leaving the lights on. That if politicians stop denying science, we'd see more Pigovian taxes on gas and energy. It's inconvenient for them to accept science as being real, so they just pretend it's not. The number of people who accepted that humans were causing global warming was increasing for years, then global warming denial went back up during the recession and high gas prices. Because then it was less convenient to accept the truth. That, and religious beliefs.>Only God can control the climate, humans are insignificant and nothing we do can compare to the power of God>>4581This. People would deny that tobacco caused health problems, not because there was any science to support it, but because they were afraid of letting the government regulate anything. It's exactly what's happening with global warming. The science deniers don't have any rational reason to support their view, they just don't like the government and don't want the government to do anything to mitigate climate change.Also of the handful of global warming deniers in the scientific community, many have received 6-figure payments from the oil and gas industry. Throws a wrench in the conspiracy theory that scientists are just in it for the money, when the ones making the most money are being paid by fossil fuel companies to deny global warming. ", " >>4593>but because they were afraid of letting the government regulate anything.But this is another artificial fear instilled into people by the media. They call it \"freedom\" and they convince everybody that the permission to do something is essential to their happiness, even if that thing is detrimental to their health or if they can't afford it anyway. ", " >>4594>They call it \"freedom\" and they convince everybody that the permission to do something is essential to their happiness, even if that thing is detrimental to their health or if they can't afford it anyway.Are you saying people should be forbidden from doing something just because it's unhealthy or some people can't afford it? ", " This article is written upon the absolute and total assertion that \"greenhouse-gasses\"(sensationalist science) is the main driver for global climate change.This, regardless of being true, cannot be stopped if true without reducing human population massively.>>4593>\"science deniers\" don't have anything to support their world viewExcept they do.They are not denying science, they are denying the dogmatism that is \"climatology\".A Serbian Geologist from a hundred years ago has been more accurate than any modern \"climatologist\".>only God can control the climateGlobal climate has the most massive changes in absence of human presence, and the amount of energy and emissions we produce are not significant to create global climate change (as the earth has natural processes to cope with most of what humans create). We also live in a very cold period in history, an interglacious period at that, and have been steadily warming since the ice age. We are nowhere near the level of tempature during the mionian, Roman, or even Midevil warming periods.>>4592Alternative energy sources (Wind, Solar, Hydro, or Geothermal) are too expensive, ineffecient, take up too much space, do not provide a STABLE source of energy on demand, are too isolated for use (geothermal), and require tons of upkeep.They also do more ecological damage than petroleum energy sources.The most ecological and economical alternative is Nuclear Energy. There isn't much room for debate.>>4594Stopping the use of petroleum fuels would cause mass economic collapse and the transfer to \"green\" energy is more ecologically damaging than the current infastructre. It's also more expensive, takes up too much land space, and doesn't provide energy on demand. ", " >>4674Do you work for an oil company? ", " >>4499According to this, conservatives are so hellbent on destroying the world that they spend their sheckles to spread information.>Why can't they just accept our predictions that have a history of being overblown? ", " >>4677No, he's Thamuel L. Jackthon from Kingsman ", " >>4677No. I am actually a Geologist and working for a non-poliferation company. ", " >>4652>Are you saying people should be forbidden from doing something just some people can't afford it?No, I am not. I am saying that those people who can't afford it shouldn't care if they are allowed to do it or not.>Are you saying people should be forbidden from doing something just because it's unhealthyYou mean like forcing people to use a seat-belt?I don't think I have a good answer for that question. All I can say is one thing:I believe there is a difference between \"choosing to do something dangerous\" and \"choosing to do something and being (willfully) ignorant of the danger\". ", " Climate change is provably happening, and has been a permanent feature of our global climate since the planet became stable after it formed.The reason being is that, despite what was commonly held true, our planet actually isn't in the goldilocks zone, at least, not entirely.Our planet is on the outside edge of the zone. This is where the instability comes from. Equally the angle of the planet creates some interesting formations in the upper atmospheres currents.Right now, our planet is at the chaotic uprise stage right before the climate system collapses in to an ice age. You can see these exact same chaotic rises in ice cores and sediment layers, all following the same thing.However, in our case, our contribution to the climate has sped it up a little bit. Not massively, but enough to be significant.Humans should not even bother trying to stop it, the climate is already in that downward spiral. It is already too late. Humans need to adapt or die.We need to build large habitats partially under ground to limit heat loss for the sake of containing and safeguarding large numbers of animals.Equally, underwater habitats or farms in the ground habitats to safeguard fish species.Anything else is stupid and a waste of money. \"Saving\" the climate will only destroy it harder. Geoengineering is not a good thing. It will crash the climate harder, probably even irrecoverably. ", " >>4674>This article is written upon the absolute and total assertion that \"greenhouse-gasses\"(sensationalist science) is the main driver for global climate changeThat's because it's not only a fact, but common knowledge. Denying AGW is literally /x/-tier at this point. ", " >>5360It's not fact.The approach to modern climatology is entirely dogmatic and is a new age of anti-scientific method, where the most applauded hypothesis is fact until disproven, rather than the best theory is accepted until new evidence arises.There is no definitive proof of Anthropogenic global warming, or climate change. We are in a critical interglacious period and have been warming steadily since the ice age. Climate change is real and non-anthropogenic. ", " >>5460The whole point of the article is that it's mostly only Americans who think AGW isn't happening, due in part to the influence of thinktanks formed by American petro/coal industries. ", " >>5460>There is no definitive proof of Anthropogenic global warming, or climate change.There's no definitive proof of anything in science you fucking retard that's not how science works. This is why people call you science denialists because you know literally nothing about science. There's no definitive proof of evolution or germ theory or fucking anything. There is overwhelming evidence that humans are causing global warming, and there is no real evidence to the contrary. AGW is the only theory to explain the current warming, all other explanations lack any evidence to support them. Nobody has come up with any evidence to disprove AGW, nor has anybody come up with a single viable alternative theory to explain the warming. ", " >>5465I understand, I am not an American. But I do work for an American anti-poliferation comapny.>>5470>There's no definitive proof of anything in science you fucking retard that's not how science works.There is a term and a limit to which things become scientific facts, or laws. This is how science works.>This is why people call you science denialists because you know literally nothing about science. I am a Geologist and a history fan. Do you know of a certain Serbian Geologist that's been more accurate in predicting global climate change a hundred years before modern climatologists?>There's no definitive proof of evolution or germ theory or fucking anything. There is substantial proof for both of those things, they are age old discussions and generally hold up to constant scrutiny.>There is overwhelming evidence that humans are causing global warming, and there is no real evidence to the contrary.There is not overwhelming evidence that Humans are causing anthropogenic climate change (the term isn't global warming anymore m8), the earth's has natural cycles of cooling and heating because of our orbit and the effect on climate the movement of plates have. We are in an interglacious period, and now in a critical one coming to the end of the holocene.The evidence submitted is a product of science following the money, and learning how to avoid defunding. As well as the only people who are attracted to climatology are those that seek to be employed in the field of APGW research to \"prove\" it. While those that don't follow are denied from the positions and any other scientists (geologists, oceanographers, marine biologists, astro-phyz, METEROLOGISTS, and so on) are left out of the opinion or reference. ", " >>5470>AGW is the only theory to explain the current warming, all other explanations lack any evidence to support them.Milianovich cycles and cyclical ice ages explain everything perfectly, he predicted this period of warming exactly, I don't know why you assert such wrong claims.>Nobody has come up with any evidence to disprove AGW, nor has anybody come up with a single viable alternative theory to explain the warming.Except they have, you conveniently haven't looked for any.AGW is substantiated by a dogmatic approach to global climate science, and in many cases, unfalsifyable data based on graphs and models that are wildly inaccurate in an attempt to describe global changes. ", " >>5018Congratulations, you somehow managed to make a set of proposals that are even more expensive and unlikely to happen than cutting greenhouse gas emissions. ", " >>4504>>Farrell opted to treat climate contrarians as a social movement and searched for the links between all of the key players to gauge their relative influence with politicians and the media.This is really clever, I like it. ", " >>5519He actually didn't. ", " >>5524>large habitats partially underground>>for the sake of animalsNot in your dreams>underwater habitats or farms in the ground habitats>>to safeguard fish speciesDo you really think that this stuff is more likely to happen than cutting (not eliminating, mind you) greenhouse gas emissions? ", " >>5526Climate change is real and non-anthropogenic. You can't stop earth's natural cycles.The compounding cost of \"alternative\" energy sources (besides nuclear) would be much more costly than building underground shelters. ", " I don't care one ounce about climate change because to do anything about it you'd have to wipe India, Africa, and China off the face of the Earth, as they'll have a combined population of 6 billion people by 2050, and they'll be cranking through the most polluting industrial revolution you can possibly conceive.I also don't believe that man is totally responsible for the temperature changing, as it's been happening since the Earth started, and isn't going to stop until it ends. Man is most likely speeding it up, but like I said, unless you genocide most of the toilet countries then you're not going to do anything about it aside from acting like a self-righteous homo. ", " >>5541>>5559Typical Americans ", " >>5562>>>/l/oo ", " >>5562I'm not an American.I am an Australian geologist working for a nuclear non-poliferation company. ", " I'm tired of climate change because of misinformation from both sides of the argument.One side tries to obfuscate the fact that there's a limit to finite resources, and the other side tries to sell me tickets to tomorrow's doomsday flick then constantly push it's release date back-- and don't forget all the alternate energy sources memes like solar highways. ", " >>5567The oil companies see your doubt as something they can capitalize on. You have to consider that it makes business sense for them to debunk whatever a climate scientist comes up with whether because it's all bad for them.It's a matter of all the multinational oil and gas companies combined with coal along with the finest PR and marketing that money can buy vs. 97% of the 1000 climate scientists (who haven't been bought off by BigOil&Coal) that there are in the world and Al Gore. ", " >>5572>the 97% memeIt's based on classification of written papers, and they are very loose on those classifications.Literally debunked a hundred times.Regardless of its actuality,Science doesn't work on consensus.It never has and never will.Otherwise you get dogmatism... oh wait that seems like what it is.By the way, Oil companies have spend only a few hundred million or so \"debunking\" AGW.Governments around the world shill out hundreds of billions for AGW research and development. Why should Oil companies not be able to fund their own research? ", " >>5572>Established businesses vs prospective businesses and businesses under larger conglomeratesThis isn't some fucking hollywood movie where it's the big bad corporation against underdog scientists. It's two vicious dogs fighting over a slab of meat, and it gets really tiring when you realize they'll employ the scumiest methods to get what they want. Don't get me wrong I love rooting for the good guys, but it's not that simple. ", " >>5567>constantly push it's release date backAnon, you really aren't paying attention.The due date has been pushed up radically. 15-20 years ago the prediction was that we might see 3\" or even 8\" increase in sea level by 2100. Now we are already over 7\" and talking about \"hopefully ONLY\" 3 feet by 2100.As recent;y as 2009 we were negotiating international agreements to keep temperature rise under 2°C ... EVER ... and now we're talking about trying to keep it under 4°C by 2100, and many of the goals in the 2009 talks have largely evaporated.We used to talk about trying to keep CO2 under 400 PPM in the atmosphere in the 1980s, then we started talking about keeping it under 450 ppm.Now we are OVER 450 ppm and discussing what will happen when it passes 500 ppm between 2050 and 2060.We used to talk about the serious shit that might start happening around 2100 or even out to 2200.Now we are reporting that serious shit already happening in 2015, and a lot more by 2025 and by 2050.Stop being a retarded dumbshit and pretending that the doomsday date is being pushed back. It's been moving forward at very frightening rates.The real problem is people like you who have no fucking idea what you are talking about, just pulling shit out of your ass, then slapping it into a post and pretending you aren't a retarded child. ", " >>5575> 97% is a meme> Literally debunked a hundred times> LITERALLYPlease do provide links to credible sources.Which, of course, you cannot. But, feel free to at least go through the motions. ", " >>5577The way I see it one side is just reporting science and the other side is trying desperately to save a dinosaur business model. All the government grants for every climate scientist don't equal the amount of money spent on one press spin campaign or lobbying effort. ", " >>5587http://www.wsj.com/articles/SB10001424052702303480304579578462813553136>>5589>the way I see it is one side is trying to collapse a global economy and cause massive ecological damage while running around investing in retarded energy alternatives and the other is providing us with cheap and constant energy supplyYou love to simplify things right?>all the government grants do not equalLiteral bullshit.Governments around the globe spend tens of billions of dollars on \"AGW\" and \"green energy\" research and development. >>5585It is ultimately beyond our control, the tempature rise has been at a constant rate and we've been steadily warming since the last mini ice age.We live in one of the colder periods of history and are no where near the mionian or roman, or midevil warm period.Historically C02 levels have been at unthinkable levels that we could never reach.Climate change is real and non-anthropogenic ", " >>5587Alarmist once again pronouncing their religion from the world stage only to get BTFOd.http://www.forbes.com/sites/jamestaylor/2013/05/30/global-warming-alarmists-caught-doctoring-97-percent-consensus-claims/ ", " >>5585You know what? I am a dumb shit, but what are you? You quote me all of this shit about CO2 emissions and water levels, but then even you're left guessing what and when these things are going to happen.>Now we are reporting that serious shit already happening in 2015, and a lot more by 2025 and by 2050>serious shit happening.I'm being honest with you right now, this shit is confusing and I honestly don't care for one side or the others argument. So please tell me what exactly this \"serious shit\" is?>>5589>spin campaign or lobbying effortBoth sides do this, again, I'd love to see a shift to alternative fuel sources, but it just seems like there's not a lot of solid progress on one end, and the other side provides us with a dependence that everyone can't help but take them up on. ", " >>5597>Governments around the globe spend tens of billions of dollars on \"AGW\" and \"green energy\" research and development.I do not think it's anywhere near tens of billions. Also, I think the oil companies alone earn about that on average per company per year in net profit. Think of what all of them combined along with natural gas and coal. ", " >>5606Natural gas is quite literally the cleanest energy source we have.It doesn't matter what their profits are, governments spending money is practically unlimited nowadays.Your point has zero validity. ", " >>5608Natural Gas is non renewable and extraction takes an increasingly large environmental toll. Don't pretend like they aren't members of The Heartland Institute like all the others. ", " >>5504>There is a term and a limit to which things become scientific facts, or laws.NO THEY FUCKING DON'T YOU FUCKING RETARD. That's not how science works at all. Laws aren't just theories that got older, they cover completely different concepts and a completely different scope. Theories are broader and explain why/how something happens. There is no \"term\" or \"limit\" that will every change evolution or germ theory or global warming theory to a \"law\">There is substantial proof for both of those things, they are age old discussions and generally hold up to constant scrutiny.Germ theory is only a decade older than global warming theory. And global warming theory has held up under scrutiny as well, as evidenced by the fact that nobody can come up with any evidence to contradict it or explain the warming in some other way.>the term isn't global warming anymore m8How can one person be so fucking stupid yet be so sure of himself? Global warming is the process of the globe getting warmer. Climate change is the change in climate that results from the globe getting warmer. They're both still valid terms, climate change refers specifically to the effects of global warming.> the earth's has natural cycles of cooling and heating because of our orbitYes, Milankovitch cycles, which take tens of thousands of years so obviously aren't explaining a few decades of relatively rapid warming. And FYI, multiple things affect the climate. The existence of Milankovitch cycles does not mean the greenhouse effect doesn't exist. So I'm not sure why you believe in Milankovitch cycles yet deny that the greenhouse effect is real. Climate scientists look at all of this and more, such as volcanic activity and changes in solar intensity. Yet these do not explain the current warming (eg, we aren't seeing changes in volcanic activity to correlate with the warming)>>5507just read the above ", " >>5697There hasn't been any accelerated warming in the \"past few decades\"There has been a 0.2 increase in global tempature since 1980? ", " >>5703>>5697Sorry 0.8° since 1880 ", " >>5703We've seen more than 0.5 degree Celsius increase since 1975. That is a very rapid rate of warming on a historical scale. Compared to the 21,000 year and 41,000 year Milankovitch cycles, 40 years is an incredibly short time period, especially given that the rate of warming will increase as GHG concentrations rise. Right now we've got some good news because methane levels have flatlined, but CO2 levels are still increasing ", " what's the verdict /news/Are americans stupid then or is the author stupid? ", " >>5740The author needs a proctoligist to find his head. ", " >>4674The earth's CO2 levels haven't been this high in 650,000 years. As a previous poster had already stated, the rising CO2 levels aren't the only thing giving scientists reason to believe in climate change. ", " >>5807Comparitivly the ppm of C02 has been MUCH MUCH higher than what is now or 650,000 ago that of what is now.Coincidentally the end of the Pleistocene was started about that time.Magic eh? ", " Localized pollution is much more immediate and noticeable than global climate change tbh ", " >>5845The difference is that didn't happen over the span of 100 years like it is now thanks to humans. ", " >>4499the hottest year on record was 0.69 OF ONE DEGREE C hotter than the 20th century averagethat is what they want you to panic about ", " >>5849The holocene isn't ending anytime soon.Those massive changes happened realitivly rapidly because of the closing of the channel between north and South America and the way it affected ocean current. ", " >>5868how would you know that? ", " People are skeptical of climate change because it is never presented as just climate change. It is always packaged with doomsday type scenarios and calls for government led action.CO2 undeniably absorbs more energy from the sun than our current mixture of air. Burning gasoline and oil releases CO2 into the atmosphere which will undeniably warm up the planet. You are going to have a hard time contesting these two facts. On the other hand. these two facts are just about everything we know for sure about climate change (along with equivalent knowledge about the other greenhouse gases). Everything else is an unverified hypothesis.However, when someone says \"Climate change will lead to the polar ice caps melting which will disrupt the oceans currents which will stop the flow of nutrients throughout the sea and earths entire biological ecosystem will take a catastrophic hit\" you should be skeptical. When they then add \"because of this we are going to start taxing you more\" you should be very skeptical. ", " >>5889co2 is plant food, and we are currently at a low level compared to historic levels ", " >>5886By soon I mean a few thousand I think?I can't remeber the calculations; and moronic scientists want to name it the Anthroscene ", " >>5923so you have no idea, fair enough, well done for admitting it ", " >>5927>le epic dismissal*tip* ", " >>5953*noted*well memed ", " >>5957DUDE.WARMING.2015.OIL COMPANIES.RICH.WHITE.EVIL.LMAOMAO ", " >>5575>Why should Oil companies not be able to fund their own research?Why shouldn't you get a raise? ", " >>6300I'm a bit confused.But in my current job?Because I've pretty much classed out within this company until some fucker above me dies or fucks up.Maybe I'll move up if they need a second position but I doubt it. ", " >>5922Well maybe we should stop bulldozing plants and replacing them with poo in loo cities. "]}, "3158": {"op": {"timestamp": 1448838000, "title": "Amazon Prime Air", "comment": " http://www.popsci.com/amazon-shows-off-new-hybrid-delivery-drones-with-top-gears-clarkson>As far-fetched as it sounds, the era of drones delivering packages is about to begin, according to Amazon.>Earlier today, the company released a new ad on YouTube showing an all new \"hybrid\" drone design that can switch between vertical and horizontal flight.>earlier this year, the company sparred with the FAA over delivery regulations. Amazon, as well as Google and several other companies, were recently part of an FAA task force to figure out drone registration rules.So what's gonna happen when these things pick up? Think they'll get culturally enriched and looted out of the sky? Think this is going to be used to get the public used to drones overhead? "}, "replies": [" Back to the Future 2 promised us laser lights, easy time travel, real futurism... Here we're excited over helicopter delivery... ", " I wonder what happens when one malfunctions and lands/crashes on some random person's yard. Does Amazon have a right to enter your property to retrieve it? Are you under any obligation to report it or assist in recovering it? ", " >>3158I thought it was announced that amazon wasn't allowed to do this. ", " >Think they'll get culturally enriched and looted out of the skyI wish the mods made a point to remove /pol/ buzzphrases from this boardI would actually quite love it if drone piracy rings started developing, it's cyberpunk-esque as fuck ", " >>3191Amazon has its lobbiests ", " All of the top retailers failed to compete with Amazon's prices this Black Friday. This spells disaster for physical stores... Even the biggest one.Could Amazon be a legitimate threat to economic stability? ", " >>3199There's always the option of filtering out words like Dindu, Happening, etc.>>3161Science fiction always subscribed to an optimistic timescale. We did eventually invent cellphones and solar panels, so we can confirm reality imitates Star Trek. ", " >>3158I only buy stuff from Amazon now. I look forward to when Amazon is the only store in the world. The prices are so low. The feeling of small businesses unable to compete and closing up makes my peeny weeny tingle. ", " >>3211Do you think their prices will remain low if there are no competitors? ", " >>3212Of course. Jeff Bezos has promised us that prices will always be low, and Jeff Bezos always keeps his promises. ", " >>3215Just like Valve Software. ", " If this ends up being successful do you think UPS and FedEx will be forced compensate somehow? ", " >>3199>implying he inst bringing up a legitimate concern>implying you're not butthurt ", " >>3219>implying the biggest delivery companies in the U.S wont make their own drones ", " >>3211Hopefully Amazon can keep a drone shipping monopoly.I'm jacking off now to that. What a clusterfuck. ", " >>3199Its not racist because it's real, negroes simply are more likely to theve. ", " They could just route the delivery paths around problem areas, that's the magic of air travel ", " >>3357The drone still has to land to deliver the product. That's when it's most vulnerable. ", " >>3206No. Natural monopolies are good for society and anyone who claims otherwise is a commie. ", " >>3345not even wrong ", " >>3459did you stroke out dude? natural monopolies are bad news for the consumer, they allow businesses to stagnate, and don't encourage competition, and as they say, competition breeds innovation. ", " >>3188Well, what happens when any other type of aircraft crash lands on your property? Do you own a helicopter that makes an emergency landing in your back yard? ", " >>3490Yes ", " >>3502The correct answer was no. ", " >>3459Monopolies are anti-capitalism as fuck, in fact they more closely resemble the gommie model where the government owns everything and the consumer is left without a choice. ", " >be Amazon drone operator delivering dragon dildos>have to dodge a danmaku of rocks, paintballs, bbs, and the occasional real bullet every dayWhere do I sign up? ", " >>3507No ", " Where's this gonna be happening?NYCI hope it's NYC ", " >>3215Nine iPhone versions were created after Jobs died. Not a good argument. ", " >>3511Sounds really fun, actually. ", " >>3511Have fun trying to dodge me when I launch my own attack drone. I'm gonna build one hell of a captured drone collection when Amazon unleashes those babies. ", " >>3158When this launches I'll be the first skypirate. ", " >>3158What do I study to become knowledgeable enough to be a drone pirate? ", " >>3508Key word being natural in that anons post.As long as there is no force barring the entry of other potential competitors into the market, it works fine. If the monopolies rose to power by consumer choice (based on a superior product, value, etc.) why is that considered a bad thing? ", " >>4706Because it's bad for consumers. Competition drives prices down and spurs innovation. ", " >>4841Did you not bother to read my post at all? ", " >>4078operating a flak cannon ", " >>5735Do you understand that once a company attains a monopoly through \"superior products\" or \"value\" they have no incentive to maintain either? ", " >>3511I just realized that this could be a job where being a good videogamer would actually be a good thing to put on your resume.Companies scouting out people in Rocket League tourneys or something to find the best peopleBoom, now they contribute to society, SJWs. "]}, "5830": {"op": {"timestamp": 1449097200, "title": "On writing and politics", "comment": " http://www.highexistence.com/george-orwell-on-the-7-ways-politicians-abuse-language-to-deceive-you-and-how-to-make-it-stop/Apologies for the /he/ link, it's the only place I could find the article "}, "replies": [" Wow, George Orwell has really changed since 1984 ", " >>5830https://www.youtube.com/watch?v=SPU4lWFWmiY>>5840>nineteen hundred and eighty four was one thousand, eight hundred and four years agomatters very deeply ", " Not news. ", " >>5884Politicians keep on deceiving us though... "]}, "4691": {"op": {"timestamp": 1449010800, "title": "The Peculiar Ascent of Bill Murray to Secular Saint", "comment": " http://www.nytimes.com/2015/12/04/fashion/mens-style/the-peculiar-ascent-of-bill-murray-to-secular-saint.html "}, "replies": [" >>4691Stop changing your IP to get past the 5 post rule. ", " >>4738But NYTBot is our best poster out there! ", " >>4781But robots can't get past the captcha can they? Robots can't lie, after all! "]}, "1585": {"op": {"timestamp": 1448751600, "title": "Russia is imposing sanctions on Turkey", "comment": " http://www.theguardian.com/world/2015/nov/26/hollandes-anti-isis-talks-with-putin-complicated-by-downing-of-russian-jet "}, "replies": [" >ProofsReally not sure who's at fault here. I think it will be along time before we can determine what was happening behind the scenes.I know Russia likes to test the waters with flying through other countries air space, but so does everyone else. Russia posed 0 threat to Turkey. ", " DAILY REMINDER THAT TURKEY LITERALLY VIOLATED BASICALLY EVERY SINGLE NATO PROTOCOL ON AIRCRAFT INTERCEPTION. I'M IN WRITING IN CAPS BECAUSE THIS IS VERY IMPORTANT. HERE'S THE EXTRACT FROM NATO'S ARTICLES ON AIRCRAFT INTERCEPTION: \"IF THE AIRCRAFT IS ON AN EXIT COURSE OF AN EXTREMELY NARROW BAND OF AIRSPACE, INTERCEPTION IS UNCALLED FORAT THE HALFWAY POINT, AN AIRCRAFT ENCROACHING UPON AIRSPACE IF ON AN EXIT COURSE, HAS COMPLIED WITH WARNINGS AND ORDERS AND CANNOT BE FIRED UPONTHE MINUTE THE AIRCRAFT IS OUT OF YOUR AIRSPACE, IT CANNOT BE FIRED UPON AND YOU MUST TURN AROUND AND GO HOMEIF YOU KNOW THE PURPOSE OF AN AIRCRAFT OPERATING CLOSE TO THE BORDER, ACCIDENTAL ENCROACHMENT IS ALLOWED AND NECESSITATES NO SCRAMBLE OR INTERCEPTION, UNLESS THE AIRCRAFT IS ON A PATH INTO YOUR COUNTRY WITH NO DEFINED EXIT POINT. IF THE AIRCRAFT IS MILITARY AND CLEARLY ARMED, AN AIRBORNE SENTRY CONSISTING OF AN INTERCEPTION SQUADRON IS ENCOURAGED TO FLY A HOLDING PATTERN ALONG THE BORDER FOR QUICK TURNAROUND. (NOTE, THAT DOESNT HAVE SHOOTDOWN OR EVEN RADAR LOCK ANYWHERE IN THE DEFINITION OF TURN AROUND)DO NOT FIRE UPON AN AIRCRAFT THAT IS LEAVING OR HAS LEFT AIRSPACE. IT IS AN ACT OF WAR THAT BARS YOU FROM INCITING ARTICLE 5, AS NATO IS A DEFENSIVE MILITARY ORGANIZATION AND ARTICLE 5 ONLY COVERS A NATION ATTACKING A NATO COUNTRY WITHOUT DIRECT PROVOCATION OF THAT COUNTRY, OR AN OBJECTIVE ACT OF WAR AGAINST YOUR NOW PRESENT AGGRESSOR. YOU MUST VISUALLY INTERCEPT THE AIRCRAFT AND HAVE VISUAL CONTACT WITH THE PILOT\"ALSO THIS >>1631and you should blame russia a bit tbh. who sends an old ground attack aircraft like the SU-24 flying arround like that without SU27 escort. ", " >>1683>implying turks care>implying obama cares ", " >>1631>Really not sure who's at fault hereTurkey has been pushing the limits for a while here. They help fund the groups that work against Russia and then they shoot down one of their planes? ", " I feel like this shit was blown up by retards in social media with all these \"WW3 IZ COEMING JEEZUS\" posts. Turkey shot down a Russian carrier, which allegedly was in Turkey's airspace. Yeah, it probably violated a bunch of NATO policies, but that is why there is an emergency meeting to whip some kebab ass for goofing. Russia will probably continue to deny shit, cry loudly and maybe set some sanctions, but who gives a fuck? Its another fucking continent. And no, the idea of WW3 is just stupid. NotLikeThis.Tl;dr this shit doesnt matter/thread ", " >>1683russians are not nato ", " >>1585remove t*rkroach ", " >>2828What difference does that make? ", " >>2830Rude! ", " >>3059Are you retarded? ", " >>3088no ,are you? ", " >>16831. Turkey can already cite Article 5 for the refugee crisis in Syria.2. Turkey is not and is not intending to cite Article 5 in this instance.3. Turkey's RoE in regards to its airspace are its own to set and enforce, not NATO's4. If Turkey had made its RoE known to the Russians, previously warned the Russians multiple times, and even shot down unmanned drones then what reason would Turkey have to expect that it was Russia in violation?5. Since it doesn't seem that there was any misunderstanding on Russia's part and the violation was intentional, then it must follow that Russia's war is currently being fought by idiots and/or scum that wanted to provoke Turkey into attacking.6. Russia's planned embargo against Turkey is a violation of multiple free trade agreements and combined with habitual border incursions, unilateral suspension of public diplomacy, and violent + malicious state rhetoric they constitute grounds to cite Article 5.It would seem to me that Russia is asking for it. Hollande knows Assad is prohibiting all political solitions in Syria and Iraq, and that IS can not be defeated as long as he exists in office. He also knows that without Russian air power Assad would not last another year. It would be perfectly reasonable for the existing anti-IS coalition to impose a no-fly zone over northern Syria and enable the local nationals to survive free of IS and Assad imposed terror. If these forces decide to mount an offensive against a particular Damascus based warlord, then that would be a Syrian prerogative. ", " >>3059Since you are retarded I'll have to spell it out:Nato is a defensive pact, by violating its terms by shooting down a craft that posed no threat while leaving their airspace, Turkey should legally deserve no protection under article 5 when Russia comes for retribution as what they did was legally an act of war. ", " >>3106whoops, this was for>>2828>>3088 ", " >>3106You're misunderstanding the text, then. Russian is not given a Cart Blanche to do whatever it pleases and Turkey may still invoke Article 5 for this or any number of real or perceived threats emanating from Russia or Russian interests.It would behoove actual Russian policy makers to understand this. ", " Fucking manlets. When will they learn? ", " >\"a short-term border violation can never be a pretext for an attack\" - Erdogan in 2012Fast forward 3 years>Erdogan authorizes attack against Russian jet for violating airspace for only 17 secondsHow any one can defend these two-faced faggots is beyond me.Coincidentally, Turkey has also been much more careful about violating Greek air space, which it did all the time prior to this. ", " >>1585>Russian tourists with disposable income>Russian state not more concerned with its citizens running away to a better life in Europe with the Syrians ", " >>3145The only people defending Turkey are Turkish nationalists. You have to be completely insensitive to every nation that has fallen victim to Turkey to defend Turkey's actions. ", " RUSSIA IT IS TIME TO REMOVE KEBAB ", " >>1585BASEDASEDfuck emfuck em right in the ass Russia, we know turks like that kind of stuff ", " >>3145>>3226>Russian nationalists believe that>>1585Russia has luck that there is something called the treaty of Lausanne ", " >>3533sup Turkroach ", " >>3533I would rather side with Russians than muslims "]}, "4469": {"op": {"timestamp": 1449010800, "title": "conspiratorial ideation", "comment": " On the reception and detection of pseudo-profound bullshit: New study has found that people who are more susceptible to bullshit score lower for verbal and fluid intelligence, are more prone to conspiratorial ideation, and more likely to endorse complementary and alternative medicine.http://www.geneticliteracyproject.org/2015/12/01/deepak-chopra-alert-psychologists-assess-bullshit-detecting-senses/>people who are more susceptible to bullshit score lower for verbal and fluid intelligence, are more prone to conspiratorial ideation, and more likely to endorse complementary and alternative medicine.>people who are more susceptible to bullshit score lower for verbal and fluid intelligence "}, "replies": [" >>4469>susceptible to bullshitWhat type of \"bullshit\" are you referring to? Also, not trying to complain, but I would be interested in seeing a backup source if you have one. I could just search myself otherwise. ", " >>4471did you try reading the link? ", " >>4473I keep getting 'Connection reset by peer' when I try. ", " Thoroughly enjoyed that. Thanks OP. "]}, "3827": {"op": {"timestamp": 1448924400, "title": "Real News", "comment": " https://www.4chan.org/4channews.phpHave you heard the news? "}, "replies": [" >>3827This is a positive development from this board indeed. ", " >>3827Wow, fascinating ", " https://www.4chan.org/4channews.php?all#oldnewsThis one is better "]}, "4065": {"op": {"timestamp": 1448924400, "title": "Frustrated Gunman Can’t Believe How Far He Has To Drive To Find Nearest Planned Parenthood Clinic", "comment": " Oh great, another boardWonder how long until board deletions starthttp://www.theonion.com/article/frustrated-gunman-cant-believe-how-far-he-has-driv-51923 "}, "replies": [" >>4065>can't handle new boardsWhat's wrong Moshe, triggered much? ", " >>4113Lmao really/pol/ was flooded with news bsHard to telling where cucking stopped and reality started ", " >>4113>>4120just a manner of speech, relax "]}, "4020": {"op": {"timestamp": 1448924400, "title": "Kylo kills Han, Kylo is the son of Han and Leia", "comment": " Kylo Ren arrives. The gang is on the ramparts of the Castle, and they are cornered. There’s no way out. Han Solo decides to personally confront Kylo Ren, as a means of protecting the others. Finn, Rey, and Chewbacca stop in their tracks. They watch as Han Solo speaks to Kylo Ren, who is most likely his son. Han may try to reason with him. Talk him off the ledge. Suddenly, Kylo Ren silences the conversation with Han Solo forever. He murders Han, his likely father, in cold blood. Leia senses his death through the Force. http://makingstarwars.net/2015/05/a-compiled-synopsis-of-star-wars-the-force-awakens/ "}, "replies": [" So this movie IS shit. Thanks, Anon! ", " >tfw you will never see jar jar's great adventure ", " Yeah, makes sense. Harrison Ford probably only wanted one picture, plus it'll give an Obi Wan parallel with sacrificing himself, and we all know they're sucking the OT's dick for all it's worth. "]}, "3574": {"op": {"timestamp": 1448838000, "title": "The University of Lefties", "comment": " Professor Antony Glees, an expert on counter-terrorism at the University of Buckingham, has said that universities are becoming increasingly intolerant of non-leftwing opinions, threatening free speech.At a recent panel discussion he expressed his support for the Tory's \"Prevent\" counter-terrorism strategy; for which students and lecturers called him a racist. Glees also said that the Israeli ambassador should be allowed to speak at universities; a student replied by calling Glees: “white, male, colonialist, Zionist and racist.\" Prof Glees suggests that the internet is allowing for increased self-absorption, explaining why many students do not tolerate the opinions of others.Students at both the University of Cardiff and Oxford University recently tried to ban Germaine Greer for saying that a transgender woman is not a genuine woman. Lucy Delaney, Oxford student union's vice-president for women, said: “We should condemn the Oxford Union’s decision to invite Greer and Hitchens. These speakers’ ideas are not “contentious” – they are violent.“http://www.breitbart.com/london/2015/11/30/universities-dominated-by-left-wing-hate-mobs-says-professor/...Thinking a mtf trans isn't a real woman is \"violent\"....I don't see why the Right don't turn this back around on the Left. Every time they shut down free speech, call them violent; every time they point out that someone is white, male, etc., call them violent, etc. "}, "replies": [" Reported for violent post. ", " >>3574>http://www.breitbart.com ", " >Glees also said that the Israeli ambassador should be allowed to speak at universities; a student replied by calling Glees: “white, male, colonialist, Zionist and racist.\"And WE'RE the nazis, eh?Anyway, we all know the left is increasingly moving towards a more authoritarian streak and they do have a stronghold on most opinion-making outlets. There's really no easy answers other than keep being intransigent on the defense of free speech and hoping the population at large won't forget its value. ", " >>3574>breitbartGood luck with your clickbait. ", " >>3574>White>ZionistYeah alright. Notwithstanding it is the result of the left since the 60s during their counter culture movement. What happens when you have a quarter of generation of people protest to upend traditions and cultural homogeneity without success? They move into violence or they play the long game of a cultural revolution backed by finances and organization skill by the USSR (Stanislav Lunev, Through the Eyes of the Enemy: The Autobiography of Stanislav Lunev). This a common thing, we see it in Europe and the Americas. Today's leftist is nothing but a bought and paid ideology designed to destroy the west stemming from the cold war. Equality became revolution. Even if you look into what Kate Millet and her cronies pushed during the 60s you'll note it's nothing but garbage focused on destroying the west. Through Kate Millet's own words we can mirror what the left wanted that's still playing out today:\"Why are we here today?\" she asked.\"To make revolution,\" they answered.\"What kind of revolution?\" she replied.\"The Cultural Revolution,\" they chanted.“And how do we make Cultural Revolution?\" she demanded.\"By destroying the American family!\" they answered.\"How do we destroy the family?\" she came back.\"By destroying the American Patriarch,\" they cried exuberantly.\"And how do we destroy the American Patriarch?” she replied.\"By taking away his power!\"\"How do we do that?\"\"By destroying monogamy!\" they shouted.\"How can we destroy monogamy?\"Their answer left me dumbstruck, breathless, disbelieving my ears. Was I on planet earth? Who were these people?\"By promoting promiscuity, eroticism, prostitution and homosexuality!\" they resounded. That and along the 13 Rules for Radicals creates an atmosphere of stupidity that we see today through marginalization and ridicule plays coupled with this toxic ideology. ", " >>3648nice copypastahttps://www.reddit.com/r/TiADiscussion/comments/2lfgqi/so_there_was_this_zany_feminist_conspiracy/ ", " >>3653That's the best thing you have to deflect this argument is calling copy pasta to what Mallory Millet stated about Kate Millet- the chief architect of the 2nd wave feminism and leader of counter culture? Poor form kid, 0/10 would not squat with. ", " >>3659I'm not trying to argue, I'm complimenting your source material. I'm not sure I understand you're defensiveness. Were you expecting an argument? ", " >>3662Not him but you must be new. Calling out copypasta is a standard 4chan argument. You can't claim you weren't arguing whilst also linking to reddit. ", " >>3574Honestly, he's half right. Kids are more impudent today, but professors are also less equipped to handle them. Your concluding though \"i don't see why the Right doesn't turn this back around on the Left.\" is right on the money.Kids are not suddenly feral and radical; they're as stupid and malleable as ever. If they want to make everything into a mobilization race then kill them on their retarded hill, where they stand.Releasing these students out into the workforce is a greater violence. ", " >>3574>a student replied by calling Glees: “white, male, colonialist, Zionist and racist.\"God damn liberals LOVE their labels. Still waiting for the day when they all get told to fuck off just to see the panic on their faces when they realize nobody is afraid of their labels. ", " >>3574>threatening free speechYou can freely say what ever the fuck you like. Other people don't have to listen. ", " Pointless black and white, left and right baiting. The kids on campus aren't advocating for leftist talking points or ideals, they're trying to push an authoritarian clusterfuck of an ideology and most of all trying to shout down anyone who questions it. ", " >>3707You ever been on a college campus?You best fucking shut your mouth if you don't wanna get in trouble for having the wrong opinions. ", " >>3712>The kids on campus aren't advocating for leftist talking points or idealsThese people are the left now, whether or not anyone wants to admit it. They're the future of the ideology. ", " >>3653>Reddit ", " >>3718Well I'm at uni now so yeah. This is all coming over as people getting hurt feelings when other people use their free speech to mock and ridicule them. ", " >>3727The thing is, it's not just \"mocking\" and \"ridiculing\", it really is getting down to the point of where if you have the wrong opinions, you're not welcome. Not even the professors are safe. ", " >>3734The universities have made their bed, and now they must lie in it. I have no sympathy for them. ", " >>3748That is true, they're the ones who bred this mindset. I'm not gonna lie, it's fun to see them starting to lose control of the beast they created, but at the same time, that shit is slowly starting to leak into the real world, which makes it our problem too. ", " >Liberal institutions cease to be liberal as soon as they are attained: later on, there are no worse and no more thorough injurers of freedom than liberal institutions. ", " >>3574>breitbartNope ", " >>3574>Zionist and racistYeah bring that to /pol/ and see what they think ", " >that tfw when you can't report posts for wrongthink yetHIRO PLEASE HURRY BEFORE MY PTSD FROM HAVING MY DEEPLY HELD BELIEFS THAT OTHER PEOPLE TOLD ME WERE CORRECT IS TRIGGEREDPROBLEMATIIIIIIIIIIIIIIIIIIIIIIC "]}, "3457": {"op": {"timestamp": 1448838000, "title": "Hi leddit", "comment": " https://www.reddit.com/r/worldnews/ "}, "replies": [" >>3457/pol/ is always rightno exceptions ", " I'll post fake news sites in herethanks Heero ", " >>3457For all sad words of tongue or pen, the saddest are these/pol/ was right again ", " >>3457holy fucking shit. get a load of these retards.https://www.reddit.com/r/worldnews/comments/3uugrv/newspaper_draws_piggy_bank_to_show_isis_funding/we were talking about shooping isis into pigs earlier. turns out muslims will still riot and leftists will still whinge about it.what the fuck is wrong with the world today in that you cannot even insult nazis if they aren't white? "]}, "3167": {"op": {"timestamp": 1448838000, "title": "/pol/ Browser Unjustly Block on Twitter by POTUS", "comment": " Read more here,>>>/pol/57076169POTUS' Twitter if you'd like to complain,https://twitter.com/potus?lang=en "}, "replies": [" >>3167As if Donald Trump isn't going to be way WORSE on that front...Anyhoo, nobody cares about /pol/ posters so that OP doesn't have to worry about getting v& ", " This actually happened in real life. Obama is LITERALLY blocking /pol/ users, when will this blatant censorship end?Great post OP you fucking faggot. ", " >>3167>uses a thread on /pol/ as a news source>an obviously fake \"story\" that even the posters in the /pol/ thread are calling out as BS>and then to raise a personal army to raid a fucking twitter feedGet the fuck off this board. ", " >>3333 ", " >>3167>why are you so worried about /pol/ taking over this board?They said>surely /pol/ will contribute good, quality discussion and only cite legitimate news sourcesThey said ", " >>3234>if you think the topic is spam, sage and hideThey said>if you don't like the content, post your ownThey said ", " >>3234>/pol/ is one person "]}, "191": {"op": {"timestamp": 1448665200, "title": "Rainer Winkler nominated as \"Man of the year\"", "comment": " http://www.shz.de/lokales/schleswiger-nachrichten/kandidat-3-prof-rainer-winkler-id11122826.html "}, "replies": [" du dummer hurensohn ", " >>198alder du scheiss haider jaich blocke dich immer aber du kommst immer wiederdas kann doch nicht sein hier so eine scheissenur weil ich kein iphone habe ", " dassa etzalla abba bure Browogadsion ", " >>210What are you talking about? ", " I agree ", " >>191This isn't remotely news ", " He should win "]}, "2502": {"op": {"timestamp": 1448751600, "title": "Meanwhile, on [s4s]...", "comment": " Last we saw, [s4s] was quacking us up with their IS duck photoshops.http://www.theguardian.com/world/2015/nov/28/isis-fighters-rubber-ducks-reddit-4chanTheir antics have certainly gotten us riled up, but, you know, whatever floats their boat.In other news, [s4s] has received possibly one of the greatest GETS in 4chan history. >pic >>>/s4s/3955555 Could this beat the Goku get on /mlp/? "}, "replies": [" you're my least favorite namefigplease just stop ", " >>2508THIS INFORMATION MUST SPREAD FAR AND WIDE ", " >>2502simbly ebik ", " >>2502sticky this ", " >>2502Silian Rail is a nice looking font... "]}, "2366": {"op": {"timestamp": 1448751600, "title": "Hilarious video of man's reaction to eating Patti LaBelle pie goes viral", "comment": " >CHICAGO (FOX 32 News) - A video review of sweet potato pies is absolutely hilarious and breaking the Internet.>James Wright, who is clearly a fan of Patti LaBelle, sang the praises of her baking skills after trying out her pies which are sold at Walmart.>He goes on to sing more songs, taste more pie and even do some dancing. The video has been seen more than 2.7 million times.>Even LaBelle shared the video on her Facebook and Twitter pages.http://www.foxla.com/news/50226361-story "}, "replies": [" >>2366>breaking the internetPls stop ", " LOL "]}, "2258": {"op": {"timestamp": 1448751600, "title": "Una \"cámara vacía\" en la tumba de Tutankamón podría conducir al hallazgo de Nefertiti", "comment": " >Los primeros análisis en la tumba del faraón Tutankamón en Luxor indican la existencia de algo que \"podría ser una cámara vacía\", según ha informado a EFE el jefe del Departamento de Antigüedades egipcio, Mahmud Afifi.>\"Hasta ahora el resultado principal es que hay algo, aunque todavía es desconocido, detrás de la parte este del muro norte de la tumba\", dijo Afifi en una conversación telefónica>Un hecho que eleva las posibilidades de que en este pasaje se pueda encontrar la tumba de la reina Nefertiti, aunque habrá que esperar para conocer el resultado de los análisis de los datos, que serán estudiados en Japón.¿Qué piensas?http://www.rtve.es/noticias/20151128/camara-vacia-tumba-tutankamon-podria-conducir-hallazgo-nefertiti/1264045.shtml "}, "replies": [" >>2258En Inglés por favor Pablo.Also build wall ", " Are they speaking Ancient Egyptian?! "]}, "1825": {"op": {"timestamp": 1448751600, "title": "Silco Theater Nears Completion", "comment": " The old Silco theater is getting close to being restored:http://www.scsun-news.com/story/news/2015/11/28/silco-theater-nears-completion/76320694/ "}, "replies": [" >>1825Impressive. ", " >>1825░░░░░░▄▄▀▀▀▀▄▄▄░░░░░░░░░░░░░░░░░░░░░░░░░░░▄▀░░░░░░░░░▀▀▀▄░░░░░░░░░░░░░░░░░░░░░░▌░░░░░░░░░░░░░░░▀▀▄░░░░░░░░░░░░░░░░░░▌░░░░░░░░░░░░░░░░░░░▀▄▄▀▀▀▄░░░░░░░░░░▌░░░░░░░░░░░░░░░░░░░░░░░░░░░▀▄░░░░░░░▐░░░░░░░░░░░░░░░░░░░░░░░░░░░▄░▐░░░░░░░▐░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▌░░░░░░░▌░░░░░░░░░░░░░░░░░░░░░▄▀▀▄▄▄▄█▄░░░░░░░░▌░░░░░░░░░░░░░░░░░▄▄▀░░░░░░░▀█▄░░░░░░░▐░░░░░░░▄▄░░░░▄▄▄▀░░░░░░░░░░░░▀█▄░░░░░░▐▒░░▄░█░░▀▀▀▀░░░░░░░░░░░░░░░░░░▀█░░░░░░▐▒▐▐▒▌░░░░░░░░░░░░░░░░░░░░░░░░░░█░░░░░░▌▒▌▌▐▄▄▄░░░░░░░░░░░░░░░░░░░░░░░░█░░░░░▐▒▐▀▄▄▀▄█▄░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▀▄▀▄▄▀░░░░░░░░░░░░░░░░░░░░░░░░░░kiwi or benis?u be the judge "]}, "1785": {"op": {"timestamp": 1448751600, "title": "Question", "comment": " Does anyone remember when this board wasn't cancer?http://www.webmd.com/cancer/default.htm "}, "replies": [" This board was perfect until 11 hours and 9 minutes ago. ", " >>1807nice i hate the cancer thats killing /news/ ", " >not even 2k posts yetThis is the most fucking stupid idea I've ever seen. ", " >>1814u wot m8? ", " >>1814>Stupid people>On 4chan.You mean this website wasn't designed so that the planets biggest failures didn't shit up other, better websites with their bullshit? ", " cancer since number >>1 ", " >>1>>2>>3>>4>>5>>6>>7 ", " is this thread as dead as this board? ", " >>1867This is one of the liveliest threads on all of /news/. ", " I like this board. I can see it becoming a sfw /pol/Sometime I just want me the news and not the other shit that comes with it. ", " >>2035>Sometime I just want me the news and not the other shit that comes with it.Why don't you just go on a news site? ", " >>2046I like the 4chan layout. It's nice and convient to me and doesn't have shitty ads. This might be alot like Google News, but I come to 4chan more. ", " >>2046>go on a news siteThis is now a news site, or at least a re-aggregator.we drudgereport now. ", " >>2048get an rss feed going. that's basically what this board is except it's not made for you ", " >>2050>re-alligatorAfrica doesn't have any news site though... ", " >>1785░░░░░░▄▄▀▀▀▀▄▄▄░░░░░░░░░░░░░░░░░░░░░░░░░░░▄▀░░░░░░░░░▀▀▀▄░░░░░░░░░░░░░░░░░░░░░░▌░░░░░░░░░░░░░░░▀▀▄░░░░░░░░░░░░░░░░░░▌░░░░░░░░░░░░░░░░░░░▀▄▄▀▀▀▄░░░░░░░░░░▌░░░░░░░░░░░░░░░░░░░░░░░░░░░▀▄░░░░░░░▐░░░░░░░░░░░░░░░░░░░░░░░░░░░▄░▐░░░░░░░▐░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▌░░░░░░░▌░░░░░░░░░░░░░░░░░░░░░▄▀▀▄▄▄▄█▄░░░░░░░░▌░░░░░░░░░░░░░░░░░▄▄▀░░░░░░░▀█▄░░░░░░░▐░░░░░░░▄▄░░░░▄▄▄▀░░░░░░░░░░░░▀█▄░░░░░░▐▒░░▄░█░░▀▀▀▀░░░░░░░░░░░░░░░░░░▀█░░░░░░▐▒▐▐▒▌░░░░░░░░░░░░░░░░░░░░░░░░░░█░░░░░░▌▒▌▌▐▄▄▄░░░░░░░░░░░░░░░░░░░░░░░░█░░░░░▐▒▐▀▄▄▀▄█▄░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▀▄▀▄▄▀░░░░░░░░░░░░░░░░░░░░░░░░░░kiwi or benis?u be the judge "]}, "1586": {"op": {"timestamp": 1448751600, "title": "Some Chipotle customers say undeterred by E. coli outbreak", "comment": " http://www.reuters.com/article/2015/11/21/us-chipotle-mexican-ecoli-customers-idUSKCN0TA0X720151121 "}, "replies": [" They deserve to death by shitting out your innards.Paying that much for a burrito that's like 99% rice? ", " >>1597Don't worry, Chipotle is cutting edge. ", " Anyone remember the Chipolte cat killer? ", " >>1586Lol, I pass by that Chipotle every day. There's usually huge alternating groups of hipster and Arabs that hang out outside, and it's kinda weird for me to see the façade of the place without them. ", " >>1597>RiceTHE FUCK? ", " >>1586Well you know, once they find the source it's back to being just as dangerous as anywhere elseAll the e. coli these days is coming from the greens, it's not like they're cross-contaminating their shit. "]}, "839": {"op": {"timestamp": 1448665200, "title": "Prominant Kurdish Lawyer Assassinated in SW Turkey; Officials Downplay", "comment": " http://www.reuters.com/article/2015/11/28/turkey-kurds-lawyer-idUSL8N13N06E20151128* Kurdish party says lawyer assassinated* PM says he may have been caught in crossfire* Two policemen reported dead* Investigators inspecting scene come under fire* Police disperse hundreds marching in Istanbul (Adds police surveillance footage)>By Seyhmus Cakan>DIYARBAKIR, Turkey, Nov 28 A prominent Kurdish lawyer and rights activist was shot in the head and killed in a street shootout on Saturday, an incident likely to fuel further unrest in Turkey's mostly Kurdish southeast.>The pro-Kurdish HDP Party called the killing of Tahir Elci a \"planned assassination\" and urged people to protest. Prime Minister Ahmet Davutoglu said it was unclear whether Elci was caught in crossfire or assassinated.>Hours later, police fired tear gas and water cannon to disperse hundreds of people marching in Istanbul to protest against the killing. The marchers chanted: \"Shoulder to shoulder against fascism,\" and \"Tahir Elci is immortal.\"Looks like they've gone and made a martyr out of the guy. Independent Kurdistan when? "}, "replies": [" >>839>Independent Kurdistan when?You think they have a choice or something? ", " >>946If they had American and European backing then it might have chance of happening. It isn't like the elected government of Iraq can do anything about it. Really only the Turks and ISIS stand in their way.That said I wouldn't expect Turkey to give up any land to a hypothetical new Kurdish nationstate, even under American and NATO pressure. That's what some Kurds are fighting for though. "]}, "908": {"op": {"timestamp": 1448665200, "title": "South Korea Trains Student Hackers to Fight NK Cyber Army", "comment": " http://www.ndtv.com/world-news/south-korea-trains-student-hackers-to-fight-kims-cyber-unit-1248594>In a darkened \"war room,\" dozens of South Korea's brightest college students are practicing hacking one another as part of a government program to train them to battle some of the world's best -- the shadowy techno-soldiers of Kim Jong Un's regime.>To build its defenses, President Park Geun Hye's government has enlisted 120 of the country's most talented young programmers, offering full scholarships in return for seven years of military service. While the hackers of the Kim regime may be best known for their link to last year's attack on Sony Pictures Entertainment, their primary target remains South Korea, with the two countries technically still at war more than 60 years after the conflict that sealed their division.>The urgency to train \"white,\" or ethical, hackers is rising as industrialized nations try to safeguard digital information vital to national security and infrastructure, while combating cyber crime that is estimated to cost over $400 billion a year globally. South Korea's experience fending off the North has made the country a global player in cyber defense. Mitigating future damage still remains a challenge for Seoul's military hackers as the North's attacks become more sophisticated. "}, "replies": [" Why is the room darkened?That's not good for the eyes. ", " >>926That's a good point actually. You'd think they would know that. ", " Isn't South Korea the country that requires internet to be shut off for people at certain times? ", " >>908>fighting against best koreafor what purpose? ", " >>1144Do you have an article about his? I had never heard this before. ", " >>1147The DPRK is attacking the SK government sites constantly, or so the western press says in general. ", " >>1255A bunch of ancient Dell laptops running LOIC? ", " >>1295I bet they could get anything modern through a third party vendor in Finland or some other neutral country. Their government does have some money to spend and nowhere to spend it. It isn't like they are going to spend it on the basics for the NK people. ", " The most important part of the article>'White' hackers are ethical hacks>implies 'black' hackers are unethical>triggered #blacklivesmatter ", " >>1310Are you implying you are actually #fffffff?White and black have been used to denote good and bad even before Africa was rediscovered by Europe.It's about day and night, not skin color. ", " Do we this stuff in the states. Look up the CCDC ", " >>1325>not skin colorYeah, you whiteys never do nuffin. It might not be about skin color now but it was. ", " >>908StarCraft irl "]}, "1161": {"op": {"timestamp": 1448665200, "title": "JUST", "comment": " http://www.fuck.com/ "}, "replies": [" MY ", " SHIT ", " UP ", " >>1161>>1165>>1168>>1169WE DID IT REDDIT ", " This board is literally reddit, ngl. "]}, "1027": {"op": {"timestamp": 1448665200, "title": "The Game Penis Photos: Going, Going... Soon to Be Gone", "comment": " http://www.thehollywoodgossip.com/2015/11/the-game-penis-photos-going-going-soon-to-be-gone/>By the time you read this, Instagram may have removed photos of The Game's penis from the rapper's scantily-clad account>About three weeks ago, the tattoo-filled rapper shared a couple of intimate photos that even Kylie Jenner might find too racy.>We’d show them to you here, but if they are too X-rated for Instagram, they are too X-rated for The Hollywood Gossip. The pictures depict a shirtless Game in nothing but boxer briefs, showing off his arms, his pecs and his impressive male unit... covered up by said boxer briefs, at least.>Despite the lack of actual nudity, the images have been flagged enough times that TMZ reports they will soon be taken down by the Instagram Powers That Be. If The Game refuses to delete the pictures, the social media service will likely suspend his account. So it looks like The Game and Miley Cyrus have something in common.>The latter has been fighting to #FreetheNipple on Instagram for months now. We can only imagine the former will soon start pushing folks to #freethejunkThis story just broke on the news wire a bit ago. "}, "replies": [" Not sure about your source on this.That said this sets an interesting prescedent for censorship on insta. Is his account private? ", " >>1048http://jamaica-star.com/article/entertainment/20151126/instagram-threatens-ban-lewd-photos-posted-rapper-gamehttp://www.vibe.com/2015/11/the-game-instagram-ban-meatprint/ (3 days old) "]}}